gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
#pragma once
#include <stdint.h>

// Definitions based these documents:
//   i.MX RT1050 Reference Manual, Rev. 1, 03/2018
//   ARM v7-M Architecture Reference Manual (DDI 0403E.b)
//   Adapted for the i.MX RT1062

enum IRQ_NUMBER_t
{
    IRQ_DMA_CH0 = 0,
    IRQ_DMA_CH1 = 1,
    IRQ_DMA_CH2 = 2,
    IRQ_DMA_CH3 = 3,
    IRQ_DMA_CH4 = 4,
    IRQ_DMA_CH5 = 5,
    IRQ_DMA_CH6 = 6,
    IRQ_DMA_CH7 = 7,
    IRQ_DMA_CH8 = 8,
    IRQ_DMA_CH9 = 9,
    IRQ_DMA_CH10 = 10,
    IRQ_DMA_CH11 = 11,
    IRQ_DMA_CH12 = 12,
    IRQ_DMA_CH13 = 13,
    IRQ_DMA_CH14 = 14,
    IRQ_DMA_CH15 = 15,
    IRQ_DMA_ERROR = 16,
    IRQ_CTI0 = 17,
    IRQ_CTI1 = 18,
    IRQ_CORE_ERROR = 19, // TODO - name?
    IRQ_LPUART1 = 20,
    IRQ_LPUART2 = 21,
    IRQ_LPUART3 = 22,
    IRQ_LPUART4 = 23,
    IRQ_LPUART5 = 24,
    IRQ_LPUART6 = 25,
    IRQ_LPUART7 = 26,
    IRQ_LPUART8 = 27,
    IRQ_LPI2C1 = 28,
    IRQ_LPI2C2 = 29,
    IRQ_LPI2C3 = 30,
    IRQ_LPI2C4 = 31,
    IRQ_LPSPI1 = 32,
    IRQ_LPSPI2 = 33,
    IRQ_LPSPI3 = 34,
    IRQ_LPSPI4 = 35,
    IRQ_CAN1 = 36,
    IRQ_CAN2 = 37,
    IRQ_ADDR_ERR = 38, // TODO: name?
    IRQ_KPP = 39,
    IRQ_TSC_DIG = 40,
    IRQ_GPR_IRQ = 41,
    IRQ_LCDIF = 42,
    IRQ_CSI = 43,
    IRQ_PXP = 44,
    IRQ_WDOG2 = 45,
    IRQ_SNVS_IRQ = 46,
    IRQ_SNVS_SECURITY = 47,
    IRQ_SNVS_ONOFF = 48,
    IRQ_CSU = 49,
    IRQ_DCP0 = 50, // TODO: ???
    IRQ_DCP1 = 51, // TODO: ???
    IRQ_DCP2 = 52, // TODO: ???
    IRQ_TRNG = 53,
    IRQ_SJC_IRQ = 54,
    IRQ_BEE = 55,
    IRQ_SAI1 = 56,
    IRQ_SAI2 = 57,
    IRQ_SAI3_RX = 58,
    IRQ_SAI3_TX = 59,
    IRQ_SPDIF = 60,
    IRQ_BROWNOUT0 = 61,
    IRQ_Reserved1 = 62,
    IRQ_TEMPERATURE = 63,
    IRQ_TEMPERATURE_PANIC = 64,
    IRQ_USBPHY0 = 65,
    IRQ_USBPHY1 = 66,
    IRQ_ADC1 = 67,
    IRQ_ADC2 = 68,
    IRQ_DCDC = 69,
    IRQ_SOFTWARE = 70,
    IRQ_Reserved2 = 71,
    IRQ_GPIO1_INT0 = 72,
    IRQ_GPIO1_INT1 = 73,
    IRQ_GPIO1_INT2 = 74,
    IRQ_GPIO1_INT3 = 75,
    IRQ_GPIO1_INT4 = 76,
    IRQ_GPIO1_INT5 = 77,
    IRQ_GPIO1_INT6 = 78,
    IRQ_GPIO1_INT7 = 79,
    IRQ_GPIO1_0_15 = 80,
    IRQ_GPIO1_16_31 = 81,
    IRQ_GPIO2_0_15 = 82,
    IRQ_GPIO2_16_31 = 83,
    IRQ_GPIO3_0_15 = 84,
    IRQ_GPIO3_16_31 = 85,
    IRQ_GPIO4_0_15 = 86,
    IRQ_GPIO4_16_31 = 87,
    IRQ_GPIO5_0_15 = 88,
    IRQ_GPIO5_16_31 = 89,
    IRQ_FLEXIO1 = 90,
    IRQ_FLEXIO2 = 91,
    IRQ_WDOG1 = 92,
    IRQ_RTWDOG = 93,
    IRQ_EWM = 94,
    IRQ_CCM1 = 95,
    IRQ_CCM2 = 96,
    IRQ_GPC = 97,
    IRQ_SRC = 98,
    IRQ_Reserved3 = 99,
    IRQ_GPT1 = 100,
    IRQ_GPT2 = 101,
    IRQ_FLEXPWM1_0 = 102,
    IRQ_FLEXPWM1_1 = 103,
    IRQ_FLEXPWM1_2 = 104,
    IRQ_FLEXPWM1_3 = 105,
    IRQ_FLEXPWM1_FAULT = 106,
    IRQ_FLEXSPI2 = 107, // RT1060 only
    IRQ_FLEXSPI = 108,
    IRQ_SEMC = 109,
    IRQ_SDHC1 = 110,
    IRQ_SDHC2 = 111,
    IRQ_USB2 = 112,
    IRQ_USB1 = 113,
    IRQ_ENET = 114,
    IRQ_ENET_TIMER = 115,
    IRQ_XBAR1_01 = 116,
    IRQ_XBAR1_23 = 117,
    IRQ_ADC_ETC0 = 118,
    IRQ_ADC_ETC1 = 119,
    IRQ_ADC_ETC2 = 120,
    IRQ_ADC_ETC_ERR = 121,
    IRQ_PIT = 122,
    IRQ_ACMP0 = 123,
    IRQ_ACMP1 = 124,
    IRQ_ACMP2 = 125,
    IRQ_ACMP3 = 126,
    IRQ_Reserved4 = 127,
    IRQ_Reserved5 = 128,
    IRQ_ENC1 = 129,
    IRQ_ENC2 = 130,
    IRQ_ENC3 = 131,
    IRQ_ENC4 = 132,
    IRQ_QTIMER1 = 133,
    IRQ_QTIMER2 = 134,
    IRQ_QTIMER3 = 135,
    IRQ_QTIMER4 = 136,
    IRQ_FLEXPWM2_0 = 137,
    IRQ_FLEXPWM2_1 = 138,
    IRQ_FLEXPWM2_2 = 139,
    IRQ_FLEXPWM2_3 = 140,
    IRQ_FLEXPWM2_FAULT = 141,
    IRQ_FLEXPWM3_0 = 142,
    IRQ_FLEXPWM3_1 = 143,
    IRQ_FLEXPWM3_2 = 144,
    IRQ_FLEXPWM3_3 = 145,
    IRQ_FLEXPWM3_FAULT = 146,
    IRQ_FLEXPWM4_0 = 147,
    IRQ_FLEXPWM4_1 = 148,
    IRQ_FLEXPWM4_2 = 149,
    IRQ_FLEXPWM4_3 = 150,
    IRQ_FLEXPWM4_FAULT = 151,
    IRQ_ENET2 = 152,       // RT1060 only
    IRQ_ENET2_TIMER = 153, // RT1060 only
    IRQ_CAN3 = 154,        // RT1060 only
    IRQ_Reserved6 = 155,
    IRQ_FLEXIO3 = 156,  // RT1060 only
    IRQ_GPIO6789 = 157, // RT1060 only
    IRQ_SJC_DEBUG = 158,
    IRQ_NMI_WAKEUP = 159
};
#define NVIC_NUM_INTERRUPTS 160
#define DMA_NUM_CHANNELS 32

#ifdef __cplusplus
extern "C" void (*_VectorsRam[NVIC_NUM_INTERRUPTS + 16])(void);
static inline void attachInterruptVector(IRQ_NUMBER_t irq, void (*function)(void)) __attribute__((always_inline, unused));
static inline void attachInterruptVector(IRQ_NUMBER_t irq, void (*function)(void))
{
    _VectorsRam[irq + 16] = function;
    asm volatile(""
                 :
                 :
                 : "memory");
}
#else
extern void (*_VectorsRam[NVIC_NUM_INTERRUPTS + 16])(void);
static inline void attachInterruptVector(enum IRQ_NUMBER_t irq, void (*function)(void)) __attribute__((always_inline, unused));
static inline void attachInterruptVector(enum IRQ_NUMBER_t irq, void (*function)(void))
{
    _VectorsRam[irq + 16] = function;
    asm volatile(""
                 :
                 :
                 : "memory");
}
#endif

#define DMAMUX_SOURCE_FLEXIO1_REQUEST0 0
#define DMAMUX_SOURCE_FLEXIO1_REQUEST1 0
#define DMAMUX_SOURCE_FLEXIO2_REQUEST0 1
#define DMAMUX_SOURCE_FLEXIO2_REQUEST1 1
#define DMAMUX_SOURCE_LPUART1_TX 2
#define DMAMUX_SOURCE_LPUART1_RX 3
#define DMAMUX_SOURCE_LPUART3_TX 4
#define DMAMUX_SOURCE_LPUART3_RX 5
#define DMAMUX_SOURCE_LPUART5_TX 6
#define DMAMUX_SOURCE_LPUART5_RX 7
#define DMAMUX_SOURCE_LPUART7_TX 8
#define DMAMUX_SOURCE_LPUART7_RX 9
#define DMAMUX_SOURCE_FLEXCAN3 11
#define DMAMUX_SOURCE_CSI 12
#define DMAMUX_SOURCE_LPSPI1_RX 13
#define DMAMUX_SOURCE_LPSPI1_TX 14
#define DMAMUX_SOURCE_LPSPI3_RX 15
#define DMAMUX_SOURCE_LPSPI3_TX 16
#define DMAMUX_SOURCE_LPI2C1 17
#define DMAMUX_SOURCE_LPI2C3 18
#define DMAMUX_SOURCE_SAI1_RX 19
#define DMAMUX_SOURCE_SAI1_TX 20
#define DMAMUX_SOURCE_SAI2_RX 21
#define DMAMUX_SOURCE_SAI2_TX 22
#define DMAMUX_SOURCE_ADC_ETC 23
#define DMAMUX_SOURCE_ADC1 24
#define DMAMUX_SOURCE_ACMP1 25
#define DMAMUX_SOURCE_ACMP3 26
#define DMAMUX_SOURCE_FLEXSPI_RX 28
#define DMAMUX_SOURCE_FLEXSPI_TX 29
#define DMAMUX_SOURCE_XBAR1_0 30
#define DMAMUX_SOURCE_XBAR1_1 31
#define DMAMUX_SOURCE_FLEXPWM1_READ0 32
#define DMAMUX_SOURCE_FLEXPWM1_READ1 33
#define DMAMUX_SOURCE_FLEXPWM1_READ2 34
#define DMAMUX_SOURCE_FLEXPWM1_READ3 35
#define DMAMUX_SOURCE_FLEXPWM1_WRITE0 36
#define DMAMUX_SOURCE_FLEXPWM1_WRITE1 37
#define DMAMUX_SOURCE_FLEXPWM1_WRITE2 38
#define DMAMUX_SOURCE_FLEXPWM1_WRITE3 39
#define DMAMUX_SOURCE_FLEXPWM3_READ0 40
#define DMAMUX_SOURCE_FLEXPWM3_READ1 41
#define DMAMUX_SOURCE_FLEXPWM3_READ2 42
#define DMAMUX_SOURCE_FLEXPWM3_READ3 43
#define DMAMUX_SOURCE_FLEXPWM3_WRITE0 44
#define DMAMUX_SOURCE_FLEXPWM3_WRITE1 45
#define DMAMUX_SOURCE_FLEXPWM3_WRITE2 46
#define DMAMUX_SOURCE_FLEXPWM3_WRITE3 47
#define DMAMUX_SOURCE_QTIMER1_READ0 48
#define DMAMUX_SOURCE_QTIMER1_READ1 49
#define DMAMUX_SOURCE_QTIMER1_READ2 50
#define DMAMUX_SOURCE_QTIMER1_READ3 51
#define DMAMUX_SOURCE_QTIMER1_WRITE0_CMPLD1 52
#define DMAMUX_SOURCE_QTIMER1_WRITE1_CMPLD1 53
#define DMAMUX_SOURCE_QTIMER1_WRITE2_CMPLD1 54
#define DMAMUX_SOURCE_QTIMER1_WRITE3_CMPLD1 55
#define DMAMUX_SOURCE_QTIMER1_WRITE1_CMPLD2 52
#define DMAMUX_SOURCE_QTIMER1_WRITE0_CMPLD2 53
#define DMAMUX_SOURCE_QTIMER1_WRITE3_CMPLD2 54
#define DMAMUX_SOURCE_QTIMER1_WRITE2_CMPLD2 55
#define DMAMUX_SOURCE_QTIMER3_READ0 56
#define DMAMUX_SOURCE_QTIMER3_READ1 57
#define DMAMUX_SOURCE_QTIMER3_READ2 58
#define DMAMUX_SOURCE_QTIMER3_READ3 59
#define DMAMUX_SOURCE_QTIMER3_WRITE0_CMPLD1 56
#define DMAMUX_SOURCE_QTIMER3_WRITE1_CMPLD1 57
#define DMAMUX_SOURCE_QTIMER3_WRITE2_CMPLD1 58
#define DMAMUX_SOURCE_QTIMER3_WRITE3_CMPLD1 59
#define DMAMUX_SOURCE_QTIMER3_WRITE1_CMPLD2 56
#define DMAMUX_SOURCE_QTIMER3_WRITE0_CMPLD2 57
#define DMAMUX_SOURCE_QTIMER3_WRITE3_CMPLD2 58
#define DMAMUX_SOURCE_QTIMER3_WRITE2_CMPLD2 59
#define DMAMUX_SOURCE_FLEXSPI2_RX 60
#define DMAMUX_SOURCE_FLEXSPI2_TX 61
#define DMAMUX_SOURCE_FLEXIO1_REQUEST2 64
#define DMAMUX_SOURCE_FLEXIO1_REQUEST3 64
#define DMAMUX_SOURCE_FLEXIO2_REQUEST2 65
#define DMAMUX_SOURCE_FLEXIO2_REQUEST3 65
#define DMAMUX_SOURCE_LPUART2_TX 66
#define DMAMUX_SOURCE_LPUART2_RX 67
#define DMAMUX_SOURCE_LPUART4_TX 68
#define DMAMUX_SOURCE_LPUART4_RX 69
#define DMAMUX_SOURCE_LPUART6_TX 70
#define DMAMUX_SOURCE_LPUART6_RX 71
#define DMAMUX_SOURCE_LPUART8_TX 72
#define DMAMUX_SOURCE_LPUART8_RX 73
#define DMAMUX_SOURCE_PXP 75
#define DMAMUX_SOURCE_LCDIF 76
#define DMAMUX_SOURCE_LPSPI2_RX 77
#define DMAMUX_SOURCE_LPSPI2_TX 78
#define DMAMUX_SOURCE_LPSPI4_RX 79
#define DMAMUX_SOURCE_LPSPI4_TX 80
#define DMAMUX_SOURCE_LPI2C2 81
#define DMAMUX_SOURCE_LPI2C4 82
#define DMAMUX_SOURCE_SAI3_RX 83
#define DMAMUX_SOURCE_SAI3_TX 84
#define DMAMUX_SOURCE_SPDIF_RX 85
#define DMAMUX_SOURCE_SPDIF_TX 86
#define DMAMUX_SOURCE_ADC2 88
#define DMAMUX_SOURCE_ACMP2 89
#define DMAMUX_SOURCE_ACMP4 90
#define DMAMUX_SOURCE_ENET1_TIMER0 92
#define DMAMUX_SOURCE_ENET1_TIMER1 93
#define DMAMUX_SOURCE_XBAR1_2 94
#define DMAMUX_SOURCE_XBAR1_3 95
#define DMAMUX_SOURCE_FLEXPWM2_READ0 96
#define DMAMUX_SOURCE_FLEXPWM2_READ1 97
#define DMAMUX_SOURCE_FLEXPWM2_READ2 98
#define DMAMUX_SOURCE_FLEXPWM2_READ3 99
#define DMAMUX_SOURCE_FLEXPWM2_WRITE0 100
#define DMAMUX_SOURCE_FLEXPWM2_WRITE1 101
#define DMAMUX_SOURCE_FLEXPWM2_WRITE2 102
#define DMAMUX_SOURCE_FLEXPWM2_WRITE3 103
#define DMAMUX_SOURCE_FLEXPWM4_READ0 104
#define DMAMUX_SOURCE_FLEXPWM4_READ1 105
#define DMAMUX_SOURCE_FLEXPWM4_READ2 106
#define DMAMUX_SOURCE_FLEXPWM4_READ3 107
#define DMAMUX_SOURCE_FLEXPWM4_WRITE0 108
#define DMAMUX_SOURCE_FLEXPWM4_WRITE1 109
#define DMAMUX_SOURCE_FLEXPWM4_WRITE2 110
#define DMAMUX_SOURCE_FLEXPWM4_WRITE3 111
#define DMAMUX_SOURCE_QTIMER2_READ0 112
#define DMAMUX_SOURCE_QTIMER2_READ1 113
#define DMAMUX_SOURCE_QTIMER2_READ2 114
#define DMAMUX_SOURCE_QTIMER2_READ3 115
#define DMAMUX_SOURCE_QTIMER2_WRITE0_CMPLD1 116
#define DMAMUX_SOURCE_QTIMER2_WRITE1_CMPLD1 117
#define DMAMUX_SOURCE_QTIMER2_WRITE2_CMPLD1 118
#define DMAMUX_SOURCE_QTIMER2_WRITE3_CMPLD1 119
#define DMAMUX_SOURCE_QTIMER2_WRITE1_CMPLD2 116
#define DMAMUX_SOURCE_QTIMER2_WRITE0_CMPLD2 117
#define DMAMUX_SOURCE_QTIMER2_WRITE3_CMPLD2 118
#define DMAMUX_SOURCE_QTIMER2_WRITE2_CMPLD2 119
#define DMAMUX_SOURCE_QTIMER4_READ0 120
#define DMAMUX_SOURCE_QTIMER4_READ1 121
#define DMAMUX_SOURCE_QTIMER4_READ2 122
#define DMAMUX_SOURCE_QTIMER4_READ3 123
#define DMAMUX_SOURCE_QTIMER4_WRITE0_CMPLD1 120
#define DMAMUX_SOURCE_QTIMER4_WRITE1_CMPLD1 121
#define DMAMUX_SOURCE_QTIMER4_WRITE2_CMPLD1 122
#define DMAMUX_SOURCE_QTIMER4_WRITE3_CMPLD1 123
#define DMAMUX_SOURCE_QTIMER4_WRITE1_CMPLD2 120
#define DMAMUX_SOURCE_QTIMER4_WRITE0_CMPLD2 121
#define DMAMUX_SOURCE_QTIMER4_WRITE3_CMPLD2 122
#define DMAMUX_SOURCE_QTIMER4_WRITE2_CMPLD2 123
#define DMAMUX_SOURCE_ENET2_TIMER0 124
#define DMAMUX_SOURCE_ENET2_TIMER1 125

typedef struct
{
    volatile uint32_t offset000;
    volatile uint32_t offset004;
    volatile uint32_t offset008;
    volatile uint32_t offset00C;
    volatile uint32_t offset010;
    volatile uint32_t offset014;
    volatile uint32_t offset018;
    volatile uint32_t offset01C;
    volatile uint32_t offset020;
    volatile uint32_t offset024;
    volatile uint32_t offset028;
    volatile uint32_t offset02C;
    volatile uint32_t offset030;
    volatile uint32_t offset034;
    volatile uint32_t offset038;
    volatile uint32_t offset03C;
    volatile uint32_t offset040;
    volatile uint32_t offset044;
    volatile uint32_t offset048;
    volatile uint32_t offset04C;
    volatile uint32_t offset050;
    volatile uint32_t offset054;
    volatile uint32_t offset058;
    volatile uint32_t offset05C;
    volatile uint32_t offset060;
    volatile uint32_t offset064;
    volatile uint32_t offset068;
    volatile uint32_t offset06C;
    volatile uint32_t offset070;
    volatile uint32_t offset074;
    volatile uint32_t offset078;
    volatile uint32_t offset07C;
    volatile uint32_t offset080;
    volatile uint32_t offset084;
    volatile uint32_t offset088;
    volatile uint32_t offset08C;
    volatile uint32_t offset090;
    volatile uint32_t offset094;
    volatile uint32_t offset098;
    volatile uint32_t offset09C;
    volatile uint32_t offset0A0;
    volatile uint32_t offset0A4;
    volatile uint32_t offset0A8;
    volatile uint32_t offset0AC;
    volatile uint32_t offset0B0;
    volatile uint32_t offset0B4;
    volatile uint32_t offset0B8;
    volatile uint32_t offset0BC;
    volatile uint32_t offset0C0;
    volatile uint32_t offset0C4;
    volatile uint32_t offset0C8;
    volatile uint32_t offset0CC;
    volatile uint32_t offset0D0;
    volatile uint32_t offset0D4;
    volatile uint32_t offset0D8;
    volatile uint32_t offset0DC;
    volatile uint32_t offset0E0;
    volatile uint32_t offset0E4;
    volatile uint32_t offset0E8;
    volatile uint32_t offset0EC;
    volatile uint32_t offset0F0;
    volatile uint32_t offset0F4;
    volatile uint32_t offset0F8;
    volatile uint32_t offset0FC;
    volatile uint32_t offset100;
    volatile uint32_t offset104;
    volatile uint32_t offset108;
    volatile uint32_t offset10C;
    volatile uint32_t offset110;
    volatile uint32_t offset114;
    volatile uint32_t offset118;
    volatile uint32_t offset11C;
    volatile uint32_t offset120;
    volatile uint32_t offset124;
    volatile uint32_t offset128;
    volatile uint32_t offset12C;
    volatile uint32_t offset130;
    volatile uint32_t offset134;
    volatile uint32_t offset138;
    volatile uint32_t offset13C;
    volatile uint32_t offset140;
    volatile uint32_t offset144;
    volatile uint32_t offset148;
    volatile uint32_t offset14C;
    volatile uint32_t offset150;
    volatile uint32_t offset154;
    volatile uint32_t offset158;
    volatile uint32_t offset15C;
    volatile uint32_t offset160;
    volatile uint32_t offset164;
    volatile uint32_t offset168;
    volatile uint32_t offset16C;
    volatile uint32_t offset170;
    volatile uint32_t offset174;
    volatile uint32_t offset178;
    volatile uint32_t offset17C;
    volatile uint32_t offset180;
    volatile uint32_t offset184;
    volatile uint32_t offset188;
    volatile uint32_t offset18C;
    volatile uint32_t offset190;
    volatile uint32_t offset194;
    volatile uint32_t offset198;
    volatile uint32_t offset19C;
    volatile uint32_t offset1A0;
    volatile uint32_t offset1A4;
    volatile uint32_t offset1A8;
    volatile uint32_t offset1AC;
    volatile uint32_t offset1B0;
    volatile uint32_t offset1B4;
    volatile uint32_t offset1B8;
    volatile uint32_t offset1BC;
    volatile uint32_t offset1C0;
    volatile uint32_t offset1C4;
    volatile uint32_t offset1C8;
    volatile uint32_t offset1CC;
    volatile uint32_t offset1D0;
    volatile uint32_t offset1D4;
    volatile uint32_t offset1D8;
    volatile uint32_t offset1DC;
    volatile uint32_t offset1E0;
    volatile uint32_t offset1E4;
    volatile uint32_t offset1E8;
    volatile uint32_t offset1EC;
    volatile uint32_t offset1F0;
    volatile uint32_t offset1F4;
    volatile uint32_t offset1F8;
    volatile uint32_t offset1FC;
    volatile uint32_t offset200;
    volatile uint32_t offset204;
    volatile uint32_t offset208;
    volatile uint32_t offset20C;
    volatile uint32_t offset210;
    volatile uint32_t offset214;
    volatile uint32_t offset218;
    volatile uint32_t offset21C;
    volatile uint32_t offset220;
    volatile uint32_t offset224;
    volatile uint32_t offset228;
    volatile uint32_t offset22C;
    volatile uint32_t offset230;
    volatile uint32_t offset234;
    volatile uint32_t offset238;
    volatile uint32_t offset23C;
    volatile uint32_t offset240;
    volatile uint32_t offset244;
    volatile uint32_t offset248;
    volatile uint32_t offset24C;
    volatile uint32_t offset250;
    volatile uint32_t offset254;
    volatile uint32_t offset258;
    volatile uint32_t offset25C;
    volatile uint32_t offset260;
    volatile uint32_t offset264;
    volatile uint32_t offset268;
    volatile uint32_t offset26C;
    volatile uint32_t offset270;
    volatile uint32_t offset274;
    volatile uint32_t offset278;
    volatile uint32_t offset27C;
    volatile uint32_t offset280;
    volatile uint32_t offset284;
    volatile uint32_t offset288;
    volatile uint32_t offset28C;
    volatile uint32_t offset290;
    volatile uint32_t offset294;
    volatile uint32_t offset298;
    volatile uint32_t offset29C;
    volatile uint32_t offset2A0;
    volatile uint32_t offset2A4;
    volatile uint32_t offset2A8;
    volatile uint32_t offset2AC;
    volatile uint32_t offset2B0;
    volatile uint32_t offset2B4;
    volatile uint32_t offset2B8;
    volatile uint32_t offset2BC;
    volatile uint32_t offset2C0;
    volatile uint32_t offset2C4;
    volatile uint32_t offset2C8;
    volatile uint32_t offset2CC;
    volatile uint32_t offset2D0;
    volatile uint32_t offset2D4;
    volatile uint32_t offset2D8;
    volatile uint32_t offset2DC;
    volatile uint32_t offset2E0;
    volatile uint32_t offset2E4;
    volatile uint32_t offset2E8;
    volatile uint32_t offset2EC;
    volatile uint32_t offset2F0;
    volatile uint32_t offset2F4;
    volatile uint32_t offset2F8;
    volatile uint32_t offset2FC;
    volatile uint32_t offset300;
    volatile uint32_t offset304;
    volatile uint32_t offset308;
    volatile uint32_t offset30C;
    volatile uint32_t offset310;
    volatile uint32_t offset314;
    volatile uint32_t offset318;
    volatile uint32_t offset31C;
    volatile uint32_t offset320;
    volatile uint32_t offset324;
    volatile uint32_t offset328;
    volatile uint32_t offset32C;
    volatile uint32_t offset330;
    volatile uint32_t offset334;
    volatile uint32_t offset338;
    volatile uint32_t offset33C;
    volatile uint32_t offset340;
    volatile uint32_t offset344;
    volatile uint32_t offset348;
    volatile uint32_t offset34C;
    volatile uint32_t offset350;
    volatile uint32_t offset354;
    volatile uint32_t offset358;
    volatile uint32_t offset35C;
    volatile uint32_t offset360;
    volatile uint32_t offset364;
    volatile uint32_t offset368;
    volatile uint32_t offset36C;
    volatile uint32_t offset370;
    volatile uint32_t offset374;
    volatile uint32_t offset378;
    volatile uint32_t offset37C;
    volatile uint32_t offset380;
    volatile uint32_t offset384;
    volatile uint32_t offset388;
    volatile uint32_t offset38C;
    volatile uint32_t offset390;
    volatile uint32_t offset394;
    volatile uint32_t offset398;
    volatile uint32_t offset39C;
    volatile uint32_t offset3A0;
    volatile uint32_t offset3A4;
    volatile uint32_t offset3A8;
    volatile uint32_t offset3AC;
    volatile uint32_t offset3B0;
    volatile uint32_t offset3B4;
    volatile uint32_t offset3B8;
    volatile uint32_t offset3BC;
    volatile uint32_t offset3C0;
    volatile uint32_t offset3C4;
    volatile uint32_t offset3C8;
    volatile uint32_t offset3CC;
    volatile uint32_t offset3D0;
    volatile uint32_t offset3D4;
    volatile uint32_t offset3D8;
    volatile uint32_t offset3DC;
    volatile uint32_t offset3E0;
    volatile uint32_t offset3E4;
    volatile uint32_t offset3E8;
    volatile uint32_t offset3EC;
    volatile uint32_t offset3F0;
    volatile uint32_t offset3F4;
    volatile uint32_t offset3F8;
    volatile uint32_t offset3FC;
} IMXRT_REGISTER32_t;

