gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
typedef struct
{
    volatile uint16_t offset000;
    volatile uint16_t offset002;
    volatile uint16_t offset004;
    volatile uint16_t offset006;
    volatile uint16_t offset008;
    volatile uint16_t offset00A;
    volatile uint16_t offset00C;
    volatile uint16_t offset00E;
    volatile uint16_t offset010;
    volatile uint16_t offset012;
    volatile uint16_t offset014;
    volatile uint16_t offset016;
    volatile uint16_t offset018;
    volatile uint16_t offset01A;
    volatile uint16_t offset01C;
    volatile uint16_t offset01E;
    volatile uint16_t offset020;
    volatile uint16_t offset022;
    volatile uint16_t offset024;
    volatile uint16_t offset026;
    volatile uint16_t offset028;
    volatile uint16_t offset02A;
    volatile uint16_t offset02C;
    volatile uint16_t offset02E;
    volatile uint16_t offset030;
    volatile uint16_t offset032;
    volatile uint16_t offset034;
    volatile uint16_t offset036;
    volatile uint16_t offset038;
    volatile uint16_t offset03A;
    volatile uint16_t offset03C;
    volatile uint16_t offset03E;
    volatile uint16_t offset040;
    volatile uint16_t offset042;
    volatile uint16_t offset044;
    volatile uint16_t offset046;
    volatile uint16_t offset048;
    volatile uint16_t offset04A;
    volatile uint16_t offset04C;
    volatile uint16_t offset04E;
    volatile uint16_t offset050;
    volatile uint16_t offset052;
    volatile uint16_t offset054;
    volatile uint16_t offset056;
    volatile uint16_t offset058;
    volatile uint16_t offset05A;
    volatile uint16_t offset05C;
    volatile uint16_t offset05E;
    volatile uint16_t offset060;
    volatile uint16_t offset062;
    volatile uint16_t offset064;
    volatile uint16_t offset066;
    volatile uint16_t offset068;
    volatile uint16_t offset06A;
    volatile uint16_t offset06C;
    volatile uint16_t offset06E;
    volatile uint16_t offset070;
    volatile uint16_t offset072;
    volatile uint16_t offset074;
    volatile uint16_t offset076;
    volatile uint16_t offset078;
    volatile uint16_t offset07A;
    volatile uint16_t offset07C;
    volatile uint16_t offset07E;
    volatile uint16_t offset080;
    volatile uint16_t offset082;
    volatile uint16_t offset084;
    volatile uint16_t offset086;
    volatile uint16_t offset088;
    volatile uint16_t offset08A;
    volatile uint16_t offset08C;
    volatile uint16_t offset08E;
    volatile uint16_t offset090;
    volatile uint16_t offset092;
    volatile uint16_t offset094;
    volatile uint16_t offset096;
    volatile uint16_t offset098;
    volatile uint16_t offset09A;
    volatile uint16_t offset09C;
    volatile uint16_t offset09E;
    volatile uint16_t offset0A0;
    volatile uint16_t offset0A2;
    volatile uint16_t offset0A4;
    volatile uint16_t offset0A6;
    volatile uint16_t offset0A8;
    volatile uint16_t offset0AA;
    volatile uint16_t offset0AC;
    volatile uint16_t offset0AE;
    volatile uint16_t offset0B0;
    volatile uint16_t offset0B2;
    volatile uint16_t offset0B4;
    volatile uint16_t offset0B6;
    volatile uint16_t offset0B8;
    volatile uint16_t offset0BA;
    volatile uint16_t offset0BC;
    volatile uint16_t offset0BE;
    volatile uint16_t offset0C0;
    volatile uint16_t offset0C2;
    volatile uint16_t offset0C4;
    volatile uint16_t offset0C6;
    volatile uint16_t offset0C8;
    volatile uint16_t offset0CA;
    volatile uint16_t offset0CC;
    volatile uint16_t offset0CE;
    volatile uint16_t offset0D0;
    volatile uint16_t offset0D2;
    volatile uint16_t offset0D4;
    volatile uint16_t offset0D6;
    volatile uint16_t offset0D8;
    volatile uint16_t offset0DA;
    volatile uint16_t offset0DC;
    volatile uint16_t offset0DE;
    volatile uint16_t offset0E0;
    volatile uint16_t offset0E2;
    volatile uint16_t offset0E4;
    volatile uint16_t offset0E6;
    volatile uint16_t offset0E8;
    volatile uint16_t offset0EA;
    volatile uint16_t offset0EC;
    volatile uint16_t offset0EE;
    volatile uint16_t offset0F0;
    volatile uint16_t offset0F2;
    volatile uint16_t offset0F4;
    volatile uint16_t offset0F6;
    volatile uint16_t offset0F8;
    volatile uint16_t offset0FA;
    volatile uint16_t offset0FC;
    volatile uint16_t offset0FE;
    volatile uint16_t offset100;
    volatile uint16_t offset102;
    volatile uint16_t offset104;
    volatile uint16_t offset106;
    volatile uint16_t offset108;
    volatile uint16_t offset10A;
    volatile uint16_t offset10C;
    volatile uint16_t offset10E;
    volatile uint16_t offset110;
    volatile uint16_t offset112;
    volatile uint16_t offset114;
    volatile uint16_t offset116;
    volatile uint16_t offset118;
    volatile uint16_t offset11A;
    volatile uint16_t offset11C;
    volatile uint16_t offset11E;
    volatile uint16_t offset120;
    volatile uint16_t offset122;
    volatile uint16_t offset124;
    volatile uint16_t offset126;
    volatile uint16_t offset128;
    volatile uint16_t offset12A;
    volatile uint16_t offset12C;
    volatile uint16_t offset12E;
    volatile uint16_t offset130;
    volatile uint16_t offset132;
    volatile uint16_t offset134;
    volatile uint16_t offset136;
    volatile uint16_t offset138;
    volatile uint16_t offset13A;
    volatile uint16_t offset13C;
    volatile uint16_t offset13E;
    volatile uint16_t offset140;
    volatile uint16_t offset142;
    volatile uint16_t offset144;
    volatile uint16_t offset146;
    volatile uint16_t offset148;
    volatile uint16_t offset14A;
    volatile uint16_t offset14C;
    volatile uint16_t offset14E;
    volatile uint16_t offset150;
    volatile uint16_t offset152;
    volatile uint16_t offset154;
    volatile uint16_t offset156;
    volatile uint16_t offset158;
    volatile uint16_t offset15A;
    volatile uint16_t offset15C;
    volatile uint16_t offset15E;
    volatile uint16_t offset160;
    volatile uint16_t offset162;
    volatile uint16_t offset164;
    volatile uint16_t offset166;
    volatile uint16_t offset168;
    volatile uint16_t offset16A;
    volatile uint16_t offset16C;
    volatile uint16_t offset16E;
    volatile uint16_t offset170;
    volatile uint16_t offset172;
    volatile uint16_t offset174;
    volatile uint16_t offset176;
    volatile uint16_t offset178;
    volatile uint16_t offset17A;
    volatile uint16_t offset17C;
    volatile uint16_t offset17E;
    volatile uint16_t offset180;
    volatile uint16_t offset182;
    volatile uint16_t offset184;
    volatile uint16_t offset186;
    volatile uint16_t offset188;
    volatile uint16_t offset18A;
    volatile uint16_t offset18C;
    volatile uint16_t offset18E;
    volatile uint16_t offset190;
    volatile uint16_t offset192;
    volatile uint16_t offset194;
    volatile uint16_t offset196;
    volatile uint16_t offset198;
    volatile uint16_t offset19A;
    volatile uint16_t offset19C;
    volatile uint16_t offset19E;
    volatile uint16_t offset1A0;
    volatile uint16_t offset1A2;
    volatile uint16_t offset1A4;
    volatile uint16_t offset1A6;
    volatile uint16_t offset1A8;
    volatile uint16_t offset1AA;
    volatile uint16_t offset1AC;
    volatile uint16_t offset1AE;
    volatile uint16_t offset1B0;
    volatile uint16_t offset1B2;
    volatile uint16_t offset1B4;
    volatile uint16_t offset1B6;
    volatile uint16_t offset1B8;
    volatile uint16_t offset1BA;
    volatile uint16_t offset1BC;
    volatile uint16_t offset1BE;
    volatile uint16_t offset1C0;
    volatile uint16_t offset1C2;
    volatile uint16_t offset1C4;
    volatile uint16_t offset1C6;
    volatile uint16_t offset1C8;
    volatile uint16_t offset1CA;
    volatile uint16_t offset1CC;
    volatile uint16_t offset1CE;
    volatile uint16_t offset1D0;
    volatile uint16_t offset1D2;
    volatile uint16_t offset1D4;
    volatile uint16_t offset1D6;
    volatile uint16_t offset1D8;
    volatile uint16_t offset1DA;
    volatile uint16_t offset1DC;
    volatile uint16_t offset1DE;
    volatile uint16_t offset1E0;
    volatile uint16_t offset1E2;
    volatile uint16_t offset1E4;
    volatile uint16_t offset1E6;
    volatile uint16_t offset1E8;
    volatile uint16_t offset1EA;
    volatile uint16_t offset1EC;
    volatile uint16_t offset1EE;
    volatile uint16_t offset1F0;
    volatile uint16_t offset1F2;
    volatile uint16_t offset1F4;
    volatile uint16_t offset1F6;
    volatile uint16_t offset1F8;
    volatile uint16_t offset1FA;
    volatile uint16_t offset1FC;
    volatile uint16_t offset1FE;
} IMXRT_REGISTER16_t;

typedef struct
{
    volatile uint8_t offset00;
    volatile uint8_t offset01;
    volatile uint8_t offset02;
    volatile uint8_t offset03;
    volatile uint8_t offset04;
    volatile uint8_t offset05;
    volatile uint8_t offset06;
    volatile uint8_t offset07;
    volatile uint8_t offset08;
    volatile uint8_t offset09;
    volatile uint8_t offset0A;
    volatile uint8_t offset0B;
    volatile uint8_t offset0C;
    volatile uint8_t offset0D;
    volatile uint8_t offset0E;
    volatile uint8_t offset0F;
} IMXRT_REGISTER8_t;

// 13.3: page 456
#define IMXRT_CMP1 (*(IMXRT_REGISTER8_t *)0x40094000)
#define CMP1_CR0 (IMXRT_CMP1.offset00)
#define CMP1_CR1 (IMXRT_CMP1.offset01)
#define CMP1_FPR (IMXRT_CMP1.offset02)
#define CMP1_SCR (IMXRT_CMP1.offset03)
#define CMP1_DACCR (IMXRT_CMP1.offset04)
#define CMP1_MUXCR (IMXRT_CMP1.offset05)
#define IMXRT_CMP2 (*(IMXRT_REGISTER8_t *)0x40094008)
#define CMP2_CR0 (IMXRT_CMP2.offset00)
#define CMP2_CR1 (IMXRT_CMP2.offset01)
#define CMP2_FPR (IMXRT_CMP2.offset02)
#define CMP2_SCR (IMXRT_CMP2.offset03)
#define CMP2_DACCR (IMXRT_CMP2.offset04)
#define CMP2_MUXCR (IMXRT_CMP2.offset05)
#define IMXRT_CMP3 (*(IMXRT_REGISTER8_t *)0x40094010)
#define CMP3_CR0 (IMXRT_CMP3.offset00)
#define CMP3_CR1 (IMXRT_CMP3.offset01)
#define CMP3_FPR (IMXRT_CMP3.offset02)
#define CMP3_SCR (IMXRT_CMP3.offset03)
#define CMP3_DACCR (IMXRT_CMP3.offset04)
#define CMP3_MUXCR (IMXRT_CMP3.offset05)
#define IMXRT_CMP4 (*(IMXRT_REGISTER8_t *)0x40094018)
#define CMP4_CR0 (IMXRT_CMP4.offset00)
#define CMP4_CR1 (IMXRT_CMP4.offset01)
#define CMP4_FPR (IMXRT_CMP4.offset02)
#define CMP4_SCR (IMXRT_CMP4.offset03)
#define CMP4_DACCR (IMXRT_CMP4.offset04)
#define CMP4_MUXCR (IMXRT_CMP4.offset05)

