gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
// 14.6: page 505
#define IMXRT_ADC1 (*(IMXRT_REGISTER32_t *)0x400C4000)
#define ADC1_HC0 (IMXRT_ADC1.offset000)
#define ADC1_HC1 (IMXRT_ADC1.offset004)
#define ADC1_HC2 (IMXRT_ADC1.offset008)
#define ADC1_HC3 (IMXRT_ADC1.offset00C)
#define ADC1_HC4 (IMXRT_ADC1.offset010)
#define ADC1_HC5 (IMXRT_ADC1.offset014)
#define ADC1_HC6 (IMXRT_ADC1.offset018)
#define ADC1_HC7 (IMXRT_ADC1.offset01C)
#define ADC1_HS (IMXRT_ADC1.offset020)
#define ADC1_R0 (IMXRT_ADC1.offset024)
#define ADC1_R1 (IMXRT_ADC1.offset028)
#define ADC1_R2 (IMXRT_ADC1.offset02C)
#define ADC1_R3 (IMXRT_ADC1.offset030)
#define ADC1_R4 (IMXRT_ADC1.offset034)
#define ADC1_R5 (IMXRT_ADC1.offset038)
#define ADC1_R6 (IMXRT_ADC1.offset03C)
#define ADC1_R7 (IMXRT_ADC1.offset040)
#define ADC1_CFG (IMXRT_ADC1.offset044)
#define ADC1_GC (IMXRT_ADC1.offset048)
#define ADC1_GS (IMXRT_ADC1.offset04C)
#define ADC1_CV (IMXRT_ADC1.offset050)
#define ADC1_OFS (IMXRT_ADC1.offset054)
#define ADC1_CAL (IMXRT_ADC1.offset058)
#define IMXRT_ADC2 (*(IMXRT_REGISTER32_t *)0x400C8000)
#define ADC2_HC0 (IMXRT_ADC2.offset000)
#define ADC2_HC1 (IMXRT_ADC2.offset004)
#define ADC2_HC2 (IMXRT_ADC2.offset008)
#define ADC2_HC3 (IMXRT_ADC2.offset00C)
#define ADC2_HC4 (IMXRT_ADC2.offset010)
#define ADC2_HC5 (IMXRT_ADC2.offset014)
#define ADC2_HC6 (IMXRT_ADC2.offset018)
#define ADC2_HC7 (IMXRT_ADC2.offset01C)
#define ADC2_HS (IMXRT_ADC2.offset020)
#define ADC2_R0 (IMXRT_ADC2.offset024)
#define ADC2_R1 (IMXRT_ADC2.offset028)
#define ADC2_R2 (IMXRT_ADC2.offset02C)
#define ADC2_R3 (IMXRT_ADC2.offset030)
#define ADC2_R4 (IMXRT_ADC2.offset034)
#define ADC2_R5 (IMXRT_ADC2.offset038)
#define ADC2_R6 (IMXRT_ADC2.offset03C)
#define ADC2_R7 (IMXRT_ADC2.offset040)
#define ADC2_CFG (IMXRT_ADC2.offset044)
#define ADC2_GC (IMXRT_ADC2.offset048)
#define ADC2_GS (IMXRT_ADC2.offset04C)
#define ADC2_CV (IMXRT_ADC2.offset050)
#define ADC2_OFS (IMXRT_ADC2.offset054)
#define ADC2_CAL (IMXRT_ADC2.offset058)
#define ADC_HC_AIEN ((uint32_t)(1 << 7))
#define ADC_HC_ADCH(n) ((uint32_t)(((n)&0x1F) << 0))
#define ADC_HS_COCO0 ((uint32_t)(1 << 0))
#define ADC_CFG_OVWREN ((uint32_t)(1 << 16))
#define ADC_CFG_AVGS(n) ((uint32_t)(((n)&0x03) << 14))
#define ADC_CFG_ADTRG ((uint32_t)(1 << 13))
#define ADC_CFG_REFSEL(n) ((uint32_t)(((n)&0x03) << 11))
#define ADC_CFG_ADHSC ((uint32_t)(1 << 10))
#define ADC_CFG_ADSTS(n) ((uint32_t)(((n)&0x03) << 8))
#define ADC_CFG_ADLPC ((uint32_t)(1 << 7))
#define ADC_CFG_ADIV(n) ((uint32_t)(((n)&0x03) << 5))
#define ADC_CFG_ADLSMP ((uint32_t)(1 << 4))
#define ADC_CFG_MODE(n) ((uint32_t)(((n)&0x03) << 2))
#define ADC_CFG_ADICLK(n) ((uint32_t)(((n)&0x03) << 0))
#define ADC_GC_CAL ((uint32_t)(1 << 7))
#define ADC_GC_ADCO ((uint32_t)(1 << 6))
#define ADC_GC_AVGE ((uint32_t)(1 << 5))
#define ADC_GC_ACFE ((uint32_t)(1 << 4))
#define ADC_GC_ACFGT ((uint32_t)(1 << 3))
#define ADC_GC_ACREN ((uint32_t)(1 << 2))
#define ADC_GC_DMAEN ((uint32_t)(1 << 1))
#define ADC_GC_ADACKEN ((uint32_t)(1 << 0))
#define ADC_GS_AWKST ((uint32_t)(1 << 2))
#define ADC_GS_CALF ((uint32_t)(1 << 1))
#define ADC_GS_ADACT ((uint32_t)(1 << 0))
#define ADC_CV_CV2(n) ((uint32_t)(((n)&0xFFF) << 16))
#define ADC_CV_CV1(n) ((uint32_t)(((n)&0xFFF) << 0))
#define ADC_OFS_SIGN ((uint32_t)(1 << 12))
#define ADC_OFS_OFS(n) ((uint32_t)(((n)&0xFFF) << 0))
#define ADC_CAL_CAL_CODE(n) ((uint32_t)(((n)&0x0F) << 0))

// 15.4.1.1: page 527
#define IMXRT_ADC_ETC (*(IMXRT_REGISTER32_t *)0x403B0000)
#define ADC_ETC_CTRL (IMXRT_ADC_ETC.offset000)
#define ADC_ETC_DONE0_1_IRQ (IMXRT_ADC_ETC.offset004)
#define ADC_ETC_DONE2_ERR_IRQ (IMXRT_ADC_ETC.offset008)
#define ADC_ETC_DMA_CTRL (IMXRT_ADC_ETC.offset00C)
#define ADC_ETC_TRIG0_CTRL (IMXRT_ADC_ETC.offset010)
#define ADC_ETC_TRIG0_COUNTER (IMXRT_ADC_ETC.offset014)
#define ADC_ETC_TRIG0_CHAIN_1_0 (IMXRT_ADC_ETC.offset018)
#define ADC_ETC_TRIG0_CHAIN_3_2 (IMXRT_ADC_ETC.offset01C)
#define ADC_ETC_TRIG0_CHAIN_5_4 (IMXRT_ADC_ETC.offset020)
#define ADC_ETC_TRIG0_CHAIN_7_6 (IMXRT_ADC_ETC.offset024)
#define ADC_ETC_TRIG0_RESULT_1_0 (IMXRT_ADC_ETC.offset028)
#define ADC_ETC_TRIG0_RESULT_3_2 (IMXRT_ADC_ETC.offset02C)
#define ADC_ETC_TRIG0_RESULT_5_4 (IMXRT_ADC_ETC.offset030)
#define ADC_ETC_TRIG0_RESULT_7_6 (IMXRT_ADC_ETC.offset034)
#define ADC_ETC_TRIG1_CTRL (IMXRT_ADC_ETC.offset038)
#define ADC_ETC_TRIG1_COUNTER (IMXRT_ADC_ETC.offset03C)
#define ADC_ETC_TRIG1_CHAIN_1_0 (IMXRT_ADC_ETC.offset040)
#define ADC_ETC_TRIG1_CHAIN_3_2 (IMXRT_ADC_ETC.offset044)
#define ADC_ETC_TRIG1_CHAIN_5_4 (IMXRT_ADC_ETC.offset048)
#define ADC_ETC_TRIG1_CHAIN_7_6 (IMXRT_ADC_ETC.offset04C)
#define ADC_ETC_TRIG1_RESULT_1_0 (IMXRT_ADC_ETC.offset050)
#define ADC_ETC_TRIG1_RESULT_3_2 (IMXRT_ADC_ETC.offset054)
#define ADC_ETC_TRIG1_RESULT_5_4 (IMXRT_ADC_ETC.offset058)
#define ADC_ETC_TRIG1_RESULT_7_6 (IMXRT_ADC_ETC.offset05C)
#define ADC_ETC_TRIG2_CTRL (IMXRT_ADC_ETC.offset060)
#define ADC_ETC_TRIG2_COUNTER (IMXRT_ADC_ETC.offset064)
#define ADC_ETC_TRIG2_CHAIN_1_0 (IMXRT_ADC_ETC.offset068)
#define ADC_ETC_TRIG2_CHAIN_3_2 (IMXRT_ADC_ETC.offset06C)
#define ADC_ETC_TRIG2_CHAIN_5_4 (IMXRT_ADC_ETC.offset070)
#define ADC_ETC_TRIG2_CHAIN_7_6 (IMXRT_ADC_ETC.offset074)
#define ADC_ETC_TRIG2_RESULT_1_0 (IMXRT_ADC_ETC.offset078)
#define ADC_ETC_TRIG2_RESULT_3_2 (IMXRT_ADC_ETC.offset07C)
#define ADC_ETC_TRIG2_RESULT_5_4 (IMXRT_ADC_ETC.offset080)
#define ADC_ETC_TRIG2_RESULT_7_6 (IMXRT_ADC_ETC.offset084)
#define ADC_ETC_TRIG3_CTRL (IMXRT_ADC_ETC.offset088)
#define ADC_ETC_TRIG3_COUNTER (IMXRT_ADC_ETC.offset08C)
#define ADC_ETC_TRIG3_CHAIN_1_0 (IMXRT_ADC_ETC.offset090)
#define ADC_ETC_TRIG3_CHAIN_3_2 (IMXRT_ADC_ETC.offset094)
#define ADC_ETC_TRIG3_CHAIN_5_4 (IMXRT_ADC_ETC.offset098)
#define ADC_ETC_TRIG3_CHAIN_7_6 (IMXRT_ADC_ETC.offset09C)
#define ADC_ETC_TRIG3_RESULT_1_0 (IMXRT_ADC_ETC.offset0A0)
#define ADC_ETC_TRIG3_RESULT_3_2 (IMXRT_ADC_ETC.offset0A4)
#define ADC_ETC_TRIG3_RESULT_5_4 (IMXRT_ADC_ETC.offset0A8)
#define ADC_ETC_TRIG3_RESULT_7_6 (IMXRT_ADC_ETC.offset0AC)
#define ADC_ETC_TRIG4_CTRL (IMXRT_ADC_ETC.offset0B0)
#define ADC_ETC_TRIG4_COUNTER (IMXRT_ADC_ETC.offset0B4)
#define ADC_ETC_TRIG4_CHAIN_1_0 (IMXRT_ADC_ETC.offset0B8)
#define ADC_ETC_TRIG4_CHAIN_3_2 (IMXRT_ADC_ETC.offset0BC)
#define ADC_ETC_TRIG4_CHAIN_5_4 (IMXRT_ADC_ETC.offset0C0)
#define ADC_ETC_TRIG4_CHAIN_7_6 (IMXRT_ADC_ETC.offset0C4)
#define ADC_ETC_TRIG4_RESULT_1_0 (IMXRT_ADC_ETC.offset0C8)
#define ADC_ETC_TRIG4_RESULT_3_2 (IMXRT_ADC_ETC.offset0CC)
#define ADC_ETC_TRIG4_RESULT_5_4 (IMXRT_ADC_ETC.offset0D0)
#define ADC_ETC_TRIG4_RESULT_7_6 (IMXRT_ADC_ETC.offset0D4)
#define ADC_ETC_TRIG5_CTRL (IMXRT_ADC_ETC.offset0D8)
#define ADC_ETC_TRIG5_COUNTER (IMXRT_ADC_ETC.offset0DC)
#define ADC_ETC_TRIG5_CHAIN_1_0 (IMXRT_ADC_ETC.offset0E0)
#define ADC_ETC_TRIG5_CHAIN_3_2 (IMXRT_ADC_ETC.offset0E4)
#define ADC_ETC_TRIG5_CHAIN_5_4 (IMXRT_ADC_ETC.offset0E8)
#define ADC_ETC_TRIG5_CHAIN_7_6 (IMXRT_ADC_ETC.offset0EC)
#define ADC_ETC_TRIG5_RESULT_1_0 (IMXRT_ADC_ETC.offset0F0)
#define ADC_ETC_TRIG5_RESULT_3_2 (IMXRT_ADC_ETC.offset0F4)
#define ADC_ETC_TRIG5_RESULT_5_4 (IMXRT_ADC_ETC.offset0F8)
#define ADC_ETC_TRIG5_RESULT_7_6 (IMXRT_ADC_ETC.offset0FC)
#define ADC_ETC_TRIG6_CTRL (IMXRT_ADC_ETC.offset100)
#define ADC_ETC_TRIG6_COUNTER (IMXRT_ADC_ETC.offset104)
#define ADC_ETC_TRIG6_CHAIN_1_0 (IMXRT_ADC_ETC.offset108)
#define ADC_ETC_TRIG6_CHAIN_3_2 (IMXRT_ADC_ETC.offset10C)
#define ADC_ETC_TRIG6_CHAIN_5_4 (IMXRT_ADC_ETC.offset110)
#define ADC_ETC_TRIG6_CHAIN_7_6 (IMXRT_ADC_ETC.offset114)
#define ADC_ETC_TRIG6_RESULT_1_0 (IMXRT_ADC_ETC.offset118)
#define ADC_ETC_TRIG6_RESULT_3_2 (IMXRT_ADC_ETC.offset11C)
#define ADC_ETC_TRIG6_RESULT_5_4 (IMXRT_ADC_ETC.offset120)
#define ADC_ETC_TRIG6_RESULT_7_6 (IMXRT_ADC_ETC.offset124)
#define ADC_ETC_TRIG7_CTRL (IMXRT_ADC_ETC.offset128)
#define ADC_ETC_TRIG7_COUNTER (IMXRT_ADC_ETC.offset12C)
#define ADC_ETC_TRIG7_CHAIN_1_0 (IMXRT_ADC_ETC.offset130)
#define ADC_ETC_TRIG7_CHAIN_3_2 (IMXRT_ADC_ETC.offset134)
#define ADC_ETC_TRIG7_CHAIN_5_4 (IMXRT_ADC_ETC.offset138)
#define ADC_ETC_TRIG7_CHAIN_7_6 (IMXRT_ADC_ETC.offset13C)
#define ADC_ETC_TRIG7_RESULT_1_0 (IMXRT_ADC_ETC.offset140)
#define ADC_ETC_TRIG7_RESULT_3_2 (IMXRT_ADC_ETC.offset144)
#define ADC_ETC_TRIG7_RESULT_5_4 (IMXRT_ADC_ETC.offset148)
#define ADC_ETC_TRIG7_RESULT_7_6 (IMXRT_ADC_ETC.offset14C)

// 16.7: page 640
#define IMXRT_AIPSTZ1 (*(IMXRT_REGISTER32_t *)0x4007C000)
#define AIPSTZ1_MPR (IMXRT_AIPSTZ1.offset000)
#define AIPSTZ1_OPACR (IMXRT_AIPSTZ1.offset040)
#define AIPSTZ1_OPACR1 (IMXRT_AIPSTZ1.offset044)
#define AIPSTZ1_OPACR2 (IMXRT_AIPSTZ1.offset048)
#define AIPSTZ1_OPACR3 (IMXRT_AIPSTZ1.offset04C)
#define AIPSTZ1_OPACR4 (IMXRT_AIPSTZ1.offset050)
#define IMXRT_AIPSTZ2 (*(IMXRT_REGISTER32_t *)0x4017C000)
#define AIPSTZ2_MPR (IMXRT_AIPSTZ2.offset000)
#define AIPSTZ2_OPACR (IMXRT_AIPSTZ2.offset040)
#define AIPSTZ2_OPACR1 (IMXRT_AIPSTZ2.offset044)
#define AIPSTZ2_OPACR2 (IMXRT_AIPSTZ2.offset048)
#define AIPSTZ2_OPACR3 (IMXRT_AIPSTZ2.offset04C)
#define AIPSTZ2_OPACR4 (IMXRT_AIPSTZ2.offset050)
#define IMXRT_AIPSTZ3 (*(IMXRT_REGISTER32_t *)0x4027C000)
#define AIPSTZ3_MPR (IMXRT_AIPSTZ3.offset000)
#define AIPSTZ3_OPACR (IMXRT_AIPSTZ3.offset040)
#define AIPSTZ3_OPACR1 (IMXRT_AIPSTZ3.offset044)
#define AIPSTZ3_OPACR2 (IMXRT_AIPSTZ3.offset048)
#define AIPSTZ3_OPACR3 (IMXRT_AIPSTZ3.offset04C)
#define AIPSTZ3_OPACR4 (IMXRT_AIPSTZ3.offset050)
#define IMXRT_AIPSTZ4 (*(IMXRT_REGISTER32_t *)0x4037C000)
#define AIPSTZ4_MPR (IMXRT_AIPSTZ4.offset000)
#define AIPSTZ4_OPACR (IMXRT_AIPSTZ4.offset040)
#define AIPSTZ4_OPACR1 (IMXRT_AIPSTZ4.offset044)
#define AIPSTZ4_OPACR2 (IMXRT_AIPSTZ4.offset048)
#define AIPSTZ4_OPACR3 (IMXRT_AIPSTZ4.offset04C)
#define AIPSTZ4_OPACR4 (IMXRT_AIPSTZ4.offset050)

