gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
// 17.3: page 662
#define IMXRT_AOI1 (*(IMXRT_REGISTER16_t *)0x403B4000)
#define AOI1_BFCRT010 (IMXRT_AOI1.offset000)
#define AOI1_BFCRT230 (IMXRT_AOI1.offset002)
#define AOI1_BFCRT011 (IMXRT_AOI1.offset004)
#define AOI1_BFCRT231 (IMXRT_AOI1.offset006)
#define AOI1_BFCRT012 (IMXRT_AOI1.offset008)
#define AOI1_BFCRT232 (IMXRT_AOI1.offset00A)
#define AOI1_BFCRT013 (IMXRT_AOI1.offset00C)
#define AOI1_BFCRT233 (IMXRT_AOI1.offset00E)
#define IMXRT_AOI2 (*(IMXRT_REGISTER16_t *)0x403B8000)
#define AOI2_BFCRT010 (IMXRT_AOI2.offset000)
#define AOI2_BFCRT230 (IMXRT_AOI2.offset002)
#define AOI2_BFCRT011 (IMXRT_AOI2.offset004)
#define AOI2_BFCRT231 (IMXRT_AOI2.offset006)
#define AOI2_BFCRT012 (IMXRT_AOI2.offset008)
#define AOI2_BFCRT232 (IMXRT_AOI2.offset00A)
#define AOI2_BFCRT013 (IMXRT_AOI2.offset00C)
#define AOI2_BFCRT233 (IMXRT_AOI2.offset00E)

// 18.7: page 703
#define IMXRT_CCM (*(IMXRT_REGISTER32_t *)0x400FC000)
#define CCM_CCR (IMXRT_CCM.offset000)
#define CCM_CSR (IMXRT_CCM.offset008)
#define CCM_CCSR (IMXRT_CCM.offset00C)
#define CCM_CACRR (IMXRT_CCM.offset010)
#define CCM_CBCDR (IMXRT_CCM.offset014)
#define CCM_CBCMR (IMXRT_CCM.offset018)
#define CCM_CSCMR1 (IMXRT_CCM.offset01C)
#define CCM_CSCMR2 (IMXRT_CCM.offset020)
#define CCM_CSCDR1 (IMXRT_CCM.offset024)
#define CCM_CS1CDR (IMXRT_CCM.offset028)
#define CCM_CS2CDR (IMXRT_CCM.offset02C)
#define CCM_CDCDR (IMXRT_CCM.offset030)
#define CCM_CSCDR2 (IMXRT_CCM.offset038)
#define CCM_CSCDR3 (IMXRT_CCM.offset03C)
#define CCM_CDHIPR (IMXRT_CCM.offset048)
#define CCM_CLPCR (IMXRT_CCM.offset054)
#define CCM_CISR (IMXRT_CCM.offset058)
#define CCM_CIMR (IMXRT_CCM.offset05C)
#define CCM_CCOSR (IMXRT_CCM.offset060)
#define CCM_CGPR (IMXRT_CCM.offset064)
#define CCM_CCGR0 (IMXRT_CCM.offset068)
#define CCM_CCGR1 (IMXRT_CCM.offset06C)
#define CCM_CCGR2 (IMXRT_CCM.offset070)
#define CCM_CCGR3 (IMXRT_CCM.offset074)
#define CCM_CCGR4 (IMXRT_CCM.offset078)
#define CCM_CCGR5 (IMXRT_CCM.offset07C)
#define CCM_CCGR6 (IMXRT_CCM.offset080)
#define CCM_CCGR7 (IMXRT_CCM.offset084)
#define CCM_CMEOR (IMXRT_CCM.offset088)
#define CCM_CCR_RBC_EN ((uint32_t)(1 << 27))
#define CCM_CCR_REG_BYPASS_COUNT(n) ((uint32_t)(((n)&0x3F) << 21))
#define CCM_CCR_COSC_EN ((uint32_t)(1 << 12))
#define CCM_CCR_OSCNT(n) ((uint32_t)(((n)&0xFF) << 0))
#define CCM_CSR_COSC_READY ((uint32_t)(1 << 5))
#define CCM_CSR_CAMP2_READY ((uint32_t)(1 << 3))
#define CCM_CSR_REF_EN_B ((uint32_t)(1 << 0))
#define CCM_CCSR_PLL3_SW_CLK_SEL ((uint32_t)(1 << 0))
#define CCM_CACRR_ARM_PODF(n) ((uint32_t)(((n)&0x07) << 0))
#define CCM_CACRR_ARM_PODF_MASK ((uint32_t)(0x07 << 0))
#define CCM_CBCDR_PERIPH_CLK2_PODF(n) ((uint32_t)(((n)&0x07) << 27))
#define CCM_CBCDR_PERIPH_CLK2_PODF_MASK ((uint32_t)(0x07 << 27))
#define CCM_CBCDR_PERIPH_CLK_SEL ((uint32_t)(1 << 25))
#define CCM_CBCDR_SEMC_PODF(n) ((uint32_t)(((n)&0x07) << 16))
#define CCM_CBCDR_AHB_PODF(n) ((uint32_t)(((n)&0x07) << 10))
#define CCM_CBCDR_AHB_PODF_MASK ((uint32_t)(0x07 << 10))
#define CCM_CBCDR_IPG_PODF(n) ((uint32_t)(((n)&0x03) << 8))
#define CCM_CBCDR_IPG_PODF_MASK ((uint32_t)(0x03 << 8))
#define CCM_CBCDR_SEMC_ALT_CLK_SEL ((uint32_t)(1 << 7))
#define CCM_CBCDR_SEMC_CLK_SEL ((uint32_t)(1 << 6))
#define CCM_CBCMR_LPSPI_PODF(n) ((uint32_t)(((n)&0x07) << 26))
#define CCM_CBCMR_LCDIF_PODF(n) ((uint32_t)(((n)&0x07) << 23))
#define CCM_CBCMR_PRE_PERIPH_CLK_SEL(n) ((uint32_t)(((n)&0x03) << 18))
#define CCM_CBCMR_TRACE_CLK_SEL(n) ((uint32_t)(((n)&0x03) << 14))
#define CCM_CBCMR_PERIPH_CLK2_SEL(n) ((uint32_t)(((n)&0x03) << 12))
#define CCM_CBCMR_PERIPH_CLK2_SEL_MASK ((uint32_t)(0x03 << 12))
#define CCM_CBCMR_LPSPI_CLK_SEL(n) ((uint32_t)(((n)&0x03) << 4))
#define CCM_CBCMR_LPSPI_PODF_MASK ((uint32_t)(0x07 << 26))
#define CCM_CBCMR_LCDIF_PODF_MASK ((uint32_t)(0x07 << 23))
#define CCM_CBCMR_PRE_PERIPH_CLK_SEL_MASK ((uint32_t)(0x03 << 18))
#define CCM_CBCMR_TRACE_CLK_SEL_MASK ((uint32_t)(0x03 << 14))
#define CCM_CBCMR_LPSPI_CLK_SEL_MASK ((uint32_t)(0x03 << 4))
#define CCM_CSCMR1_FLEXSPI_CLK_SEL(n) ((uint32_t)(((n)&0x03) << 29))
#define CCM_CSCMR1_FLEXSPI_PODF(n) ((uint32_t)(((n)&0x07) << 23))
#define CCM_CSCMR1_USDHC2_CLK_SEL ((uint32_t)(1 << 17))
#define CCM_CSCMR1_USDHC1_CLK_SEL ((uint32_t)(1 << 16))
#define CCM_CSCMR1_SAI3_CLK_SEL(n) ((uint32_t)(((n)&0x03) << 14))
#define CCM_CSCMR1_SAI2_CLK_SEL(n) ((uint32_t)(((n)&0x03) << 12))
#define CCM_CSCMR1_SAI1_CLK_SEL(n) ((uint32_t)(((n)&0x03) << 10))
#define CCM_CSCMR1_PERCLK_CLK_SEL ((uint32_t)(1 << 6))
#define CCM_CSCMR1_PERCLK_PODF(n) ((uint32_t)(((n)&0x3F) << 0))
#define CCM_CSCMR2_FLEXIO2_CLK_SEL(n) ((uint32_t)(((n)&0x03) << 19))
#define CCM_CSCMR2_CAN_CLK_SEL(n) ((uint32_t)(((n)&0x03) << 8))
#define CCM_CSCMR2_CAN_CLK_PODF(n) ((uint32_t)(((n)&0x3F) << 2))
#define CCM_CSCDR1_TRACE_PODF(n) ((uint32_t)(((n)&0x07) << 25))
#define CCM_CSCDR1_USDHC2_PODF(n) ((uint32_t)(((n)&0x07) << 16))
#define CCM_CSCDR1_USDHC1_PODF(n) ((uint32_t)(((n)&0x07) << 11))
#define CCM_CSCDR1_UART_CLK_SEL ((uint32_t)(1 << 6))
#define CCM_CSCDR1_UART_CLK_PODF(n) ((uint32_t)(((n)&0x3F) << 0))
#define CCM_CS1CDR_FLEXIO2_CLK_PODF(n) ((uint32_t)(((n)&0x07) << 25))
#define CCM_CS1CDR_SAI3_CLK_PRED(n) ((uint32_t)(((n)&0x07) << 22))
#define CCM_CS1CDR_SAI3_CLK_PODF(n) ((uint32_t)(((n)&0x3F) << 16))
#define CCM_CS1CDR_FLEXIO2_CLK_PRED(n) ((uint32_t)(((n)&0x07) << 9))
#define CCM_CS1CDR_SAI1_CLK_PRED(n) ((uint32_t)(((n)&0x07) << 6))
#define CCM_CS1CDR_SAI1_CLK_PODF(n) ((uint32_t)(((n)&0x3F) << 0))
#define CCM_CS2CDR_SAI2_CLK_PRED(n) ((uint32_t)(((n)&0x07) << 6))
#define CCM_CS2CDR_SAI2_CLK_PODF(n) ((uint32_t)(((n)&0x3F) << 0))
#define CCM_CDCDR_SPDIF0_CLK_PRED(n) ((uint32_t)(((n)&0x07) << 25))
#define CCM_CDCDR_SPDIF0_CLK_PODF(n) ((uint32_t)(((n)&0x07) << 22))
#define CCM_CDCDR_SPDIF0_CLK_SEL(n) ((uint32_t)(((n)&0x03) << 20))
#define CCM_CDCDR_FLEXIO1_CLK_PRED(n) ((uint32_t)(((n)&0x07) << 12))
#define CCM_CDCDR_FLEXIO1_CLK_PODF(n) ((uint32_t)(((n)&0x07) << 9))
#define CCM_CDCDR_FLEXIO1_CLK_SEL(n) ((uint32_t)(((n)&0x03) << 7))
#define CCM_CSCDR2_LPI2C_CLK_PODF(n) ((uint32_t)(((n)&0x1F) << 19))
#define CCM_CSCDR2_LPI2C_CLK_SEL ((uint32_t)(1 << 18))
#define CCM_CSCDR2_LCDIF_PRE_CLK_SEL(n) ((uint32_t)(((n)&0x07) << 15))
#define CCM_CSCDR2_LCDIF_PRED(n) ((uint32_t)(((n)&0x07) << 12))
#define CCM_CSCDR2_LCDIF_CLK_SEL(n) ((uint32_t)(((n)&0x07) << 9))
#define CCM_CSCDR3_CSI_PODF(n) ((uint32_t)(((n)&0x07) << 11))
#define CCM_CSCDR3_CSI_CLK_SEL(n) ((uint32_t)(((n)&0x03) << 9))
#define CCM_CDHIPR_ARM_PODF_BUSY ((uint32_t)(1 << 16))
#define CCM_CDHIPR_PERIPH_CLK_SEL_BUSY ((uint32_t)(1 << 5))
#define CCM_CDHIPR_PERIPH2_CLK_SEL_BUSY ((uint32_t)(1 << 3))
#define CCM_CDHIPR_AHB_PODF_BUSY ((uint32_t)(1 << 1))
#define CCM_CDHIPR_SEMC_PODF_BUSY ((uint32_t)(1 << 0))
#define CCM_CLPCR_MASK_L2CC_IDLE ((uint32_t)(1 << 27))
#define CCM_CLPCR_MASK_SCU_IDLE ((uint32_t)(1 << 26))
#define CCM_CLPCR_MASK_CORE0_WFI ((uint32_t)(1 << 22))
#define CCM_CLPCR_BYPASS_LPM_HS0 ((uint32_t)(1 << 21))
#define CCM_CLPCR_BYPASS_LPM_HS1 ((uint32_t)(1 << 19))
#define CCM_CLPCR_COSC_PWRDOWN ((uint32_t)(1 << 11))
#define CCM_CLPCR_STBY_COUNT(n) ((uint32_t)(((n)&0x03) << 9))
#define CCM_CLPCR_VSTBY ((uint32_t)(1 << 8))
#define CCM_CLPCR_DIS_REF_OSC ((uint32_t)(1 << 7))
#define CCM_CLPCR_SBYOS ((uint32_t)(1 << 6))
#define CCM_CLPCR_ARM_CLK_DIS_ON_LPM ((uint32_t)(1 << 5))
#define CCM_CLPCR_LPM(n) ((uint32_t)(((n)&0x03) << 0))
#define CCM_CISR_ARM_PODF_LOADED ((uint32_t)(1 << 26))
#define CCM_CISR_PERIPH_CLK_SEL_LOADED ((uint32_t)(1 << 22))
#define CCM_CISR_AHB_PODF_LOADED ((uint32_t)(1 << 20))
#define CCM_CISR_PERIPH2_CLK_SEL_LOADED ((uint32_t)(1 << 19))
#define CCM_CISR_SEMC_PODF_LOADED ((uint32_t)(1 << 17))
#define CCM_CISR_COSC_READY ((uint32_t)(1 << 6))
#define CCM_CISR_LRF_PLL ((uint32_t)(1 << 0))
#define CCM_CIMR_ARM_PODF_LOADED ((uint32_t)(1 << 26))
#define CCM_CIMR_MASK_PERIPH_CLK_SEL_LOADED ((uint32_t)(1 << 22))
#define CCM_CIMR_MASK_AHB_PODF_LOADED ((uint32_t)(1 << 20))
#define CCM_CIMR_MASK_PERIPH2_CLK_SEL_LOADED ((uint32_t)(1 << 19))
#define CCM_CIMR_MASK_SEMC_PODF_LOADED ((uint32_t)(1 << 17))
#define CCM_CIMR_MASK_COSC_READY ((uint32_t)(1 << 6))
#define CCM_CIMR_MASK_LRF_PLL ((uint32_t)(1 << 0))
#define CCM_CCOSR_CLKO2_EN ((uint32_t)(1 << 24))
#define CCM_CCOSR_CLKO2_DIV(n) ((uint32_t)(((n)&0x07) << 21))
#define CCM_CCOSR_CLKO2_SEL(n) ((uint32_t)(((n)&0x1F) << 16))
#define CCM_CCOSR_CLK_OUT_SEL ((uint32_t)(1 << 8))
#define CCM_CCOSR_CLKO1_EN ((uint32_t)(1 << 7))
#define CCM_CCOSR_CLKO1_DIV(n) ((uint32_t)(((n)&0x07) << 4))
#define CCM_CCOSR_CLKO1_SEL(n) ((uint32_t)(((n)&0x0F) << 0))
#define CCM_CGPR_INT_MEM_CLK_LPM ((uint32_t)(1 << 17))
#define CCM_CGPR_FPL ((uint32_t)(1 << 16))
#define CCM_CGPR_SYS_MEM_DS_CTRL(n) ((uint32_t)(((n)&0x03) << 14))
#define CCM_CGPR_EFUSE_PROG_SUPPLY_GATE ((uint32_t)(1 << 4))
#define CCM_CGPR_PMIC_DELAY_SCALER ((uint32_t)(1 << 0))
#define CCM_CCGR_OFF 0
#define CCM_CCGR_ON_RUNONLY 1
#define CCM_CCGR_ON 3
#define CCM_CCGR0_GPIO2(n) ((uint32_t)(((n)&0x03) << 30))
#define CCM_CCGR0_LPUART2(n) ((uint32_t)(((n)&0x03) << 28))
#define CCM_CCGR0_GPT2_SERIAL(n) ((uint32_t)(((n)&0x03) << 26))
#define CCM_CCGR0_GPT2_BUS(n) ((uint32_t)(((n)&0x03) << 24))
#define CCM_CCGR0_TRACE(n) ((uint32_t)(((n)&0x03) << 22))
#define CCM_CCGR0_CAN2_SERIAL(n) ((uint32_t)(((n)&0x03) << 20))
#define CCM_CCGR0_CAN2(n) ((uint32_t)(((n)&0x03) << 18))
#define CCM_CCGR0_CAN1_SERIAL(n) ((uint32_t)(((n)&0x03) << 16))
#define CCM_CCGR0_CAN1(n) ((uint32_t)(((n)&0x03) << 14))
#define CCM_CCGR0_LPUART3(n) ((uint32_t)(((n)&0x03) << 12))
#define CCM_CCGR0_DCP(n) ((uint32_t)(((n)&0x03) << 10))
#define CCM_CCGR0_MQS_HMCLK(n) ((uint32_t)(((n)&0x03) << 4))
#define CCM_CCGR0_AIPS_TZ2(n) ((uint32_t)(((n)&0x03) << 2))
#define CCM_CCGR0_AIPS_TZ1(n) ((uint32_t)(((n)&0x03) << 0))
#define CCM_CCGR1_CSU(n) ((uint32_t)(((n)&0x03) << 28))
#define CCM_CCGR1_GPIO1(n) ((uint32_t)(((n)&0x03) << 26))
#define CCM_CCGR1_LPUART4(n) ((uint32_t)(((n)&0x03) << 24))
#define CCM_CCGR1_GPT_SERIAL(n) ((uint32_t)(((n)&0x03) << 22))
#define CCM_CCGR1_GPT(n) ((uint32_t)(((n)&0x03) << 20))
#define CCM_CCGR1_ADC1(n) ((uint32_t)(((n)&0x03) << 16))
#define CCM_CCGR1_AOI2(n) ((uint32_t)(((n)&0x03) << 14))
#define CCM_CCGR1_PIT(n) ((uint32_t)(((n)&0x03) << 12))
#define CCM_CCGR1_ENET(n) ((uint32_t)(((n)&0x03) << 10))
#define CCM_CCGR1_ADC2(n) ((uint32_t)(((n)&0x03) << 8))
#define CCM_CCGR1_LPSPI4(n) ((uint32_t)(((n)&0x03) << 6))
#define CCM_CCGR1_LPSPI3(n) ((uint32_t)(((n)&0x03) << 4))
#define CCM_CCGR1_LPSPI2(n) ((uint32_t)(((n)&0x03) << 2))
#define CCM_CCGR1_LPSPI1(n) ((uint32_t)(((n)&0x03) << 0))
#define CCM_CCGR2_PXP(n) ((uint32_t)(((n)&0x03) << 30))
#define CCM_CCGR2_LCD(n) ((uint32_t)(((n)&0x03) << 28))
#define CCM_CCGR2_GPIO3(n) ((uint32_t)(((n)&0x03) << 26))
#define CCM_CCGR2_XBAR2(n) ((uint32_t)(((n)&0x03) << 24))
#define CCM_CCGR2_XBAR1(n) ((uint32_t)(((n)&0x03) << 22))
#define CCM_CCGR2_IPMUX3(n) ((uint32_t)(((n)&0x03) << 20))
#define CCM_CCGR2_IPMUX2(n) ((uint32_t)(((n)&0x03) << 18))
#define CCM_CCGR2_IPMUX1(n) ((uint32_t)(((n)&0x03) << 16))
#define CCM_CCGR2_XBAR3(n) ((uint32_t)(((n)&0x03) << 14))
#define CCM_CCGR2_IIM(n) ((uint32_t)(((n)&0x03) << 12))
#define CCM_CCGR2_LPI2C3(n) ((uint32_t)(((n)&0x03) << 10))
#define CCM_CCGR2_LPI2C2(n) ((uint32_t)(((n)&0x03) << 8))
#define CCM_CCGR2_LPI2C1(n) ((uint32_t)(((n)&0x03) << 6))
#define CCM_CCGR2_IOMUXC_SNVS(n) ((uint32_t)(((n)&0x03) << 4))
#define CCM_CCGR2_CSI(n) ((uint32_t)(((n)&0x03) << 2))
#define CCM_CCGR3_IOMUXC_SNVS_GPR(n) ((uint32_t)(((n)&0x03) << 30))
#define CCM_CCGR3_OCRAM(n) ((uint32_t)(((n)&0x03) << 28))
#define CCM_CCGR3_ACMP4(n) ((uint32_t)(((n)&0x03) << 26))
#define CCM_CCGR3_ACMP3(n) ((uint32_t)(((n)&0x03) << 24))
#define CCM_CCGR3_ACMP2(n) ((uint32_t)(((n)&0x03) << 22))
#define CCM_CCGR3_ACMP1(n) ((uint32_t)(((n)&0x03) << 20))
#define CCM_CCGR3_FLEXRAM(n) ((uint32_t)(((n)&0x03) << 18))
#define CCM_CCGR3_WDOG1(n) ((uint32_t)(((n)&0x03) << 16))
#define CCM_CCGR3_EWM(n) ((uint32_t)(((n)&0x03) << 14))
#define CCM_CCGR3_GPIO4(n) ((uint32_t)(((n)&0x03) << 12))
#define CCM_CCGR3_LCDIF_PIX(n) ((uint32_t)(((n)&0x03) << 10))
#define CCM_CCGR3_AOI1(n) ((uint32_t)(((n)&0x03) << 8))
#define CCM_CCGR3_LPUART6(n) ((uint32_t)(((n)&0x03) << 6))
#define CCM_CCGR3_SEMC(n) ((uint32_t)(((n)&0x03) << 4))
#define CCM_CCGR3_LPUART5(n) ((uint32_t)(((n)&0x03) << 2))
#define CCM_CCGR3_FLEXIO2(n) ((uint32_t)(((n)&0x03) << 0))
#define CCM_CCGR4_ENC4(n) ((uint32_t)(((n)&0x03) << 30))
#define CCM_CCGR4_ENC3(n) ((uint32_t)(((n)&0x03) << 28))
#define CCM_CCGR4_ENC2(n) ((uint32_t)(((n)&0x03) << 26))
#define CCM_CCGR4_ENC1(n) ((uint32_t)(((n)&0x03) << 24))
#define CCM_CCGR4_PWM4(n) ((uint32_t)(((n)&0x03) << 22))
#define CCM_CCGR4_PWM3(n) ((uint32_t)(((n)&0x03) << 20))
#define CCM_CCGR4_PWM2(n) ((uint32_t)(((n)&0x03) << 18))
#define CCM_CCGR4_PWM1(n) ((uint32_t)(((n)&0x03) << 16))
#define CCM_CCGR4_SIM_EMS(n) ((uint32_t)(((n)&0x03) << 14))
#define CCM_CCGR4_SIM_M(n) ((uint32_t)(((n)&0x03) << 12))
#define CCM_CCGR4_TSC(n) ((uint32_t)(((n)&0x03) << 10))
#define CCM_CCGR4_SIM_M7(n) ((uint32_t)(((n)&0x03) << 8))
#define CCM_CCGR4_BEE(n) ((uint32_t)(((n)&0x03) << 6))
#define CCM_CCGR4_IOMUXC_GPR(n) ((uint32_t)(((n)&0x03) << 4))
#define CCM_CCGR4_IOMUXC(n) ((uint32_t)(((n)&0x03) << 2))
#define CCM_CCGR5_SNVS_LP(n) ((uint32_t)(((n)&0x03) << 30))
#define CCM_CCGR5_SNVS_HP(n) ((uint32_t)(((n)&0x03) << 28))
#define CCM_CCGR5_LPUART7(n) ((uint32_t)(((n)&0x03) << 26))
#define CCM_CCGR5_LPUART1(n) ((uint32_t)(((n)&0x03) << 24))
#define CCM_CCGR5_SAI3(n) ((uint32_t)(((n)&0x03) << 22))
#define CCM_CCGR5_SAI2(n) ((uint32_t)(((n)&0x03) << 20))
#define CCM_CCGR5_SAI1(n) ((uint32_t)(((n)&0x03) << 18))
#define CCM_CCGR5_SIM_MAIN(n) ((uint32_t)(((n)&0x03) << 16))
#define CCM_CCGR5_SPDIF(n) ((uint32_t)(((n)&0x03) << 14))
#define CCM_CCGR5_AIPS_TZ4(n) ((uint32_t)(((n)&0x03) << 12))
#define CCM_CCGR5_WDOG2(n) ((uint32_t)(((n)&0x03) << 10))
#define CCM_CCGR5_KPP(n) ((uint32_t)(((n)&0x03) << 8))
#define CCM_CCGR5_DMA(n) ((uint32_t)(((n)&0x03) << 6))
#define CCM_CCGR5_WDOG3(n) ((uint32_t)(((n)&0x03) << 4))
#define CCM_CCGR5_FLEXIO1(n) ((uint32_t)(((n)&0x03) << 2))
#define CCM_CCGR5_ROM(n) ((uint32_t)(((n)&0x03) << 0))
#define CCM_CCGR6_QTIMER3(n) ((uint32_t)(((n)&0x03) << 30))
#define CCM_CCGR6_QTIMER2(n) ((uint32_t)(((n)&0x03) << 28))
#define CCM_CCGR6_QTIMER1(n) ((uint32_t)(((n)&0x03) << 26))
#define CCM_CCGR6_LPI2C4_SERIAL(n) ((uint32_t)(((n)&0x03) << 24))
#define CCM_CCGR6_ANADIG(n) ((uint32_t)(((n)&0x03) << 22))
#define CCM_CCGR6_SIM_PER(n) ((uint32_t)(((n)&0x03) << 20)) /* IMXRT1052 */
#define CCM_CCGR6_AXBS_P(n) ((uint32_t)(((n)&0x03) << 20))  /* IMXRT1062 */
#define CCM_CCGR6_AIPS_TZ3(n) ((uint32_t)(((n)&0x03) << 18))
#define CCM_CCGR6_QTIMER4(n) ((uint32_t)(((n)&0x03) << 16))
#define CCM_CCGR6_LPUART8(n) ((uint32_t)(((n)&0x03) << 14))
#define CCM_CCGR6_TRNG(n) ((uint32_t)(((n)&0x03) << 12))
#define CCM_CCGR6_FLEXSPI(n) ((uint32_t)(((n)&0x03) << 10))
#define CCM_CCGR6_IPMUX4(n) ((uint32_t)(((n)&0x03) << 8))
#define CCM_CCGR6_DCDC(n) ((uint32_t)(((n)&0x03) << 6))
#define CCM_CCGR6_USDHC2(n) ((uint32_t)(((n)&0x03) << 4))
#define CCM_CCGR6_USDHC1(n) ((uint32_t)(((n)&0x03) << 2))
#define CCM_CCGR6_USBOH3(n) ((uint32_t)(((n)&0x03) << 0))
#define CCM_CCGR7_FLEXIO3(n) ((uint32_t)(((n)&0x03) << 12))
#define CCM_CCGR7_APIS_LITE(n) ((uint32_t)(((n)&0x03) << 10))
#define CCM_CCGR7_CAN3_SERIAL(n) ((uint32_t)(((n)&0x03) << 8))
#define CCM_CCGR7_CAN3(n) ((uint32_t)(((n)&0x03) << 6))
#define CCM_CCGR7_AXBS_L(n) ((uint32_t)(((n)&0x03) << 4))
#define CCM_CCGR7_FLEXSPI2(n) ((uint32_t)(((n)&0x03) << 2))
#define CCM_CCGR7_ENET2(n) ((uint32_t)(((n)&0x03) << 0))
#define CCM_CMEOR_MOD_EN_OV_CAN1_CPI ((uint32_t)(1 << 30))
#define CCM_CMEOR_MOD_EN_OV_CAN2_CPI ((uint32_t)(1 << 28))
#define CCM_CMEOR_MOD_EN_OV_TRNG ((uint32_t)(1 << 9))
#define CCM_CMEOR_MOD_EN_USDHC ((uint32_t)(1 << 7))
#define CCM_CMEOR_MOD_EN_OV_PIT ((uint32_t)(1 << 6))
#define CCM_CMEOR_MOD_EN_OV_GPT ((uint32_t)(1 << 5))

#define CCM_CSCMR1_SAI1_CLK_SEL_MASK (CCM_CSCMR1_SAI1_CLK_SEL(0x03))
#define CCM_CS1CDR_SAI1_CLK_PRED_MASK (CCM_CS1CDR_SAI1_CLK_PRED(0x07))
#define CCM_CS1CDR_SAI1_CLK_PODF_MASK (CCM_CS1CDR_SAI1_CLK_PODF(0x3f))
#define CCM_CSCMR1_SAI2_CLK_SEL_MASK (CCM_CSCMR1_SAI2_CLK_SEL(0x03))
#define CCM_CS2CDR_SAI2_CLK_PRED_MASK (CCM_CS2CDR_SAI2_CLK_PRED(0x07))
#define CCM_CS2CDR_SAI2_CLK_PODF_MASK (CCM_CS2CDR_SAI2_CLK_PODF(0x3f))
#define CCM_CSCMR1_SAI3_CLK_SEL_MASK (CCM_CSCMR1_SAI3_CLK_SEL(0x03))
#define CCM_CS1CDR_SAI3_CLK_PRED_MASK (CCM_CS1CDR_SAI3_CLK_PRED(0x07))
#define CCM_CS1CDR_SAI3_CLK_PODF_MASK (CCM_CS1CDR_SAI3_CLK_PODF(0x3f))
#define CCM_CDCDR_SPDIF0_CLK_SEL_MASK (CCM_CDCDR_SPDIF0_CLK_SEL(0x03))
#define CCM_CDCDR_SPDIF0_CLK_PRED_MASK (CCM_CDCDR_SPDIF0_CLK_PRED(0x07))
#define CCM_CDCDR_SPDIF0_CLK_PODF_MASK (CCM_CDCDR_SPDIF0_CLK_PODF(0x07))

// 18.8: page 752
#define IMXRT_CCM_ANALOG (*(IMXRT_REGISTER32_t *)0x400D8000)
#define CCM_ANALOG_PLL_ARM (IMXRT_CCM_ANALOG.offset000)
#define CCM_ANALOG_PLL_ARM_SET (IMXRT_CCM_ANALOG.offset004)
#define CCM_ANALOG_PLL_ARM_CLR (IMXRT_CCM_ANALOG.offset008)
#define CCM_ANALOG_PLL_ARM_TOG (IMXRT_CCM_ANALOG.offset00C)
#define CCM_ANALOG_PLL_USB1 (IMXRT_CCM_ANALOG.offset010)
#define CCM_ANALOG_PLL_USB1_SET (IMXRT_CCM_ANALOG.offset014)
#define CCM_ANALOG_PLL_USB1_CLR (IMXRT_CCM_ANALOG.offset018)
#define CCM_ANALOG_PLL_USB1_TOG (IMXRT_CCM_ANALOG.offset01C)
#define CCM_ANALOG_PLL_USB2 (IMXRT_CCM_ANALOG.offset020)
#define CCM_ANALOG_PLL_USB2_SET (IMXRT_CCM_ANALOG.offset024)
#define CCM_ANALOG_PLL_USB2_CLR (IMXRT_CCM_ANALOG.offset028)
#define CCM_ANALOG_PLL_USB2_TOG (IMXRT_CCM_ANALOG.offset02C)
#define CCM_ANALOG_PLL_SYS (IMXRT_CCM_ANALOG.offset030)
#define CCM_ANALOG_PLL_SYS_SET (IMXRT_CCM_ANALOG.offset034)
#define CCM_ANALOG_PLL_SYS_CLR (IMXRT_CCM_ANALOG.offset038)
#define CCM_ANALOG_PLL_SYS_TOG (IMXRT_CCM_ANALOG.offset03C)
#define CCM_ANALOG_PLL_SYS_SS (IMXRT_CCM_ANALOG.offset040)
#define CCM_ANALOG_PLL_SYS_NUM (IMXRT_CCM_ANALOG.offset050)
#define CCM_ANALOG_PLL_SYS_DENOM (IMXRT_CCM_ANALOG.offset060)
#define CCM_ANALOG_PLL_AUDIO (IMXRT_CCM_ANALOG.offset070)
#define CCM_ANALOG_PLL_AUDIO_SET (IMXRT_CCM_ANALOG.offset074)
#define CCM_ANALOG_PLL_AUDIO_CLR (IMXRT_CCM_ANALOG.offset078)
#define CCM_ANALOG_PLL_AUDIO_TOG (IMXRT_CCM_ANALOG.offset07C)
#define CCM_ANALOG_PLL_AUDIO_NUM (IMXRT_CCM_ANALOG.offset080)
#define CCM_ANALOG_PLL_AUDIO_DENOM (IMXRT_CCM_ANALOG.offset090)
#define CCM_ANALOG_PLL_VIDEO (IMXRT_CCM_ANALOG.offset0A0)
#define CCM_ANALOG_PLL_VIDEO_SET (IMXRT_CCM_ANALOG.offset0A4)
#define CCM_ANALOG_PLL_VIDEO_CLR (IMXRT_CCM_ANALOG.offset0A8)
#define CCM_ANALOG_PLL_VIDEO_TOG (IMXRT_CCM_ANALOG.offset0AC)
#define CCM_ANALOG_PLL_VIDEO_NUM (IMXRT_CCM_ANALOG.offset0B0)
#define CCM_ANALOG_PLL_VIDEO_DENOM (IMXRT_CCM_ANALOG.offset0C0)
#define CCM_ANALOG_PLL_ENET (IMXRT_CCM_ANALOG.offset0EC)
#define CCM_ANALOG_PLL_ENET_SET (IMXRT_CCM_ANALOG.offset0E4)
#define CCM_ANALOG_PLL_ENET_CLR (IMXRT_CCM_ANALOG.offset0E8)
#define CCM_ANALOG_PLL_ENET_TOG (IMXRT_CCM_ANALOG.offset0EC)
#define CCM_ANALOG_PFD_480 (IMXRT_CCM_ANALOG.offset0F0)
#define CCM_ANALOG_PFD_480_SET (IMXRT_CCM_ANALOG.offset0F4)
#define CCM_ANALOG_PFD_480_CLR (IMXRT_CCM_ANALOG.offset0F8)
#define CCM_ANALOG_PFD_480_TOG (IMXRT_CCM_ANALOG.offset0FC)
#define CCM_ANALOG_PFD_528 (IMXRT_CCM_ANALOG.offset100)
#define CCM_ANALOG_PFD_528_SET (IMXRT_CCM_ANALOG.offset104)
#define CCM_ANALOG_PFD_528_CLR (IMXRT_CCM_ANALOG.offset108)
#define CCM_ANALOG_PFD_528_TOG (IMXRT_CCM_ANALOG.offset10C)
#define CCM_ANALOG_MISC0 (IMXRT_CCM_ANALOG.offset150)
#define CCM_ANALOG_MISC0_SET (IMXRT_CCM_ANALOG.offset154)
#define CCM_ANALOG_MISC0_CLR (IMXRT_CCM_ANALOG.offset158)
#define CCM_ANALOG_MISC0_TOG (IMXRT_CCM_ANALOG.offset15C)
#define CCM_ANALOG_MISC1 (IMXRT_CCM_ANALOG.offset160)
#define CCM_ANALOG_MISC1_SET (IMXRT_CCM_ANALOG.offset164)
#define CCM_ANALOG_MISC1_CLR (IMXRT_CCM_ANALOG.offset168)
#define CCM_ANALOG_MISC1_TOG (IMXRT_CCM_ANALOG.offset16C)
#define CCM_ANALOG_MISC2 (IMXRT_CCM_ANALOG.offset170)
#define CCM_ANALOG_MISC2_SET (IMXRT_CCM_ANALOG.offset174)
#define CCM_ANALOG_MISC2_CLR (IMXRT_CCM_ANALOG.offset178)
#define CCM_ANALOG_MISC2_TOG (IMXRT_CCM_ANALOG.offset17C)
#define CCM_ANALOG_PLL_ARM_LOCK ((uint32_t)(1 << 31))
#define CCM_ANALOG_PLL_ARM_BYPASS ((uint32_t)(1 << 16))
#define CCM_ANALOG_PLL_ARM_ENABLE ((uint32_t)(1 << 13))
#define CCM_ANALOG_PLL_ARM_POWERDOWN ((uint32_t)(1 << 12))
#define CCM_ANALOG_PLL_ARM_DIV_SELECT(n) ((uint32_t)(((n)&0x7F) << 0))
#define CCM_ANALOG_PLL_ARM_DIV_SELECT_MASK ((uint32_t)(0x7F << 0))
#define CCM_ANALOG_PLL_USB1_LOCK ((uint32_t)(1 << 31))
#define CCM_ANALOG_PLL_USB1_BYPASS ((uint32_t)(1 << 16))
#define CCM_ANALOG_PLL_USB1_ENABLE ((uint32_t)(1 << 13))
#define CCM_ANALOG_PLL_USB1_POWER ((uint32_t)(1 << 12))
#define CCM_ANALOG_PLL_USB1_EN_USB_CLKS ((uint32_t)(1 << 6))
#define CCM_ANALOG_PLL_USB1_DIV_SELECT ((uint32_t)(1 << 1))
#define CCM_ANALOG_PLL_USB2_LOCK ((uint32_t)(1 << 31))
#define CCM_ANALOG_PLL_USB2_BYPASS ((uint32_t)(1 << 16))
#define CCM_ANALOG_PLL_USB2_ENABLE ((uint32_t)(1 << 13))
#define CCM_ANALOG_PLL_USB2_POWER ((uint32_t)(1 << 12))
#define CCM_ANALOG_PLL_USB2_EN_USB_CLKS ((uint32_t)(1 << 6))
#define CCM_ANALOG_PLL_USB2_DIV_SELECT ((uint32_t)(1 << 1))
#define CCM_ANALOG_PLL_SYS_LOCK ((uint32_t)(1 << 31))
#define CCM_ANALOG_PLL_SYS_BYPASS ((uint32_t)(1 << 16))
#define CCM_ANALOG_PLL_SYS_ENABLE ((uint32_t)(1 << 13))
#define CCM_ANALOG_PLL_SYS_POWERDOWN ((uint32_t)(1 << 12))
#define CCM_ANALOG_PLL_SYS_DIV_SELECT ((uint32_t)(1 << 1))
#define CCM_ANALOG_PLL_AUDIO_POST_DIV_SELECT(n) ((uint32_t)(((n)&0x03) << 19))
#define CCM_ANALOG_PLL_AUDIO_BYPASS ((uint32_t)(1 << 16))
#define CCM_ANALOG_PLL_AUDIO_BYPASS_CLK_SRC(n) ((uint32_t)(((n)&0x03) << 14))
#define CCM_ANALOG_PLL_AUDIO_ENABLE ((uint32_t)(1 << 13))
#define CCM_ANALOG_PLL_AUDIO_POWERDOWN ((uint32_t)(1 << 12))
#define CCM_ANALOG_PLL_AUDIO_DIV_SELECT(n) ((uint32_t)((n) & ((1 << 6) - 1)))

#define CCM_ANALOG_MISC2_DIV_MSB ((uint32_t)(1 << 23))
#define CCM_ANALOG_MISC2_DIV_LSB ((uint32_t)(1 << 15))

