gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
#define CCM_ANALOG_PLL_AUDIO_NUM_MASK (((1 << 29) - 1))
#define CCM_ANALOG_PLL_AUDIO_DENOM_MASK (((1 << 29) - 1))
#define CCM_ANALOG_PLL_AUDIO_LOCK ((uint32_t)(1 << 31))

// 19.7: page 810
#define IMXRT_CSI (*(IMXRT_REGISTER32_t *)0x402BC000)
#define CSI_CSICR1 (IMXRT_CSI.offset000)
#define CSI_CSICR2 (IMXRT_CSI.offset004)
#define CSI_CSICR3 (IMXRT_CSI.offset008)
#define CSI_CSISTATFIFO (IMXRT_CSI.offset00C)
#define CSI_CSIRFIFO (IMXRT_CSI.offset010)
#define CSI_CSIRXCNT (IMXRT_CSI.offset014)
#define CSI_CSISR (IMXRT_CSI.offset018)
#define CSI_CSIDMASA_STATFIFO (IMXRT_CSI.offset020)
#define CSI_CSIDMATS_STATFIFO (IMXRT_CSI.offset024)
#define CSI_CSIDMASA_FB1 (IMXRT_CSI.offset028)
#define CSI_CSIDMASA_FB2 (IMXRT_CSI.offset02C)
#define CSI_CSIFBUF_PARA (IMXRT_CSI.offset030)
#define CSI_CSIIMAG_PARA (IMXRT_CSI.offset034)
#define CSI_CSICR18 (IMXRT_CSI.offset048)
#define CSI_CSICR19 (IMXRT_CSI.offset04C)

// 20.6.1.1: page 837
#define IMXRT_DCDC (*(IMXRT_REGISTER32_t *)0x40080000)
#define DCDC_REG0 (IMXRT_DCDC.offset000)
#define DCDC_REG1 (IMXRT_DCDC.offset004)
#define DCDC_REG2 (IMXRT_DCDC.offset008)
#define DCDC_REG3 (IMXRT_DCDC.offset00C)
#define DCDC_REG0_STS_DC_OK ((uint32_t)(1 << 31))
#define DCDC_REG0_XTAL_24M_OK ((uint32_t)(1 << 29))
#define DCDC_REG0_CURRENT_ALERT_RESET ((uint32_t)(1 << 28))
#define DCDC_REG0_XTALOK_DISABLE ((uint32_t)(1 << 27))
#define DCDC_REG0_PWD_CMP_OFFSET ((uint32_t)(1 << 26))
#define DCDC_REG0_LP_HIGH_HYS ((uint32_t)(1 << 21))
#define DCDC_REG0_LP_OVERLOAD_FREQ_SEL ((uint32_t)(1 << 20))
#define DCDC_REG0_LP_OVERLOAD_THRSH(n) ((uint32_t)(((n)&0x03) << 18))
#define DCDC_REG0_PWD_HIGH_VOLT_DET ((uint32_t)(1 << 17))
#define DCDC_REG0_EN_LP_OVERLOAD_SNS ((uint32_t)(1 << 16))
#define DCDC_REG0_ADJ_POSLIMIT_BUCK(n) ((uint32_t)(((n)&0x0F) << 12))
#define DCDC_REG0_PWD_CMP_BATT_DET ((uint32_t)(1 << 11))
#define DCDC_REG0_OVERCUR_TRIG_ADJ(n) ((uint32_t)(((n)&0x03) << 9))
#define DCDC_REG0_PWD_OVERCUR_DET ((uint32_t)(1 << 8))
#define DCDC_REG0_CUR_SNS_THRSH(n) ((uint32_t)(((n)&0x07) << 5))
#define DCDC_REG0_PWD_CUR_SNS_CMP ((uint32_t)(1 << 4))
#define DCDC_REG0_PWD_OSC_INT ((uint32_t)(1 << 3))
#define DCDC_REG0_SEL_CLK ((uint32_t)(1 << 2))
#define DCDC_REG0_DISABLE_AUTO_CLK_SWITCH ((uint32_t)(1 << 1))
#define DCDC_REG0_PWD_ZCD ((uint32_t)(1 << 0))
#define DCDC_REG1_VBG_TRIM(n) ((uint32_t)(((n)&0x1F) << 24))
#define DCDC_REG1_LOOPCTRL_EN_HYST ((uint32_t)(1 << 23))
#define DCDC_REG1_LOOPCTRL_HST_THRESH ((uint32_t)(1 << 21))
#define DCDC_REG1_LP_CMP_ISRC_SEL(n) ((uint32_t)(((n)&0x03) << 12))
#define DCDC_REG1_REG_RLOAD_SW ((uint32_t)(1 << 9))
#define DCDC_REG1_REG_FBK_SEL(n) ((uint32_t)(((n)&0x03) << 7))
#define DCDC_REG2_DCM_SET_CTRL ((uint32_t)(1 << 28))
#define DCDC_REG2_DISABLE_PULSE_SKIP ((uint32_t)(1 << 27))
#define DCDC_REG2_LOOPCTRL_HYST_SIGN ((uint32_t)(1 << 13))
#define DCDC_REG2_LOOPCTRL_RCSCALE_THRSH ((uint32_t)(1 << 12))
#define DCDC_REG2_LOOPCTRL_EN_RCSCALE ((uint32_t)(((n)&0x07) << 9))
#define DCDC_REG2_LOOPCTRL_DC_FF ((uint32_t)(((n)&0x07) << 6))
#define DCDC_REG2_LOOPCTRL_DC_R ((uint32_t)(((n)&0x0F) << 2))
#define DCDC_REG2_LOOPCTRL_DC_C ((uint32_t)(((n)&0x03) << 0))
#define DCDC_REG3_DISABLE_STEP ((uint32_t)(1 << 30))
#define DCDC_REG3_MISC_DISABLEFET_LOGIC ((uint32_t)(1 << 28))
#define DCDC_REG3_MISC_DELAY_TIMING ((uint32_t)(1 << 27))
#define DCDC_REG3_MINPWR_DC_HALFCLK ((uint32_t)(1 << 24))
#define DCDC_REG3_TARGET_LP(n) ((uint32_t)(((n)&0x07) << 8))
#define DCDC_REG3_TRG(n) ((uint32_t)(((n)&0x1F) << 0))
#define DCDC_REG3_TRG_MASK ((uint32_t)(0x1F << 0))

// 21.4.1.1: page 849
#define IMXRT_DMAMUX (*(IMXRT_REGISTER32_t *)0x400EC000)
#define DMAMUX_CHCFG0 (IMXRT_DMAMUX.offset000)
#define DMAMUX_CHCFG1 (IMXRT_DMAMUX.offset004)
#define DMAMUX_CHCFG2 (IMXRT_DMAMUX.offset008)
#define DMAMUX_CHCFG3 (IMXRT_DMAMUX.offset00C)
#define DMAMUX_CHCFG4 (IMXRT_DMAMUX.offset010)
#define DMAMUX_CHCFG5 (IMXRT_DMAMUX.offset014)
#define DMAMUX_CHCFG6 (IMXRT_DMAMUX.offset018)
#define DMAMUX_CHCFG7 (IMXRT_DMAMUX.offset01C)
#define DMAMUX_CHCFG8 (IMXRT_DMAMUX.offset020)
#define DMAMUX_CHCFG9 (IMXRT_DMAMUX.offset024)
#define DMAMUX_CHCFG10 (IMXRT_DMAMUX.offset028)
#define DMAMUX_CHCFG11 (IMXRT_DMAMUX.offset02C)
#define DMAMUX_CHCFG12 (IMXRT_DMAMUX.offset030)
#define DMAMUX_CHCFG13 (IMXRT_DMAMUX.offset034)
#define DMAMUX_CHCFG14 (IMXRT_DMAMUX.offset038)
#define DMAMUX_CHCFG15 (IMXRT_DMAMUX.offset03C)
#define DMAMUX_CHCFG16 (IMXRT_DMAMUX.offset040)
#define DMAMUX_CHCFG17 (IMXRT_DMAMUX.offset044)
#define DMAMUX_CHCFG18 (IMXRT_DMAMUX.offset048)
#define DMAMUX_CHCFG19 (IMXRT_DMAMUX.offset04C)
#define DMAMUX_CHCFG20 (IMXRT_DMAMUX.offset050)
#define DMAMUX_CHCFG21 (IMXRT_DMAMUX.offset054)
#define DMAMUX_CHCFG22 (IMXRT_DMAMUX.offset058)
#define DMAMUX_CHCFG23 (IMXRT_DMAMUX.offset05C)
#define DMAMUX_CHCFG24 (IMXRT_DMAMUX.offset060)
#define DMAMUX_CHCFG25 (IMXRT_DMAMUX.offset064)
#define DMAMUX_CHCFG26 (IMXRT_DMAMUX.offset068)
#define DMAMUX_CHCFG27 (IMXRT_DMAMUX.offset06C)
#define DMAMUX_CHCFG28 (IMXRT_DMAMUX.offset070)
#define DMAMUX_CHCFG29 (IMXRT_DMAMUX.offset074)
#define DMAMUX_CHCFG30 (IMXRT_DMAMUX.offset078)
#define DMAMUX_CHCFG31 (IMXRT_DMAMUX.offset07C)
#define DMAMUX_CHCFG_ENBL ((uint32_t)(1 << 31))
#define DMAMUX_CHCFG_TRIG ((uint32_t)(1 << 30))
#define DMAMUX_CHCFG_A_ON ((uint32_t)(1 << 29))

// 22.3.5.1: page 864
typedef struct
{
    volatile uint32_t CR;   // 0
    volatile uint32_t ES;   // 4
    uint32_t unused1;       // 8
    volatile uint32_t ERQ;  // C
    uint32_t unused2;       // 10
    volatile uint32_t EEI;  // 14
    volatile uint8_t CEEI;  // 18
    volatile uint8_t SEEI;  // 19
    volatile uint8_t CERQ;  // 1A
    volatile uint8_t SERQ;  // 1B
    volatile uint8_t CDNE;  // 1C
    volatile uint8_t SSRT;  // 1D
    volatile uint8_t CERR;  // 1E
    volatile uint8_t CINT;  // 1F
    uint32_t unused3;       // 20
    volatile uint32_t INT;  // 24
    uint32_t unused4;       // 28
    volatile uint32_t ERR;  // 2C
    uint32_t unused5;       // 30
    volatile uint32_t HRS;  // 34
    uint32_t unused6;       // 38
    uint32_t unused7;       // 3C
    uint32_t unused8;       // 40
    volatile uint32_t EARS; // 44
    uint32_t unused[46];
    volatile uint8_t DCHPRI3;
    volatile uint8_t DCHPRI2;
    volatile uint8_t DCHPRI1;
    volatile uint8_t DCHPRI0;
    volatile uint8_t DCHPRI7;
    volatile uint8_t DCHPRI6;
    volatile uint8_t DCHPRI5;
    volatile uint8_t DCHPRI4;
    volatile uint8_t DCHPRI11;
    volatile uint8_t DCHPRI10;
    volatile uint8_t DCHPRI9;
    volatile uint8_t DCHPRI8;
    volatile uint8_t DCHPRI15;
    volatile uint8_t DCHPRI14;
    volatile uint8_t DCHPRI13;
    volatile uint8_t DCHPRI12;
    volatile uint8_t DCHPRI19;
    volatile uint8_t DCHPRI18;
    volatile uint8_t DCHPRI17;
    volatile uint8_t DCHPRI16;
    volatile uint8_t DCHPRI23;
    volatile uint8_t DCHPRI22;
    volatile uint8_t DCHPRI21;
    volatile uint8_t DCHPRI20;
    volatile uint8_t DCHPRI27;
    volatile uint8_t DCHPRI26;
    volatile uint8_t DCHPRI25;
    volatile uint8_t DCHPRI24;
    volatile uint8_t DCHPRI31;
    volatile uint8_t DCHPRI30;
    volatile uint8_t DCHPRI29;
    volatile uint8_t DCHPRI28;
} IMXRT_DMA_t;

typedef struct
{
    volatile const void *volatile SADDR;
    int16_t SOFF;
    union {
        uint16_t ATTR;
        struct
        {
            uint8_t ATTR_DST;
            uint8_t ATTR_SRC;
        };
    };
    union {
        uint32_t NBYTES;
        uint32_t NBYTES_MLNO;
        uint32_t NBYTES_MLOFFNO;
        uint32_t NBYTES_MLOFFYES;
    };
    int32_t SLAST;
    volatile void *volatile DADDR;
    int16_t DOFF;
    union {
        volatile uint16_t CITER;
        volatile uint16_t CITER_ELINKYES;
        volatile uint16_t CITER_ELINKNO;
    };
    int32_t DLASTSGA;
    volatile uint16_t CSR;
    union {
        volatile uint16_t BITER;
        volatile uint16_t BITER_ELINKYES;
        volatile uint16_t BITER_ELINKNO;
    };
} IMXRT_DMA_TCD_t;
#define IMXRT_DMA (*(IMXRT_DMA_t *)0x400E8000)
#define DMA_CR (IMXRT_DMA.CR)
#define DMA_ES (IMXRT_DMA.ES)
#define DMA_ERQ (IMXRT_DMA.ERQ)
#define DMA_EEI (IMXRT_DMA.EEI)
#define DMA_CEEI (IMXRT_DMA.CEEI)
#define DMA_SEEI (IMXRT_DMA.SEEI)
#define DMA_CERQ (IMXRT_DMA.CERQ)
#define DMA_SERQ (IMXRT_DMA.SERQ)
#define DMA_CDNE (IMXRT_DMA.CDNE)
#define DMA_SSRT (IMXRT_DMA.SSRT)
#define DMA_CERR (IMXRT_DMA.CERR)
#define DMA_CINT (IMXRT_DMA.CINT)
#define DMA_INT (IMXRT_DMA.INT)
#define DMA_ERR (IMXRT_DMA.ERR)
#define DMA_HRS (IMXRT_DMA.HRS)
#define DMA_EARS (IMXRT_DMA.EARS)
#define DMA_DCHPRI3 (IMXRT_DMA.DCHPRI3)
#define DMA_DCHPRI2 (IMXRT_DMA.DCHPRI2)
#define DMA_DCHPRI1 (IMXRT_DMA.DCHPRI1)
#define DMA_DCHPRI0 (IMXRT_DMA.DCHPRI0)
#define DMA_DCHPRI7 (IMXRT_DMA.DCHPRI7)
#define DMA_DCHPRI6 (IMXRT_DMA.DCHPRI6)
#define DMA_DCHPRI5 (IMXRT_DMA.DCHPRI5)
#define DMA_DCHPRI4 (IMXRT_DMA.DCHPRI4)
#define DMA_DCHPRI11 (IMXRT_DMA.DCHPRI11)
#define DMA_DCHPRI10 (IMXRT_DMA.DCHPRI10)
#define DMA_DCHPRI9 (IMXRT_DMA.DCHPRI9)
#define DMA_DCHPRI8 (IMXRT_DMA.DCHPRI8)
#define DMA_DCHPRI15 (IMXRT_DMA.DCHPRI15)
#define DMA_DCHPRI14 (IMXRT_DMA.DCHPRI14)
#define DMA_DCHPRI13 (IMXRT_DMA.DCHPRI13)
#define DMA_DCHPRI12 (IMXRT_DMA.DCHPRI12)
#define DMA_DCHPRI19 (IMXRT_DMA.DCHPRI19)
#define DMA_DCHPRI18 (IMXRT_DMA.DCHPRI18)
#define DMA_DCHPRI17 (IMXRT_DMA.DCHPRI17)
#define DMA_DCHPRI16 (IMXRT_DMA.DCHPRI16)
#define DMA_DCHPRI23 (IMXRT_DMA.DCHPRI23)
#define DMA_DCHPRI22 (IMXRT_DMA.DCHPRI22)
#define DMA_DCHPRI21 (IMXRT_DMA.DCHPRI21)
#define DMA_DCHPRI20 (IMXRT_DMA.DCHPRI20)
#define DMA_DCHPRI27 (IMXRT_DMA.DCHPRI27)
#define DMA_DCHPRI26 (IMXRT_DMA.DCHPRI26)
#define DMA_DCHPRI25 (IMXRT_DMA.DCHPRI25)
#define DMA_DCHPRI24 (IMXRT_DMA.DCHPRI24)
#define DMA_DCHPRI31 (IMXRT_DMA.DCHPRI31)
#define DMA_DCHPRI30 (IMXRT_DMA.DCHPRI30)
#define DMA_DCHPRI29 (IMXRT_DMA.DCHPRI29)
#define DMA_DCHPRI28 (IMXRT_DMA.DCHPRI28)

