gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
#define DMA_CR_ACTIVE ((uint32_t)(1 << 31)) // 1=DMA is executing
#define DMA_CR_CX ((uint32_t)(1 << 17))     // Cancel Transfer
#define DMA_CR_ECX ((uint32_t)(1 << 16))    // Error Cancel Transfer
#define DMA_CR_GRP1PRI ((uint32_t)(1 << 10))
#define DMA_CR_GRP0PRI ((uint32_t)(1 << 8))
#define DMA_CR_EMLM ((uint32_t)(1 << 7))       // Enable Minor Loop Mapping
#define DMA_CR_CLM ((uint32_t)(1 << 6))        // Continuous Link Mode
#define DMA_CR_HALT ((uint32_t)(1 << 5))       // Halt DMA Operations
#define DMA_CR_HOE ((uint32_t)(1 << 4))        // Halt On Error
#define DMA_CR_ERGA ((uint32_t)(1 << 3))       // Enable Round Robin Group Arb
#define DMA_CR_ERCA ((uint32_t)(1 << 2))       // Enable Round Robin Channel Arb
#define DMA_CR_EDBG ((uint32_t)(1 << 1))       // Enable Debug
#define DMA_CEEI_CEEI(n) ((uint8_t)(n & 0x1F)) // Clear Enable Error Interrupt
#define DMA_CEEI_CAEE ((uint8_t)1 << 6)        // Clear All Enable Error Interrupts
#define DMA_CEEI_NOP ((uint8_t)1 << 7)         // NOP
#define DMA_SEEI_SEEI(n) ((uint8_t)(n & 0x1F)) // Set Enable Error Interrupt
#define DMA_SEEI_SAEE ((uint8_t)1 << 6)        // Set All Enable Error Interrupts
#define DMA_SEEI_NOP ((uint8_t)1 << 7)         // NOP
#define DMA_CERQ_CERQ(n) ((uint8_t)(n & 0x1F)) // Clear Enable Request
#define DMA_CERQ_CAER ((uint8_t)1 << 6)        // Clear All Enable Requests
#define DMA_CERQ_NOP ((uint8_t)1 << 7)         // NOP
#define DMA_SERQ_SERQ(n) ((uint8_t)(n & 0x1F)) // Set Enable Request
#define DMA_SERQ_SAER ((uint8_t)1 << 6)        // Set All Enable Requests
#define DMA_SERQ_NOP ((uint8_t)1 << 7)         // NOP
#define DMA_CDNE_CDNE(n) ((uint8_t)(n & 0x1F)) // Clear Done Bit
#define DMA_CDNE_CADN ((uint8_t)1 << 6)        // Clear All Done Bits
#define DMA_CDNE_NOP ((uint8_t)1 << 7)         // NOP
#define DMA_SSRT_SSRT(n) ((uint8_t)(n & 0x1F)) // Set Start Bit
#define DMA_SSRT_SAST ((uint8_t)1 << 6)        // Set All Start Bits
#define DMA_SSRT_NOP ((uint8_t)1 << 7)         // NOP
#define DMA_CERR_CERR(n) ((uint8_t)(n & 0x1F)) // Clear Error Indicator
#define DMA_CERR_CAEI ((uint8_t)1 << 6)        // Clear All Error Indicators
#define DMA_CERR_NOP ((uint8_t)1 << 7)         // NOP
#define DMA_CINT_CINT(n) ((uint8_t)(n & 0x1F)) // Clear Interrupt Request
#define DMA_CINT_CAIR ((uint8_t)1 << 6)        // Clear All Interrupt Requests
#define DMA_CINT_NOP ((uint8_t)1 << 7)         // NOP

#define IMXRT_DMA_TCD ((IMXRT_DMA_TCD_t *)0x400E9000)
#define DMA_TCD0_SADDR (IMXRT_DMA_TCD[0].SADDR)
#define DMA_TCD0_SOFF (IMXRT_DMA_TCD[0].SOFF)
#define DMA_TCD0_ATTR (IMXRT_DMA_TCD[0].ATTR)
#define DMA_TCD0_NBYTES (IMXRT_DMA_TCD[0].NBYTES)
#define DMA_TCD0_NBYTES_MLNO (IMXRT_DMA_TCD[0].NBYTES_MLNO)
#define DMA_TCD0_NBYTES_MLOFFNO (IMXRT_DMA_TCD[0].NBYTES_MLOFFNO)
#define DMA_TCD0_NBYTES_MLOFFYES (IMXRT_DMA_TCD[0].NBYTES_MLOFFYES)
#define DMA_TCD0_SLAST (IMXRT_DMA_TCD[0].SLAST)
#define DMA_TCD0_DADDR (IMXRT_DMA_TCD[0].DADDR)
#define DMA_TCD0_DOFF (IMXRT_DMA_TCD[0].DOFF)
#define DMA_TCD0_CITER (IMXRT_DMA_TCD[0].CITER)
#define DMA_TCD0_CITER_ELINKYES (IMXRT_DMA_TCD[0].CITER_ELINKYES)
#define DMA_TCD0_CITER_ELINKNO (IMXRT_DMA_TCD[0].CITER_ELINKNO)
#define DMA_TCD0_DLASTSGA (IMXRT_DMA_TCD[0].DLASTSGA)
#define DMA_TCD0_CSR (IMXRT_DMA_TCD[0].CSR)
#define DMA_TCD0_BITER (IMXRT_DMA_TCD[0].BITER)
#define DMA_TCD0_BITER_ELINKYES (IMXRT_DMA_TCD[0].BITER_ELINKYES)
#define DMA_TCD0_BITER_ELINKNO (IMXRT_DMA_TCD[0].BITER_ELINKNO)

#define DMA_TCD1_SADDR (IMXRT_DMA_TCD[1].SADDR)
#define DMA_TCD1_SOFF (IMXRT_DMA_TCD[1].SOFF)
#define DMA_TCD1_ATTR (IMXRT_DMA_TCD[1].ATTR)
#define DMA_TCD1_NBYTES (IMXRT_DMA_TCD[1].NBYTES)
#define DMA_TCD1_NBYTES_MLNO (IMXRT_DMA_TCD[1].NBYTES_MLNO)
#define DMA_TCD1_NBYTES_MLOFFNO (IMXRT_DMA_TCD[1].NBYTES_MLOFFNO)
#define DMA_TCD1_NBYTES_MLOFFYES (IMXRT_DMA_TCD[1].NBYTES_MLOFFYES)
#define DMA_TCD1_SLAST (IMXRT_DMA_TCD[1].SLAST)
#define DMA_TCD1_DADDR (IMXRT_DMA_TCD[1].DADDR)
#define DMA_TCD1_DOFF (IMXRT_DMA_TCD[1].DOFF)
#define DMA_TCD1_CITER (IMXRT_DMA_TCD[1].CITER)
#define DMA_TCD1_CITER_ELINKYES (IMXRT_DMA_TCD[1].CITER_ELINKYES)
#define DMA_TCD1_CITER_ELINKNO (IMXRT_DMA_TCD[1].CITER_ELINKNO)
#define DMA_TCD1_DLASTSGA (IMXRT_DMA_TCD[1].DLASTSGA)
#define DMA_TCD1_CSR (IMXRT_DMA_TCD[1].CSR)
#define DMA_TCD1_BITER (IMXRT_DMA_TCD[1].BITER)
#define DMA_TCD1_BITER_ELINKYES (IMXRT_DMA_TCD[1].BITER_ELINKYES)
#define DMA_TCD1_BITER_ELINKNO (IMXRT_DMA_TCD[1].BITER_ELINKNO)

#define DMA_TCD2_SADDR (IMXRT_DMA_TCD[2].SADDR)
#define DMA_TCD2_SOFF (IMXRT_DMA_TCD[2].SOFF)
#define DMA_TCD2_ATTR (IMXRT_DMA_TCD[2].ATTR)
#define DMA_TCD2_NBYTES (IMXRT_DMA_TCD[2].NBYTES)
#define DMA_TCD2_NBYTES_MLNO (IMXRT_DMA_TCD[2].NBYTES_MLNO)
#define DMA_TCD2_NBYTES_MLOFFNO (IMXRT_DMA_TCD[2].NBYTES_MLOFFNO)
#define DMA_TCD2_NBYTES_MLOFFYES (IMXRT_DMA_TCD[2].NBYTES_MLOFFYES)
#define DMA_TCD2_SLAST (IMXRT_DMA_TCD[2].SLAST)
#define DMA_TCD2_DADDR (IMXRT_DMA_TCD[2].DADDR)
#define DMA_TCD2_DOFF (IMXRT_DMA_TCD[2].DOFF)
#define DMA_TCD2_CITER (IMXRT_DMA_TCD[2].CITER)
#define DMA_TCD2_CITER_ELINKYES (IMXRT_DMA_TCD[2].CITER_ELINKYES)
#define DMA_TCD2_CITER_ELINKNO (IMXRT_DMA_TCD[2].CITER_ELINKNO)
#define DMA_TCD2_DLASTSGA (IMXRT_DMA_TCD[2].DLASTSGA)
#define DMA_TCD2_CSR (IMXRT_DMA_TCD[2].CSR)
#define DMA_TCD2_BITER (IMXRT_DMA_TCD[2].BITER)
#define DMA_TCD2_BITER_ELINKYES (IMXRT_DMA_TCD[2].BITER_ELINKYES)
#define DMA_TCD2_BITER_ELINKNO (IMXRT_DMA_TCD[2].BITER_ELINKNO)

#define DMA_TCD3_SADDR (IMXRT_DMA_TCD[3].SADDR)
#define DMA_TCD3_SOFF (IMXRT_DMA_TCD[3].SOFF)
#define DMA_TCD3_ATTR (IMXRT_DMA_TCD[3].ATTR)
#define DMA_TCD3_NBYTES (IMXRT_DMA_TCD[3].NBYTES)
#define DMA_TCD3_NBYTES_MLNO (IMXRT_DMA_TCD[3].NBYTES_MLNO)
#define DMA_TCD3_NBYTES_MLOFFNO (IMXRT_DMA_TCD[3].NBYTES_MLOFFNO)
#define DMA_TCD3_NBYTES_MLOFFYES (IMXRT_DMA_TCD[3].NBYTES_MLOFFYES)
#define DMA_TCD3_SLAST (IMXRT_DMA_TCD[3].SLAST)
#define DMA_TCD3_DADDR (IMXRT_DMA_TCD[3].DADDR)
#define DMA_TCD3_DOFF (IMXRT_DMA_TCD[3].DOFF)
#define DMA_TCD3_CITER (IMXRT_DMA_TCD[3].CITER)
#define DMA_TCD3_CITER_ELINKYES (IMXRT_DMA_TCD[3].CITER_ELINKYES)
#define DMA_TCD3_CITER_ELINKNO (IMXRT_DMA_TCD[3].CITER_ELINKNO)
#define DMA_TCD3_DLASTSGA (IMXRT_DMA_TCD[3].DLASTSGA)
#define DMA_TCD3_CSR (IMXRT_DMA_TCD[3].CSR)
#define DMA_TCD3_BITER (IMXRT_DMA_TCD[3].BITER)
#define DMA_TCD3_BITER_ELINKYES (IMXRT_DMA_TCD[3].BITER_ELINKYES)
#define DMA_TCD3_BITER_ELINKNO (IMXRT_DMA_TCD[3].BITER_ELINKNO)

#define DMA_TCD4_SADDR (IMXRT_DMA_TCD[4].SADDR)
#define DMA_TCD4_SOFF (IMXRT_DMA_TCD[4].SOFF)
#define DMA_TCD4_ATTR (IMXRT_DMA_TCD[4].ATTR)
#define DMA_TCD4_NBYTES (IMXRT_DMA_TCD[4].NBYTES)
#define DMA_TCD4_NBYTES_MLNO (IMXRT_DMA_TCD[4].NBYTES_MLNO)
#define DMA_TCD4_NBYTES_MLOFFNO (IMXRT_DMA_TCD[4].NBYTES_MLOFFNO)
#define DMA_TCD4_NBYTES_MLOFFYES (IMXRT_DMA_TCD[4].NBYTES_MLOFFYES)
#define DMA_TCD4_SLAST (IMXRT_DMA_TCD[4].SLAST)
#define DMA_TCD4_DADDR (IMXRT_DMA_TCD[4].DADDR)
#define DMA_TCD4_DOFF (IMXRT_DMA_TCD[4].DOFF)
#define DMA_TCD4_CITER (IMXRT_DMA_TCD[4].CITER)
#define DMA_TCD4_CITER_ELINKYES (IMXRT_DMA_TCD[4].CITER_ELINKYES)
#define DMA_TCD4_CITER_ELINKNO (IMXRT_DMA_TCD[4].CITER_ELINKNO)
#define DMA_TCD4_DLASTSGA (IMXRT_DMA_TCD[4].DLASTSGA)
#define DMA_TCD4_CSR (IMXRT_DMA_TCD[4].CSR)
#define DMA_TCD4_BITER (IMXRT_DMA_TCD[4].BITER)
#define DMA_TCD4_BITER_ELINKYES (IMXRT_DMA_TCD[4].BITER_ELINKYES)
#define DMA_TCD4_BITER_ELINKNO (IMXRT_DMA_TCD[4].BITER_ELINKNO)

