gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
#define DMA_TCD5_SADDR (IMXRT_DMA_TCD[5].SADDR)
#define DMA_TCD5_SOFF (IMXRT_DMA_TCD[5].SOFF)
#define DMA_TCD5_ATTR (IMXRT_DMA_TCD[5].ATTR)
#define DMA_TCD5_NBYTES (IMXRT_DMA_TCD[5].NBYTES)
#define DMA_TCD5_NBYTES_MLNO (IMXRT_DMA_TCD[5].NBYTES_MLNO)
#define DMA_TCD5_NBYTES_MLOFFNO (IMXRT_DMA_TCD[5].NBYTES_MLOFFNO)
#define DMA_TCD5_NBYTES_MLOFFYES (IMXRT_DMA_TCD[5].NBYTES_MLOFFYES)
#define DMA_TCD5_SLAST (IMXRT_DMA_TCD[5].SLAST)
#define DMA_TCD5_DADDR (IMXRT_DMA_TCD[5].DADDR)
#define DMA_TCD5_DOFF (IMXRT_DMA_TCD[5].DOFF)
#define DMA_TCD5_CITER (IMXRT_DMA_TCD[5].CITER)
#define DMA_TCD5_CITER_ELINKYES (IMXRT_DMA_TCD[5].CITER_ELINKYES)
#define DMA_TCD5_CITER_ELINKNO (IMXRT_DMA_TCD[5].CITER_ELINKNO)
#define DMA_TCD5_DLASTSGA (IMXRT_DMA_TCD[5].DLASTSGA)
#define DMA_TCD5_CSR (IMXRT_DMA_TCD[5].CSR)
#define DMA_TCD5_BITER (IMXRT_DMA_TCD[5].BITER)
#define DMA_TCD5_BITER_ELINKYES (IMXRT_DMA_TCD[5].BITER_ELINKYES)
#define DMA_TCD5_BITER_ELINKNO (IMXRT_DMA_TCD[5].BITER_ELINKNO)

#define DMA_TCD6_SADDR (IMXRT_DMA_TCD[6].SADDR)
#define DMA_TCD6_SOFF (IMXRT_DMA_TCD[6].SOFF)
#define DMA_TCD6_ATTR (IMXRT_DMA_TCD[6].ATTR)
#define DMA_TCD6_NBYTES (IMXRT_DMA_TCD[6].NBYTES)
#define DMA_TCD6_NBYTES_MLNO (IMXRT_DMA_TCD[6].NBYTES_MLNO)
#define DMA_TCD6_NBYTES_MLOFFNO (IMXRT_DMA_TCD[6].NBYTES_MLOFFNO)
#define DMA_TCD6_NBYTES_MLOFFYES (IMXRT_DMA_TCD[6].NBYTES_MLOFFYES)
#define DMA_TCD6_SLAST (IMXRT_DMA_TCD[6].SLAST)
#define DMA_TCD6_DADDR (IMXRT_DMA_TCD[6].DADDR)
#define DMA_TCD6_DOFF (IMXRT_DMA_TCD[6].DOFF)
#define DMA_TCD6_CITER (IMXRT_DMA_TCD[6].CITER)
#define DMA_TCD6_CITER_ELINKYES (IMXRT_DMA_TCD[6].CITER_ELINKYES)
#define DMA_TCD6_CITER_ELINKNO (IMXRT_DMA_TCD[6].CITER_ELINKNO)
#define DMA_TCD6_DLASTSGA (IMXRT_DMA_TCD[6].DLASTSGA)
#define DMA_TCD6_CSR (IMXRT_DMA_TCD[6].CSR)
#define DMA_TCD6_BITER (IMXRT_DMA_TCD[6].BITER)
#define DMA_TCD6_BITER_ELINKYES (IMXRT_DMA_TCD[6].BITER_ELINKYES)
#define DMA_TCD6_BITER_ELINKNO (IMXRT_DMA_TCD[6].BITER_ELINKNO)

#define DMA_TCD7_SADDR (IMXRT_DMA_TCD[7].SADDR)
#define DMA_TCD7_SOFF (IMXRT_DMA_TCD[7].SOFF)
#define DMA_TCD7_ATTR (IMXRT_DMA_TCD[7].ATTR)
#define DMA_TCD7_NBYTES (IMXRT_DMA_TCD[7].NBYTES)
#define DMA_TCD7_NBYTES_MLNO (IMXRT_DMA_TCD[7].NBYTES_MLNO)
#define DMA_TCD7_NBYTES_MLOFFNO (IMXRT_DMA_TCD[7].NBYTES_MLOFFNO)
#define DMA_TCD7_NBYTES_MLOFFYES (IMXRT_DMA_TCD[7].NBYTES_MLOFFYES)
#define DMA_TCD7_SLAST (IMXRT_DMA_TCD[7].SLAST)
#define DMA_TCD7_DADDR (IMXRT_DMA_TCD[7].DADDR)
#define DMA_TCD7_DOFF (IMXRT_DMA_TCD[7].DOFF)
#define DMA_TCD7_CITER (IMXRT_DMA_TCD[7].CITER)
#define DMA_TCD7_CITER_ELINKYES (IMXRT_DMA_TCD[7].CITER_ELINKYES)
#define DMA_TCD7_CITER_ELINKNO (IMXRT_DMA_TCD[7].CITER_ELINKNO)
#define DMA_TCD7_DLASTSGA (IMXRT_DMA_TCD[7].DLASTSGA)
#define DMA_TCD7_CSR (IMXRT_DMA_TCD[7].CSR)
#define DMA_TCD7_BITER (IMXRT_DMA_TCD[7].BITER)
#define DMA_TCD7_BITER_ELINKYES (IMXRT_DMA_TCD[7].BITER_ELINKYES)
#define DMA_TCD7_BITER_ELINKNO (IMXRT_DMA_TCD[7].BITER_ELINKNO)

#define DMA_TCD8_SADDR (IMXRT_DMA_TCD[8].SADDR)
#define DMA_TCD8_SOFF (IMXRT_DMA_TCD[8].SOFF)
#define DMA_TCD8_ATTR (IMXRT_DMA_TCD[8].ATTR)
#define DMA_TCD8_NBYTES (IMXRT_DMA_TCD[8].NBYTES)
#define DMA_TCD8_NBYTES_MLNO (IMXRT_DMA_TCD[8].NBYTES_MLNO)
#define DMA_TCD8_NBYTES_MLOFFNO (IMXRT_DMA_TCD[8].NBYTES_MLOFFNO)
#define DMA_TCD8_NBYTES_MLOFFYES (IMXRT_DMA_TCD[8].NBYTES_MLOFFYES)
#define DMA_TCD8_SLAST (IMXRT_DMA_TCD[8].SLAST)
#define DMA_TCD8_DADDR (IMXRT_DMA_TCD[8].DADDR)
#define DMA_TCD8_DOFF (IMXRT_DMA_TCD[8].DOFF)
#define DMA_TCD8_CITER (IMXRT_DMA_TCD[8].CITER)
#define DMA_TCD8_CITER_ELINKYES (IMXRT_DMA_TCD[8].CITER_ELINKYES)
#define DMA_TCD8_CITER_ELINKNO (IMXRT_DMA_TCD[8].CITER_ELINKNO)
#define DMA_TCD8_DLASTSGA (IMXRT_DMA_TCD[8].DLASTSGA)
#define DMA_TCD8_CSR (IMXRT_DMA_TCD[8].CSR)
#define DMA_TCD8_BITER (IMXRT_DMA_TCD[8].BITER)
#define DMA_TCD8_BITER_ELINKYES (IMXRT_DMA_TCD[8].BITER_ELINKYES)
#define DMA_TCD8_BITER_ELINKNO (IMXRT_DMA_TCD[8].BITER_ELINKNO)

#define DMA_TCD9_SADDR (IMXRT_DMA_TCD[9].SADDR)
#define DMA_TCD9_SOFF (IMXRT_DMA_TCD[9].SOFF)
#define DMA_TCD9_ATTR (IMXRT_DMA_TCD[9].ATTR)
#define DMA_TCD9_NBYTES (IMXRT_DMA_TCD[9].NBYTES)
#define DMA_TCD9_NBYTES_MLNO (IMXRT_DMA_TCD[9].NBYTES_MLNO)
#define DMA_TCD9_NBYTES_MLOFFNO (IMXRT_DMA_TCD[9].NBYTES_MLOFFNO)
#define DMA_TCD9_NBYTES_MLOFFYES (IMXRT_DMA_TCD[9].NBYTES_MLOFFYES)
#define DMA_TCD9_SLAST (IMXRT_DMA_TCD[9].SLAST)
#define DMA_TCD9_DADDR (IMXRT_DMA_TCD[9].DADDR)
#define DMA_TCD9_DOFF (IMXRT_DMA_TCD[9].DOFF)
#define DMA_TCD9_CITER (IMXRT_DMA_TCD[9].CITER)
#define DMA_TCD9_CITER_ELINKYES (IMXRT_DMA_TCD[9].CITER_ELINKYES)
#define DMA_TCD9_CITER_ELINKNO (IMXRT_DMA_TCD[9].CITER_ELINKNO)
#define DMA_TCD9_DLASTSGA (IMXRT_DMA_TCD[9].DLASTSGA)
#define DMA_TCD9_CSR (IMXRT_DMA_TCD[9].CSR)
#define DMA_TCD9_BITER (IMXRT_DMA_TCD[9].BITER)
#define DMA_TCD9_BITER_ELINKYES (IMXRT_DMA_TCD[9].BITER_ELINKYES)
#define DMA_TCD9_BITER_ELINKNO (IMXRT_DMA_TCD[9].BITER_ELINKNO)

#define DMA_TCD10_SADDR (IMXRT_DMA_TCD[10].SADDR)
#define DMA_TCD10_SOFF (IMXRT_DMA_TCD[10].SOFF)
#define DMA_TCD10_ATTR (IMXRT_DMA_TCD[10].ATTR)
#define DMA_TCD10_NBYTES (IMXRT_DMA_TCD[10].NBYTES)
#define DMA_TCD10_NBYTES_MLNO (IMXRT_DMA_TCD[10].NBYTES_MLNO)
#define DMA_TCD10_NBYTES_MLOFFNO (IMXRT_DMA_TCD[10].NBYTES_MLOFFNO)
#define DMA_TCD10_NBYTES_MLOFFYES (IMXRT_DMA_TCD[10].NBYTES_MLOFFYES)
#define DMA_TCD10_SLAST (IMXRT_DMA_TCD[10].SLAST)
#define DMA_TCD10_DADDR (IMXRT_DMA_TCD[10].DADDR)
#define DMA_TCD10_DOFF (IMXRT_DMA_TCD[10].DOFF)
#define DMA_TCD10_CITER (IMXRT_DMA_TCD[10].CITER)
#define DMA_TCD10_CITER_ELINKYES (IMXRT_DMA_TCD[10].CITER_ELINKYES)
#define DMA_TCD10_CITER_ELINKNO (IMXRT_DMA_TCD[10].CITER_ELINKNO)
#define DMA_TCD10_DLASTSGA (IMXRT_DMA_TCD[10].DLASTSGA)
#define DMA_TCD10_CSR (IMXRT_DMA_TCD[10].CSR)
#define DMA_TCD10_BITER (IMXRT_DMA_TCD[10].BITER)
#define DMA_TCD10_BITER_ELINKYES (IMXRT_DMA_TCD[10].BITER_ELINKYES)
#define DMA_TCD10_BITER_ELINKNO (IMXRT_DMA_TCD[10].BITER_ELINKNO)

#define DMA_TCD11_SADDR (IMXRT_DMA_TCD[11].SADDR)
#define DMA_TCD11_SOFF (IMXRT_DMA_TCD[11].SOFF)
#define DMA_TCD11_ATTR (IMXRT_DMA_TCD[11].ATTR)
#define DMA_TCD11_NBYTES (IMXRT_DMA_TCD[11].NBYTES)
#define DMA_TCD11_NBYTES_MLNO (IMXRT_DMA_TCD[11].NBYTES_MLNO)
#define DMA_TCD11_NBYTES_MLOFFNO (IMXRT_DMA_TCD[11].NBYTES_MLOFFNO)
#define DMA_TCD11_NBYTES_MLOFFYES (IMXRT_DMA_TCD[11].NBYTES_MLOFFYES)
#define DMA_TCD11_SLAST (IMXRT_DMA_TCD[11].SLAST)
#define DMA_TCD11_DADDR (IMXRT_DMA_TCD[11].DADDR)
#define DMA_TCD11_DOFF (IMXRT_DMA_TCD[11].DOFF)
#define DMA_TCD11_CITER (IMXRT_DMA_TCD[11].CITER)
#define DMA_TCD11_CITER_ELINKYES (IMXRT_DMA_TCD[11].CITER_ELINKYES)
#define DMA_TCD11_CITER_ELINKNO (IMXRT_DMA_TCD[11].CITER_ELINKNO)
#define DMA_TCD11_DLASTSGA (IMXRT_DMA_TCD[11].DLASTSGA)
#define DMA_TCD11_CSR (IMXRT_DMA_TCD[11].CSR)
#define DMA_TCD11_BITER (IMXRT_DMA_TCD[11].BITER)
#define DMA_TCD11_BITER_ELINKYES (IMXRT_DMA_TCD[11].BITER_ELINKYES)
#define DMA_TCD11_BITER_ELINKNO (IMXRT_DMA_TCD[11].BITER_ELINKNO)

#define DMA_TCD12_SADDR (IMXRT_DMA_TCD[12].SADDR)
#define DMA_TCD12_SOFF (IMXRT_DMA_TCD[12].SOFF)
#define DMA_TCD12_ATTR (IMXRT_DMA_TCD[12].ATTR)
#define DMA_TCD12_NBYTES (IMXRT_DMA_TCD[12].NBYTES)
#define DMA_TCD12_NBYTES_MLNO (IMXRT_DMA_TCD[12].NBYTES_MLNO)
#define DMA_TCD12_NBYTES_MLOFFNO (IMXRT_DMA_TCD[12].NBYTES_MLOFFNO)
#define DMA_TCD12_NBYTES_MLOFFYES (IMXRT_DMA_TCD[12].NBYTES_MLOFFYES)
#define DMA_TCD12_SLAST (IMXRT_DMA_TCD[12].SLAST)
#define DMA_TCD12_DADDR (IMXRT_DMA_TCD[12].DADDR)
#define DMA_TCD12_DOFF (IMXRT_DMA_TCD[12].DOFF)
#define DMA_TCD12_CITER (IMXRT_DMA_TCD[12].CITER)
#define DMA_TCD12_CITER_ELINKYES (IMXRT_DMA_TCD[12].CITER_ELINKYES)
#define DMA_TCD12_CITER_ELINKNO (IMXRT_DMA_TCD[12].CITER_ELINKNO)
#define DMA_TCD12_DLASTSGA (IMXRT_DMA_TCD[12].DLASTSGA)
#define DMA_TCD12_CSR (IMXRT_DMA_TCD[12].CSR)
#define DMA_TCD12_BITER (IMXRT_DMA_TCD[12].BITER)
#define DMA_TCD12_BITER_ELINKYES (IMXRT_DMA_TCD[12].BITER_ELINKYES)
#define DMA_TCD12_BITER_ELINKNO (IMXRT_DMA_TCD[12].BITER_ELINKNO)

#define DMA_TCD13_SADDR (IMXRT_DMA_TCD[13].SADDR)
#define DMA_TCD13_SOFF (IMXRT_DMA_TCD[13].SOFF)
#define DMA_TCD13_ATTR (IMXRT_DMA_TCD[13].ATTR)
#define DMA_TCD13_NBYTES (IMXRT_DMA_TCD[13].NBYTES)
#define DMA_TCD13_NBYTES_MLNO (IMXRT_DMA_TCD[13].NBYTES_MLNO)
#define DMA_TCD13_NBYTES_MLOFFNO (IMXRT_DMA_TCD[13].NBYTES_MLOFFNO)
#define DMA_TCD13_NBYTES_MLOFFYES (IMXRT_DMA_TCD[13].NBYTES_MLOFFYES)
#define DMA_TCD13_SLAST (IMXRT_DMA_TCD[13].SLAST)
#define DMA_TCD13_DADDR (IMXRT_DMA_TCD[13].DADDR)
#define DMA_TCD13_DOFF (IMXRT_DMA_TCD[13].DOFF)
#define DMA_TCD13_CITER (IMXRT_DMA_TCD[13].CITER)
#define DMA_TCD13_CITER_ELINKYES (IMXRT_DMA_TCD[13].CITER_ELINKYES)
#define DMA_TCD13_CITER_ELINKNO (IMXRT_DMA_TCD[13].CITER_ELINKNO)
#define DMA_TCD13_DLASTSGA (IMXRT_DMA_TCD[13].DLASTSGA)
#define DMA_TCD13_CSR (IMXRT_DMA_TCD[13].CSR)
#define DMA_TCD13_BITER (IMXRT_DMA_TCD[13].BITER)
#define DMA_TCD13_BITER_ELINKYES (IMXRT_DMA_TCD[13].BITER_ELINKYES)
#define DMA_TCD13_BITER_ELINKNO (IMXRT_DMA_TCD[13].BITER_ELINKNO)

#define DMA_TCD14_SADDR (IMXRT_DMA_TCD[14].SADDR)
#define DMA_TCD14_SOFF (IMXRT_DMA_TCD[14].SOFF)
#define DMA_TCD14_ATTR (IMXRT_DMA_TCD[14].ATTR)
#define DMA_TCD14_NBYTES (IMXRT_DMA_TCD[14].NBYTES)
#define DMA_TCD14_NBYTES_MLNO (IMXRT_DMA_TCD[14].NBYTES_MLNO)
#define DMA_TCD14_NBYTES_MLOFFNO (IMXRT_DMA_TCD[14].NBYTES_MLOFFNO)
#define DMA_TCD14_NBYTES_MLOFFYES (IMXRT_DMA_TCD[14].NBYTES_MLOFFYES)
#define DMA_TCD14_SLAST (IMXRT_DMA_TCD[14].SLAST)
#define DMA_TCD14_DADDR (IMXRT_DMA_TCD[14].DADDR)
#define DMA_TCD14_DOFF (IMXRT_DMA_TCD[14].DOFF)
#define DMA_TCD14_CITER (IMXRT_DMA_TCD[14].CITER)
#define DMA_TCD14_CITER_ELINKYES (IMXRT_DMA_TCD[14].CITER_ELINKYES)
#define DMA_TCD14_CITER_ELINKNO (IMXRT_DMA_TCD[14].CITER_ELINKNO)
#define DMA_TCD14_DLASTSGA (IMXRT_DMA_TCD[14].DLASTSGA)
#define DMA_TCD14_CSR (IMXRT_DMA_TCD[14].CSR)
#define DMA_TCD14_BITER (IMXRT_DMA_TCD[14].BITER)
#define DMA_TCD14_BITER_ELINKYES (IMXRT_DMA_TCD[14].BITER_ELINKYES)
#define DMA_TCD14_BITER_ELINKNO (IMXRT_DMA_TCD[14].BITER_ELINKNO)

#define DMA_TCD15_SADDR (IMXRT_DMA_TCD[15].SADDR)
#define DMA_TCD15_SOFF (IMXRT_DMA_TCD[15].SOFF)
#define DMA_TCD15_ATTR (IMXRT_DMA_TCD[15].ATTR)
#define DMA_TCD15_NBYTES (IMXRT_DMA_TCD[15].NBYTES)
#define DMA_TCD15_NBYTES_MLNO (IMXRT_DMA_TCD[15].NBYTES_MLNO)
#define DMA_TCD15_NBYTES_MLOFFNO (IMXRT_DMA_TCD[15].NBYTES_MLOFFNO)
#define DMA_TCD15_NBYTES_MLOFFYES (IMXRT_DMA_TCD[15].NBYTES_MLOFFYES)
#define DMA_TCD15_SLAST (IMXRT_DMA_TCD[15].SLAST)
#define DMA_TCD15_DADDR (IMXRT_DMA_TCD[15].DADDR)
#define DMA_TCD15_DOFF (IMXRT_DMA_TCD[15].DOFF)
#define DMA_TCD15_CITER (IMXRT_DMA_TCD[15].CITER)
#define DMA_TCD15_CITER_ELINKYES (IMXRT_DMA_TCD[15].CITER_ELINKYES)
#define DMA_TCD15_CITER_ELINKNO (IMXRT_DMA_TCD[15].CITER_ELINKNO)
#define DMA_TCD15_DLASTSGA (IMXRT_DMA_TCD[15].DLASTSGA)
#define DMA_TCD15_CSR (IMXRT_DMA_TCD[15].CSR)
#define DMA_TCD15_BITER (IMXRT_DMA_TCD[15].BITER)
#define DMA_TCD15_BITER_ELINKYES (IMXRT_DMA_TCD[15].BITER_ELINKYES)
#define DMA_TCD15_BITER_ELINKNO (IMXRT_DMA_TCD[15].BITER_ELINKNO)

#define DMA_TCD16_SADDR (IMXRT_DMA_TCD[16].SADDR)
#define DMA_TCD16_SOFF (IMXRT_DMA_TCD[16].SOFF)
#define DMA_TCD16_ATTR (IMXRT_DMA_TCD[16].ATTR)
#define DMA_TCD16_NBYTES (IMXRT_DMA_TCD[16].NBYTES)
#define DMA_TCD16_NBYTES_MLNO (IMXRT_DMA_TCD[16].NBYTES_MLNO)
#define DMA_TCD16_NBYTES_MLOFFNO (IMXRT_DMA_TCD[16].NBYTES_MLOFFNO)
#define DMA_TCD16_NBYTES_MLOFFYES (IMXRT_DMA_TCD[16].NBYTES_MLOFFYES)
#define DMA_TCD16_SLAST (IMXRT_DMA_TCD[16].SLAST)
#define DMA_TCD16_DADDR (IMXRT_DMA_TCD[16].DADDR)
#define DMA_TCD16_DOFF (IMXRT_DMA_TCD[16].DOFF)
#define DMA_TCD16_CITER (IMXRT_DMA_TCD[16].CITER)
#define DMA_TCD16_CITER_ELINKYES (IMXRT_DMA_TCD[16].CITER_ELINKYES)
#define DMA_TCD16_CITER_ELINKNO (IMXRT_DMA_TCD[16].CITER_ELINKNO)
#define DMA_TCD16_DLASTSGA (IMXRT_DMA_TCD[16].DLASTSGA)
#define DMA_TCD16_CSR (IMXRT_DMA_TCD[16].CSR)
#define DMA_TCD16_BITER (IMXRT_DMA_TCD[16].BITER)
#define DMA_TCD16_BITER_ELINKYES (IMXRT_DMA_TCD[16].BITER_ELINKYES)
#define DMA_TCD16_BITER_ELINKNO (IMXRT_DMA_TCD[16].BITER_ELINKNO)

#define DMA_TCD17_SADDR (IMXRT_DMA_TCD[17].SADDR)
#define DMA_TCD17_SOFF (IMXRT_DMA_TCD[17].SOFF)
#define DMA_TCD17_ATTR (IMXRT_DMA_TCD[17].ATTR)
#define DMA_TCD17_NBYTES (IMXRT_DMA_TCD[17].NBYTES)
#define DMA_TCD17_NBYTES_MLNO (IMXRT_DMA_TCD[17].NBYTES_MLNO)
#define DMA_TCD17_NBYTES_MLOFFNO (IMXRT_DMA_TCD[17].NBYTES_MLOFFNO)
#define DMA_TCD17_NBYTES_MLOFFYES (IMXRT_DMA_TCD[17].NBYTES_MLOFFYES)
#define DMA_TCD17_SLAST (IMXRT_DMA_TCD[17].SLAST)
#define DMA_TCD17_DADDR (IMXRT_DMA_TCD[17].DADDR)
#define DMA_TCD17_DOFF (IMXRT_DMA_TCD[17].DOFF)
#define DMA_TCD17_CITER (IMXRT_DMA_TCD[17].CITER)
#define DMA_TCD17_CITER_ELINKYES (IMXRT_DMA_TCD[17].CITER_ELINKYES)
#define DMA_TCD17_CITER_ELINKNO (IMXRT_DMA_TCD[17].CITER_ELINKNO)
#define DMA_TCD17_DLASTSGA (IMXRT_DMA_TCD[17].DLASTSGA)
#define DMA_TCD17_CSR (IMXRT_DMA_TCD[17].CSR)
#define DMA_TCD17_BITER (IMXRT_DMA_TCD[17].BITER)
#define DMA_TCD17_BITER_ELINKYES (IMXRT_DMA_TCD[17].BITER_ELINKYES)
#define DMA_TCD17_BITER_ELINKNO (IMXRT_DMA_TCD[17].BITER_ELINKNO)

