gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
#define DMA_TCD18_SADDR (IMXRT_DMA_TCD[18].SADDR)
#define DMA_TCD18_SOFF (IMXRT_DMA_TCD[18].SOFF)
#define DMA_TCD18_ATTR (IMXRT_DMA_TCD[18].ATTR)
#define DMA_TCD18_NBYTES (IMXRT_DMA_TCD[18].NBYTES)
#define DMA_TCD18_NBYTES_MLNO (IMXRT_DMA_TCD[18].NBYTES_MLNO)
#define DMA_TCD18_NBYTES_MLOFFNO (IMXRT_DMA_TCD[18].NBYTES_MLOFFNO)
#define DMA_TCD18_NBYTES_MLOFFYES (IMXRT_DMA_TCD[18].NBYTES_MLOFFYES)
#define DMA_TCD18_SLAST (IMXRT_DMA_TCD[18].SLAST)
#define DMA_TCD18_DADDR (IMXRT_DMA_TCD[18].DADDR)
#define DMA_TCD18_DOFF (IMXRT_DMA_TCD[18].DOFF)
#define DMA_TCD18_CITER (IMXRT_DMA_TCD[18].CITER)
#define DMA_TCD18_CITER_ELINKYES (IMXRT_DMA_TCD[18].CITER_ELINKYES)
#define DMA_TCD18_CITER_ELINKNO (IMXRT_DMA_TCD[18].CITER_ELINKNO)
#define DMA_TCD18_DLASTSGA (IMXRT_DMA_TCD[18].DLASTSGA)
#define DMA_TCD18_CSR (IMXRT_DMA_TCD[18].CSR)
#define DMA_TCD18_BITER (IMXRT_DMA_TCD[18].BITER)
#define DMA_TCD18_BITER_ELINKYES (IMXRT_DMA_TCD[18].BITER_ELINKYES)
#define DMA_TCD18_BITER_ELINKNO (IMXRT_DMA_TCD[18].BITER_ELINKNO)

#define DMA_TCD19_SADDR (IMXRT_DMA_TCD[19].SADDR)
#define DMA_TCD19_SOFF (IMXRT_DMA_TCD[19].SOFF)
#define DMA_TCD19_ATTR (IMXRT_DMA_TCD[19].ATTR)
#define DMA_TCD19_NBYTES (IMXRT_DMA_TCD[19].NBYTES)
#define DMA_TCD19_NBYTES_MLNO (IMXRT_DMA_TCD[19].NBYTES_MLNO)
#define DMA_TCD19_NBYTES_MLOFFNO (IMXRT_DMA_TCD[19].NBYTES_MLOFFNO)
#define DMA_TCD19_NBYTES_MLOFFYES (IMXRT_DMA_TCD[19].NBYTES_MLOFFYES)
#define DMA_TCD19_SLAST (IMXRT_DMA_TCD[19].SLAST)
#define DMA_TCD19_DADDR (IMXRT_DMA_TCD[19].DADDR)
#define DMA_TCD19_DOFF (IMXRT_DMA_TCD[19].DOFF)
#define DMA_TCD19_CITER (IMXRT_DMA_TCD[19].CITER)
#define DMA_TCD19_CITER_ELINKYES (IMXRT_DMA_TCD[19].CITER_ELINKYES)
#define DMA_TCD19_CITER_ELINKNO (IMXRT_DMA_TCD[19].CITER_ELINKNO)
#define DMA_TCD19_DLASTSGA (IMXRT_DMA_TCD[19].DLASTSGA)
#define DMA_TCD19_CSR (IMXRT_DMA_TCD[19].CSR)
#define DMA_TCD19_BITER (IMXRT_DMA_TCD[19].BITER)
#define DMA_TCD19_BITER_ELINKYES (IMXRT_DMA_TCD[19].BITER_ELINKYES)
#define DMA_TCD19_BITER_ELINKNO (IMXRT_DMA_TCD[19].BITER_ELINKNO)

#define DMA_TCD20_SADDR (IMXRT_DMA_TCD[20].SADDR)
#define DMA_TCD20_SOFF (IMXRT_DMA_TCD[20].SOFF)
#define DMA_TCD20_ATTR (IMXRT_DMA_TCD[20].ATTR)
#define DMA_TCD20_NBYTES (IMXRT_DMA_TCD[20].NBYTES)
#define DMA_TCD20_NBYTES_MLNO (IMXRT_DMA_TCD[20].NBYTES_MLNO)
#define DMA_TCD20_NBYTES_MLOFFNO (IMXRT_DMA_TCD[20].NBYTES_MLOFFNO)
#define DMA_TCD20_NBYTES_MLOFFYES (IMXRT_DMA_TCD[20].NBYTES_MLOFFYES)
#define DMA_TCD20_SLAST (IMXRT_DMA_TCD[20].SLAST)
#define DMA_TCD20_DADDR (IMXRT_DMA_TCD[20].DADDR)
#define DMA_TCD20_DOFF (IMXRT_DMA_TCD[20].DOFF)
#define DMA_TCD20_CITER (IMXRT_DMA_TCD[20].CITER)
#define DMA_TCD20_CITER_ELINKYES (IMXRT_DMA_TCD[20].CITER_ELINKYES)
#define DMA_TCD20_CITER_ELINKNO (IMXRT_DMA_TCD[20].CITER_ELINKNO)
#define DMA_TCD20_DLASTSGA (IMXRT_DMA_TCD[20].DLASTSGA)
#define DMA_TCD20_CSR (IMXRT_DMA_TCD[20].CSR)
#define DMA_TCD20_BITER (IMXRT_DMA_TCD[20].BITER)
#define DMA_TCD20_BITER_ELINKYES (IMXRT_DMA_TCD[20].BITER_ELINKYES)
#define DMA_TCD20_BITER_ELINKNO (IMXRT_DMA_TCD[20].BITER_ELINKNO)

#define DMA_TCD21_SADDR (IMXRT_DMA_TCD[21].SADDR)
#define DMA_TCD21_SOFF (IMXRT_DMA_TCD[21].SOFF)
#define DMA_TCD21_ATTR (IMXRT_DMA_TCD[21].ATTR)
#define DMA_TCD21_NBYTES (IMXRT_DMA_TCD[21].NBYTES)
#define DMA_TCD21_NBYTES_MLNO (IMXRT_DMA_TCD[21].NBYTES_MLNO)
#define DMA_TCD21_NBYTES_MLOFFNO (IMXRT_DMA_TCD[21].NBYTES_MLOFFNO)
#define DMA_TCD21_NBYTES_MLOFFYES (IMXRT_DMA_TCD[21].NBYTES_MLOFFYES)
#define DMA_TCD21_SLAST (IMXRT_DMA_TCD[21].SLAST)
#define DMA_TCD21_DADDR (IMXRT_DMA_TCD[21].DADDR)
#define DMA_TCD21_DOFF (IMXRT_DMA_TCD[21].DOFF)
#define DMA_TCD21_CITER (IMXRT_DMA_TCD[21].CITER)
#define DMA_TCD21_CITER_ELINKYES (IMXRT_DMA_TCD[21].CITER_ELINKYES)
#define DMA_TCD21_CITER_ELINKNO (IMXRT_DMA_TCD[21].CITER_ELINKNO)
#define DMA_TCD21_DLASTSGA (IMXRT_DMA_TCD[21].DLASTSGA)
#define DMA_TCD21_CSR (IMXRT_DMA_TCD[21].CSR)
#define DMA_TCD21_BITER (IMXRT_DMA_TCD[21].BITER)
#define DMA_TCD21_BITER_ELINKYES (IMXRT_DMA_TCD[21].BITER_ELINKYES)
#define DMA_TCD21_BITER_ELINKNO (IMXRT_DMA_TCD[21].BITER_ELINKNO)

#define DMA_TCD22_SADDR (IMXRT_DMA_TCD[22].SADDR)
#define DMA_TCD22_SOFF (IMXRT_DMA_TCD[22].SOFF)
#define DMA_TCD22_ATTR (IMXRT_DMA_TCD[22].ATTR)
#define DMA_TCD22_NBYTES (IMXRT_DMA_TCD[22].NBYTES)
#define DMA_TCD22_NBYTES_MLNO (IMXRT_DMA_TCD[22].NBYTES_MLNO)
#define DMA_TCD22_NBYTES_MLOFFNO (IMXRT_DMA_TCD[22].NBYTES_MLOFFNO)
#define DMA_TCD22_NBYTES_MLOFFYES (IMXRT_DMA_TCD[22].NBYTES_MLOFFYES)
#define DMA_TCD22_SLAST (IMXRT_DMA_TCD[22].SLAST)
#define DMA_TCD22_DADDR (IMXRT_DMA_TCD[22].DADDR)
#define DMA_TCD22_DOFF (IMXRT_DMA_TCD[22].DOFF)
#define DMA_TCD22_CITER (IMXRT_DMA_TCD[22].CITER)
#define DMA_TCD22_CITER_ELINKYES (IMXRT_DMA_TCD[22].CITER_ELINKYES)
#define DMA_TCD22_CITER_ELINKNO (IMXRT_DMA_TCD[22].CITER_ELINKNO)
#define DMA_TCD22_DLASTSGA (IMXRT_DMA_TCD[22].DLASTSGA)
#define DMA_TCD22_CSR (IMXRT_DMA_TCD[22].CSR)
#define DMA_TCD22_BITER (IMXRT_DMA_TCD[22].BITER)
#define DMA_TCD22_BITER_ELINKYES (IMXRT_DMA_TCD[22].BITER_ELINKYES)
#define DMA_TCD22_BITER_ELINKNO (IMXRT_DMA_TCD[22].BITER_ELINKNO)

#define DMA_TCD23_SADDR (IMXRT_DMA_TCD[23].SADDR)
#define DMA_TCD23_SOFF (IMXRT_DMA_TCD[23].SOFF)
#define DMA_TCD23_ATTR (IMXRT_DMA_TCD[23].ATTR)
#define DMA_TCD23_NBYTES (IMXRT_DMA_TCD[23].NBYTES)
#define DMA_TCD23_NBYTES_MLNO (IMXRT_DMA_TCD[23].NBYTES_MLNO)
#define DMA_TCD23_NBYTES_MLOFFNO (IMXRT_DMA_TCD[23].NBYTES_MLOFFNO)
#define DMA_TCD23_NBYTES_MLOFFYES (IMXRT_DMA_TCD[23].NBYTES_MLOFFYES)
#define DMA_TCD23_SLAST (IMXRT_DMA_TCD[23].SLAST)
#define DMA_TCD23_DADDR (IMXRT_DMA_TCD[23].DADDR)
#define DMA_TCD23_DOFF (IMXRT_DMA_TCD[23].DOFF)
#define DMA_TCD23_CITER (IMXRT_DMA_TCD[23].CITER)
#define DMA_TCD23_CITER_ELINKYES (IMXRT_DMA_TCD[23].CITER_ELINKYES)
#define DMA_TCD23_CITER_ELINKNO (IMXRT_DMA_TCD[23].CITER_ELINKNO)
#define DMA_TCD23_DLASTSGA (IMXRT_DMA_TCD[23].DLASTSGA)
#define DMA_TCD23_CSR (IMXRT_DMA_TCD[23].CSR)
#define DMA_TCD23_BITER (IMXRT_DMA_TCD[23].BITER)
#define DMA_TCD23_BITER_ELINKYES (IMXRT_DMA_TCD[23].BITER_ELINKYES)
#define DMA_TCD23_BITER_ELINKNO (IMXRT_DMA_TCD[23].BITER_ELINKNO)

