gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
#define DMA_TCD24_SADDR (IMXRT_DMA_TCD[24].SADDR)
#define DMA_TCD24_SOFF (IMXRT_DMA_TCD[24].SOFF)
#define DMA_TCD24_ATTR (IMXRT_DMA_TCD[24].ATTR)
#define DMA_TCD24_NBYTES (IMXRT_DMA_TCD[24].NBYTES)
#define DMA_TCD24_NBYTES_MLNO (IMXRT_DMA_TCD[24].NBYTES_MLNO)
#define DMA_TCD24_NBYTES_MLOFFNO (IMXRT_DMA_TCD[24].NBYTES_MLOFFNO)
#define DMA_TCD24_NBYTES_MLOFFYES (IMXRT_DMA_TCD[24].NBYTES_MLOFFYES)
#define DMA_TCD24_SLAST (IMXRT_DMA_TCD[24].SLAST)
#define DMA_TCD24_DADDR (IMXRT_DMA_TCD[24].DADDR)
#define DMA_TCD24_DOFF (IMXRT_DMA_TCD[24].DOFF)
#define DMA_TCD24_CITER (IMXRT_DMA_TCD[24].CITER)
#define DMA_TCD24_CITER_ELINKYES (IMXRT_DMA_TCD[24].CITER_ELINKYES)
#define DMA_TCD24_CITER_ELINKNO (IMXRT_DMA_TCD[24].CITER_ELINKNO)
#define DMA_TCD24_DLASTSGA (IMXRT_DMA_TCD[24].DLASTSGA)
#define DMA_TCD24_CSR (IMXRT_DMA_TCD[24].CSR)
#define DMA_TCD24_BITER (IMXRT_DMA_TCD[24].BITER)
#define DMA_TCD24_BITER_ELINKYES (IMXRT_DMA_TCD[24].BITER_ELINKYES)
#define DMA_TCD24_BITER_ELINKNO (IMXRT_DMA_TCD[24].BITER_ELINKNO)

#define DMA_TCD25_SADDR (IMXRT_DMA_TCD[25].SADDR)
#define DMA_TCD25_SOFF (IMXRT_DMA_TCD[25].SOFF)
#define DMA_TCD25_ATTR (IMXRT_DMA_TCD[25].ATTR)
#define DMA_TCD25_NBYTES (IMXRT_DMA_TCD[25].NBYTES)
#define DMA_TCD25_NBYTES_MLNO (IMXRT_DMA_TCD[25].NBYTES_MLNO)
#define DMA_TCD25_NBYTES_MLOFFNO (IMXRT_DMA_TCD[25].NBYTES_MLOFFNO)
#define DMA_TCD25_NBYTES_MLOFFYES (IMXRT_DMA_TCD[25].NBYTES_MLOFFYES)
#define DMA_TCD25_SLAST (IMXRT_DMA_TCD[25].SLAST)
#define DMA_TCD25_DADDR (IMXRT_DMA_TCD[25].DADDR)
#define DMA_TCD25_DOFF (IMXRT_DMA_TCD[25].DOFF)
#define DMA_TCD25_CITER (IMXRT_DMA_TCD[25].CITER)
#define DMA_TCD25_CITER_ELINKYES (IMXRT_DMA_TCD[25].CITER_ELINKYES)
#define DMA_TCD25_CITER_ELINKNO (IMXRT_DMA_TCD[25].CITER_ELINKNO)
#define DMA_TCD25_DLASTSGA (IMXRT_DMA_TCD[25].DLASTSGA)
#define DMA_TCD25_CSR (IMXRT_DMA_TCD[25].CSR)
#define DMA_TCD25_BITER (IMXRT_DMA_TCD[25].BITER)
#define DMA_TCD25_BITER_ELINKYES (IMXRT_DMA_TCD[25].BITER_ELINKYES)
#define DMA_TCD25_BITER_ELINKNO (IMXRT_DMA_TCD[25].BITER_ELINKNO)

#define DMA_TCD26_SADDR (IMXRT_DMA_TCD[26].SADDR)
#define DMA_TCD26_SOFF (IMXRT_DMA_TCD[26].SOFF)
#define DMA_TCD26_ATTR (IMXRT_DMA_TCD[26].ATTR)
#define DMA_TCD26_NBYTES (IMXRT_DMA_TCD[26].NBYTES)
#define DMA_TCD26_NBYTES_MLNO (IMXRT_DMA_TCD[26].NBYTES_MLNO)
#define DMA_TCD26_NBYTES_MLOFFNO (IMXRT_DMA_TCD[26].NBYTES_MLOFFNO)
#define DMA_TCD26_NBYTES_MLOFFYES (IMXRT_DMA_TCD[26].NBYTES_MLOFFYES)
#define DMA_TCD26_SLAST (IMXRT_DMA_TCD[26].SLAST)
#define DMA_TCD26_DADDR (IMXRT_DMA_TCD[26].DADDR)
#define DMA_TCD26_DOFF (IMXRT_DMA_TCD[26].DOFF)
#define DMA_TCD26_CITER (IMXRT_DMA_TCD[26].CITER)
#define DMA_TCD26_CITER_ELINKYES (IMXRT_DMA_TCD[26].CITER_ELINKYES)
#define DMA_TCD26_CITER_ELINKNO (IMXRT_DMA_TCD[26].CITER_ELINKNO)
#define DMA_TCD26_DLASTSGA (IMXRT_DMA_TCD[26].DLASTSGA)
#define DMA_TCD26_CSR (IMXRT_DMA_TCD[26].CSR)
#define DMA_TCD26_BITER (IMXRT_DMA_TCD[26].BITER)
#define DMA_TCD26_BITER_ELINKYES (IMXRT_DMA_TCD[26].BITER_ELINKYES)
#define DMA_TCD26_BITER_ELINKNO (IMXRT_DMA_TCD[26].BITER_ELINKNO)

#define DMA_TCD27_SADDR (IMXRT_DMA_TCD[27].SADDR)
#define DMA_TCD27_SOFF (IMXRT_DMA_TCD[27].SOFF)
#define DMA_TCD27_ATTR (IMXRT_DMA_TCD[27].ATTR)
#define DMA_TCD27_NBYTES (IMXRT_DMA_TCD[27].NBYTES)
#define DMA_TCD27_NBYTES_MLNO (IMXRT_DMA_TCD[27].NBYTES_MLNO)
#define DMA_TCD27_NBYTES_MLOFFNO (IMXRT_DMA_TCD[27].NBYTES_MLOFFNO)
#define DMA_TCD27_NBYTES_MLOFFYES (IMXRT_DMA_TCD[27].NBYTES_MLOFFYES)
#define DMA_TCD27_SLAST (IMXRT_DMA_TCD[27].SLAST)
#define DMA_TCD27_DADDR (IMXRT_DMA_TCD[27].DADDR)
#define DMA_TCD27_DOFF (IMXRT_DMA_TCD[27].DOFF)
#define DMA_TCD27_CITER (IMXRT_DMA_TCD[27].CITER)
#define DMA_TCD27_CITER_ELINKYES (IMXRT_DMA_TCD[27].CITER_ELINKYES)
#define DMA_TCD27_CITER_ELINKNO (IMXRT_DMA_TCD[27].CITER_ELINKNO)
#define DMA_TCD27_DLASTSGA (IMXRT_DMA_TCD[27].DLASTSGA)
#define DMA_TCD27_CSR (IMXRT_DMA_TCD[27].CSR)
#define DMA_TCD27_BITER (IMXRT_DMA_TCD[27].BITER)
#define DMA_TCD27_BITER_ELINKYES (IMXRT_DMA_TCD[27].BITER_ELINKYES)
#define DMA_TCD27_BITER_ELINKNO (IMXRT_DMA_TCD[27].BITER_ELINKNO)

#define DMA_TCD28_SADDR (IMXRT_DMA_TCD[28].SADDR)
#define DMA_TCD28_SOFF (IMXRT_DMA_TCD[28].SOFF)
#define DMA_TCD28_ATTR (IMXRT_DMA_TCD[28].ATTR)
#define DMA_TCD28_NBYTES (IMXRT_DMA_TCD[28].NBYTES)
#define DMA_TCD28_NBYTES_MLNO (IMXRT_DMA_TCD[28].NBYTES_MLNO)
#define DMA_TCD28_NBYTES_MLOFFNO (IMXRT_DMA_TCD[28].NBYTES_MLOFFNO)
#define DMA_TCD28_NBYTES_MLOFFYES (IMXRT_DMA_TCD[28].NBYTES_MLOFFYES)
#define DMA_TCD28_SLAST (IMXRT_DMA_TCD[28].SLAST)
#define DMA_TCD28_DADDR (IMXRT_DMA_TCD[28].DADDR)
#define DMA_TCD28_DOFF (IMXRT_DMA_TCD[28].DOFF)
#define DMA_TCD28_CITER (IMXRT_DMA_TCD[28].CITER)
#define DMA_TCD28_CITER_ELINKYES (IMXRT_DMA_TCD[28].CITER_ELINKYES)
#define DMA_TCD28_CITER_ELINKNO (IMXRT_DMA_TCD[28].CITER_ELINKNO)
#define DMA_TCD28_DLASTSGA (IMXRT_DMA_TCD[28].DLASTSGA)
#define DMA_TCD28_CSR (IMXRT_DMA_TCD[28].CSR)
#define DMA_TCD28_BITER (IMXRT_DMA_TCD[28].BITER)
#define DMA_TCD28_BITER_ELINKYES (IMXRT_DMA_TCD[28].BITER_ELINKYES)
#define DMA_TCD28_BITER_ELINKNO (IMXRT_DMA_TCD[28].BITER_ELINKNO)

#define DMA_TCD29_SADDR (IMXRT_DMA_TCD[29].SADDR)
#define DMA_TCD29_SOFF (IMXRT_DMA_TCD[29].SOFF)
#define DMA_TCD29_ATTR (IMXRT_DMA_TCD[29].ATTR)
#define DMA_TCD29_NBYTES (IMXRT_DMA_TCD[29].NBYTES)
#define DMA_TCD29_NBYTES_MLNO (IMXRT_DMA_TCD[29].NBYTES_MLNO)
#define DMA_TCD29_NBYTES_MLOFFNO (IMXRT_DMA_TCD[29].NBYTES_MLOFFNO)
#define DMA_TCD29_NBYTES_MLOFFYES (IMXRT_DMA_TCD[29].NBYTES_MLOFFYES)
#define DMA_TCD29_SLAST (IMXRT_DMA_TCD[29].SLAST)
#define DMA_TCD29_DADDR (IMXRT_DMA_TCD[29].DADDR)
#define DMA_TCD29_DOFF (IMXRT_DMA_TCD[29].DOFF)
#define DMA_TCD29_CITER (IMXRT_DMA_TCD[29].CITER)
#define DMA_TCD29_CITER_ELINKYES (IMXRT_DMA_TCD[29].CITER_ELINKYES)
#define DMA_TCD29_CITER_ELINKNO (IMXRT_DMA_TCD[29].CITER_ELINKNO)
#define DMA_TCD29_DLASTSGA (IMXRT_DMA_TCD[29].DLASTSGA)
#define DMA_TCD29_CSR (IMXRT_DMA_TCD[29].CSR)
#define DMA_TCD29_BITER (IMXRT_DMA_TCD[29].BITER)
#define DMA_TCD29_BITER_ELINKYES (IMXRT_DMA_TCD[29].BITER_ELINKYES)
#define DMA_TCD29_BITER_ELINKNO (IMXRT_DMA_TCD[29].BITER_ELINKNO)

