gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
#define DMA_TCD30_SADDR (IMXRT_DMA_TCD[30].SADDR)
#define DMA_TCD30_SOFF (IMXRT_DMA_TCD[30].SOFF)
#define DMA_TCD30_ATTR (IMXRT_DMA_TCD[30].ATTR)
#define DMA_TCD30_NBYTES (IMXRT_DMA_TCD[30].NBYTES)
#define DMA_TCD30_NBYTES_MLNO (IMXRT_DMA_TCD[30].NBYTES_MLNO)
#define DMA_TCD30_NBYTES_MLOFFNO (IMXRT_DMA_TCD[30].NBYTES_MLOFFNO)
#define DMA_TCD30_NBYTES_MLOFFYES (IMXRT_DMA_TCD[30].NBYTES_MLOFFYES)
#define DMA_TCD30_SLAST (IMXRT_DMA_TCD[30].SLAST)
#define DMA_TCD30_DADDR (IMXRT_DMA_TCD[30].DADDR)
#define DMA_TCD30_DOFF (IMXRT_DMA_TCD[30].DOFF)
#define DMA_TCD30_CITER (IMXRT_DMA_TCD[30].CITER)
#define DMA_TCD30_CITER_ELINKYES (IMXRT_DMA_TCD[30].CITER_ELINKYES)
#define DMA_TCD30_CITER_ELINKNO (IMXRT_DMA_TCD[30].CITER_ELINKNO)
#define DMA_TCD30_DLASTSGA (IMXRT_DMA_TCD[30].DLASTSGA)
#define DMA_TCD30_CSR (IMXRT_DMA_TCD[30].CSR)
#define DMA_TCD30_BITER (IMXRT_DMA_TCD[30].BITER)
#define DMA_TCD30_BITER_ELINKYES (IMXRT_DMA_TCD[30].BITER_ELINKYES)
#define DMA_TCD30_BITER_ELINKNO (IMXRT_DMA_TCD[30].BITER_ELINKNO)

#define DMA_TCD31_SADDR (IMXRT_DMA_TCD[31].SADDR)
#define DMA_TCD31_SOFF (IMXRT_DMA_TCD[31].SOFF)
#define DMA_TCD31_ATTR (IMXRT_DMA_TCD[31].ATTR)
#define DMA_TCD31_NBYTES (IMXRT_DMA_TCD[31].NBYTES)
#define DMA_TCD31_NBYTES_MLNO (IMXRT_DMA_TCD[31].NBYTES_MLNO)
#define DMA_TCD31_NBYTES_MLOFFNO (IMXRT_DMA_TCD[31].NBYTES_MLOFFNO)
#define DMA_TCD31_NBYTES_MLOFFYES (IMXRT_DMA_TCD[31].NBYTES_MLOFFYES)
#define DMA_TCD31_SLAST (IMXRT_DMA_TCD[31].SLAST)
#define DMA_TCD31_DADDR (IMXRT_DMA_TCD[31].DADDR)
#define DMA_TCD31_DOFF (IMXRT_DMA_TCD[31].DOFF)
#define DMA_TCD31_CITER (IMXRT_DMA_TCD[31].CITER)
#define DMA_TCD31_CITER_ELINKYES (IMXRT_DMA_TCD[31].CITER_ELINKYES)
#define DMA_TCD31_CITER_ELINKNO (IMXRT_DMA_TCD[31].CITER_ELINKNO)
#define DMA_TCD31_DLASTSGA (IMXRT_DMA_TCD[31].DLASTSGA)
#define DMA_TCD31_CSR (IMXRT_DMA_TCD[31].CSR)
#define DMA_TCD31_BITER (IMXRT_DMA_TCD[31].BITER)
#define DMA_TCD31_BITER_ELINKYES (IMXRT_DMA_TCD[31].BITER_ELINKYES)
#define DMA_TCD31_BITER_ELINKNO (IMXRT_DMA_TCD[31].BITER_ELINKNO)

// TODO: double check these defines from Teensy 3.x are still correct for IMXRT
#define DMA_TCD_ATTR_SMOD(n) (((n)&0x1F) << 11)
#define DMA_TCD_ATTR_SSIZE(n) (((n)&0x7) << 8)
#define DMA_TCD_ATTR_DMOD(n) (((n)&0x1F) << 3)
#define DMA_TCD_ATTR_DSIZE(n) (((n)&0x7) << 0)
#define DMA_TCD_ATTR_SIZE_8BIT 0
#define DMA_TCD_ATTR_SIZE_16BIT 1
#define DMA_TCD_ATTR_SIZE_32BIT 2
#define DMA_TCD_ATTR_SIZE_16BYTE 4
#define DMA_TCD_ATTR_SIZE_32BYTE 5 // caution: this might not be supported in newer chips?
#define DMA_TCD_CSR_BWC(n) (((n)&0x3) << 14)
#define DMA_TCD_CSR_BWC_MASK 0xC000
#define DMA_TCD_CSR_MAJORLINKCH(n) (((n)&0xF) << 8)
#define DMA_TCD_CSR_MAJORLINKCH_MASK 0x0F00
#define DMA_TCD_CSR_DONE 0x0080
#define DMA_TCD_CSR_ACTIVE 0x0040
#define DMA_TCD_CSR_MAJORELINK 0x0020
#define DMA_TCD_CSR_ESG 0x0010
#define DMA_TCD_CSR_DREQ 0x0008
#define DMA_TCD_CSR_INTHALF 0x0004
#define DMA_TCD_CSR_INTMAJOR 0x0002
#define DMA_TCD_CSR_START 0x0001
#define DMA_TCD_CITER_MASK ((uint16_t)0x7FFF)   // Loop count mask
#define DMA_TCD_CITER_ELINK ((uint16_t)1 << 15) // Enable channel linking on minor-loop complete
#define DMA_TCD_BITER_MASK ((uint16_t)0x7FFF)   // Loop count mask
#define DMA_TCD_BITER_ELINK ((uint16_t)1 << 15) // Enable channel linking on minor-loop complete
#define DMA_TCD_BITER_ELINKYES_ELINK 0x8000
#define DMA_TCD_BITER_ELINKYES_LINKCH(n) (((n)&0xF) << 9)
#define DMA_TCD_BITER_ELINKYES_LINKCH_MASK 0x1E00
#define DMA_TCD_BITER_ELINKYES_BITER(n) (((n)&0x1FF) << 0)
#define DMA_TCD_BITER_ELINKYES_BITER_MASK 0x01FF
#define DMA_TCD_CITER_ELINKYES_ELINK 0x8000
#define DMA_TCD_CITER_ELINKYES_LINKCH(n) (((n)&0xF) << 9)
#define DMA_TCD_CITER_ELINKYES_LINKCH_MASK 0x1E00
#define DMA_TCD_CITER_ELINKYES_CITER(n) (((n)&0x1FF) << 0)
#define DMA_TCD_CITER_ELINKYES_CITER_MASK 0x01FF
#define DMA_TCD_NBYTES_SMLOE ((uint32_t)1 << 31)                         // Source Minor Loop Offset Enable
#define DMA_TCD_NBYTES_DMLOE ((uint32_t)1 << 30)                         // Destination Minor Loop Offset Enable
#define DMA_TCD_NBYTES_MLOFFNO_NBYTES(n) ((uint32_t)((n)&0x3FFFFFFF))    // NBytes transfer count when minor loop disabled
#define DMA_TCD_NBYTES_MLOFFYES_NBYTES(n) ((uint32_t)((n)&0x3FF))        // NBytes transfer count when minor loop enabled
#define DMA_TCD_NBYTES_MLOFFYES_MLOFF(n) ((uint32_t)((n)&0xFFFFF) << 10) // Minor loop offset

// 23.7.1: page 1023
#define IMXRT_ENC1 (*(IMXRT_REGISTER16_t *)0x403C8000)
#define ENC1_CTRL (IMXRT_ENC1.offset000)
#define ENC1_FILT (IMXRT_ENC1.offset002)
#define ENC1_WTR (IMXRT_ENC1.offset004)
#define ENC1_POSD (IMXRT_ENC1.offset006)
#define ENC1_POSDH (IMXRT_ENC1.offset008)
#define ENC1_REV (IMXRT_ENC1.offset00A)
#define ENC1_REVH (IMXRT_ENC1.offset00C)
#define ENC1_UPOS (IMXRT_ENC1.offset00E)
#define ENC1_LPOS (IMXRT_ENC1.offset010)
#define ENC1_UPOSH (IMXRT_ENC1.offset012)
#define ENC1_LPOSH (IMXRT_ENC1.offset014)
#define ENC1_UINIT (IMXRT_ENC1.offset016)
#define ENC1_LINIT (IMXRT_ENC1.offset018)
#define ENC1_IMR (IMXRT_ENC1.offset01A)
#define ENC1_TST (IMXRT_ENC1.offset01C)
#define ENC1_CTRL2 (IMXRT_ENC1.offset01E)
#define ENC1_UMOD (IMXRT_ENC1.offset020)
#define ENC1_LMOD (IMXRT_ENC1.offset022)
#define ENC1_UCOMP (IMXRT_ENC1.offset024)
#define ENC1_LCOMP (IMXRT_ENC1.offset026)
#define IMXRT_ENC2 (*(IMXRT_REGISTER16_t *)0x403CC000)
#define ENC2_CTRL (IMXRT_ENC2.offset000)
#define ENC2_FILT (IMXRT_ENC2.offset002)
#define ENC2_WTR (IMXRT_ENC2.offset004)
#define ENC2_POSD (IMXRT_ENC2.offset006)
#define ENC2_POSDH (IMXRT_ENC2.offset008)
#define ENC2_REV (IMXRT_ENC2.offset00A)
#define ENC2_REVH (IMXRT_ENC2.offset00C)
#define ENC2_UPOS (IMXRT_ENC2.offset00E)
#define ENC2_LPOS (IMXRT_ENC2.offset010)
#define ENC2_UPOSH (IMXRT_ENC2.offset012)
#define ENC2_LPOSH (IMXRT_ENC2.offset014)
#define ENC2_UINIT (IMXRT_ENC2.offset016)
#define ENC2_LINIT (IMXRT_ENC2.offset018)
#define ENC2_IMR (IMXRT_ENC2.offset01A)
#define ENC2_TST (IMXRT_ENC2.offset01C)
#define ENC2_CTRL2 (IMXRT_ENC2.offset01E)
#define ENC2_UMOD (IMXRT_ENC2.offset020)
#define ENC2_LMOD (IMXRT_ENC2.offset022)
#define ENC2_UCOMP (IMXRT_ENC2.offset024)
#define ENC2_LCOMP (IMXRT_ENC2.offset026)
#define IMXRT_ENC3 (*(IMXRT_REGISTER16_t *)0x403D0000)
#define ENC3_CTRL (IMXRT_ENC3.offset000)
#define ENC3_FILT (IMXRT_ENC3.offset002)
#define ENC3_WTR (IMXRT_ENC3.offset004)
#define ENC3_POSD (IMXRT_ENC3.offset006)
#define ENC3_POSDH (IMXRT_ENC3.offset008)
#define ENC3_REV (IMXRT_ENC3.offset00A)
#define ENC3_REVH (IMXRT_ENC3.offset00C)
#define ENC3_UPOS (IMXRT_ENC3.offset00E)
#define ENC3_LPOS (IMXRT_ENC3.offset010)
#define ENC3_UPOSH (IMXRT_ENC3.offset012)
#define ENC3_LPOSH (IMXRT_ENC3.offset014)
#define ENC3_UINIT (IMXRT_ENC3.offset016)
#define ENC3_LINIT (IMXRT_ENC3.offset018)
#define ENC3_IMR (IMXRT_ENC3.offset01A)
#define ENC3_TST (IMXRT_ENC3.offset01C)
#define ENC3_CTRL2 (IMXRT_ENC3.offset01E)
#define ENC3_UMOD (IMXRT_ENC3.offset020)
#define ENC3_LMOD (IMXRT_ENC3.offset022)
#define ENC3_UCOMP (IMXRT_ENC3.offset024)
#define ENC3_LCOMP (IMXRT_ENC3.offset026)
#define IMXRT_ENC4 (*(IMXRT_REGISTER16_t *)0x403D4000)
#define ENC4_CTRL (IMXRT_ENC4.offset000)
#define ENC4_FILT (IMXRT_ENC4.offset002)
#define ENC4_WTR (IMXRT_ENC4.offset004)
#define ENC4_POSD (IMXRT_ENC4.offset006)
#define ENC4_POSDH (IMXRT_ENC4.offset008)
#define ENC4_REV (IMXRT_ENC4.offset00A)
#define ENC4_REVH (IMXRT_ENC4.offset00C)
#define ENC4_UPOS (IMXRT_ENC4.offset00E)
#define ENC4_LPOS (IMXRT_ENC4.offset010)
#define ENC4_UPOSH (IMXRT_ENC4.offset012)
#define ENC4_LPOSH (IMXRT_ENC4.offset014)
#define ENC4_UINIT (IMXRT_ENC4.offset016)
#define ENC4_LINIT (IMXRT_ENC4.offset018)
#define ENC4_IMR (IMXRT_ENC4.offset01A)
#define ENC4_TST (IMXRT_ENC4.offset01C)
#define ENC4_CTRL2 (IMXRT_ENC4.offset01E)
#define ENC4_UMOD (IMXRT_ENC4.offset020)
#define ENC4_LMOD (IMXRT_ENC4.offset022)
#define ENC4_UCOMP (IMXRT_ENC4.offset024)
#define ENC4_LCOMP (IMXRT_ENC4.offset026)

// 24.5: page 1060
#define IMXRT_ENET (*(IMXRT_REGISTER32_t *)0x402D8000)
#define IMXRT_ENET_TIMER (*(IMXRT_REGISTER32_t *)0x402D8400)
#define ENET_EIR (IMXRT_ENET.offset004)
#define ENET_EIMR (IMXRT_ENET.offset008)
#define ENET_RDAR (IMXRT_ENET.offset010)
#define ENET_TDAR (IMXRT_ENET.offset014)
#define ENET_ECR (IMXRT_ENET.offset024)
#define ENET_MMFR (IMXRT_ENET.offset040)
#define ENET_MSCR (IMXRT_ENET.offset044)
#define ENET_MIBC (IMXRT_ENET.offset064)
#define ENET_RCR (IMXRT_ENET.offset084)
#define ENET_TCR (IMXRT_ENET.offset0C4)
#define ENET_PALR (IMXRT_ENET.offset0E4)
#define ENET_PAUR (IMXRT_ENET.offset0E8)
#define ENET_OPD (IMXRT_ENET.offset0EC)
#define ENET_TXIC (IMXRT_ENET.offset0F0)
#define ENET_RXIC (IMXRT_ENET.offset100)
#define ENET_IAUR (IMXRT_ENET.offset118)
#define ENET_IALR (IMXRT_ENET.offset11C)
#define ENET_GAUR (IMXRT_ENET.offset120)
#define ENET_GALR (IMXRT_ENET.offset124)
#define ENET_TFWR (IMXRT_ENET.offset144)
#define ENET_RDSR (IMXRT_ENET.offset180)
#define ENET_TDSR (IMXRT_ENET.offset184)
#define ENET_MRBR (IMXRT_ENET.offset188)
#define ENET_RSFL (IMXRT_ENET.offset190)
#define ENET_RSEM (IMXRT_ENET.offset194)
#define ENET_RAEM (IMXRT_ENET.offset198)
#define ENET_RAFL (IMXRT_ENET.offset19C)
#define ENET_TSEM (IMXRT_ENET.offset1A0)
#define ENET_TAEM (IMXRT_ENET.offset1A4)
#define ENET_TAFL (IMXRT_ENET.offset1A8)
#define ENET_TIPG (IMXRT_ENET.offset1AC)
#define ENET_FTRL (IMXRT_ENET.offset1B0)
#define ENET_TACC (IMXRT_ENET.offset1C0)
#define ENET_RACC (IMXRT_ENET.offset1C4)
#define ENET_RMON_T_DROP (IMXRT_ENET.offset200)
#define ENET_RMON_T_PACKETS (IMXRT_ENET.offset204)
#define ENET_RMON_T_BC_PKT (IMXRT_ENET.offset208)
#define ENET_RMON_T_MC_PKT (IMXRT_ENET.offset20C)
#define ENET_RMON_T_CRC_ALIGN (IMXRT_ENET.offset210)
#define ENET_RMON_T_UNDERSIZE (IMXRT_ENET.offset214)
#define ENET_RMON_T_OVERSIZE (IMXRT_ENET.offset218)
#define ENET_RMON_T_FRAG (IMXRT_ENET.offset21C)
#define ENET_RMON_T_JAB (IMXRT_ENET.offset220)
#define ENET_RMON_T_COL (IMXRT_ENET.offset224)
#define ENET_RMON_T_P64 (IMXRT_ENET.offset228)
#define ENET_RMON_T_P65TO127 (IMXRT_ENET.offset22C)
#define ENET_RMON_T_P128TO255 (IMXRT_ENET.offset230)
#define ENET_RMON_T_P256TO511 (IMXRT_ENET.offset234)
#define ENET_RMON_T_P512TO1023 (IMXRT_ENET.offset238)
#define ENET_RMON_T_P1024TO2047 (IMXRT_ENET.offset23C)
#define ENET_RMON_T_P_GTE2048 (IMXRT_ENET.offset240)
#define ENET_RMON_T_OCTETS (IMXRT_ENET.offset244)
#define ENET_IEEE_T_DROP (IMXRT_ENET.offset248)
#define ENET_IEEE_T_FRAME_OK (IMXRT_ENET.offset24C)
#define ENET_IEEE_T_1COL (IMXRT_ENET.offset250)
#define ENET_IEEE_T_MCOL (IMXRT_ENET.offset254)
#define ENET_IEEE_T_DEF (IMXRT_ENET.offset258)
#define ENET_IEEE_T_LCOL (IMXRT_ENET.offset25C)
#define ENET_IEEE_T_EXCOL (IMXRT_ENET.offset260)
#define ENET_IEEE_T_MACERR (IMXRT_ENET.offset264)
#define ENET_IEEE_T_CSERR (IMXRT_ENET.offset268)
#define ENET_IEEE_T_SQE (IMXRT_ENET.offset26C)
#define ENET_IEEE_T_FDXFC (IMXRT_ENET.offset270)
#define ENET_IEEE_T_OCTETS_OK (IMXRT_ENET.offset274)
#define ENET_RMON_R_PACKETS (IMXRT_ENET.offset284)
#define ENET_RMON_R_BC_PKT (IMXRT_ENET.offset288)
#define ENET_RMON_R_MC_PKT (IMXRT_ENET.offset28C)
#define ENET_RMON_R_CRC_ALIGN (IMXRT_ENET.offset290)
#define ENET_RMON_R_UNDERSIZE (IMXRT_ENET.offset294)
#define ENET_RMON_R_OVERSIZE (IMXRT_ENET.offset298)
#define ENET_RMON_R_FRAG (IMXRT_ENET.offset29C)
#define ENET_RMON_R_JAB (IMXRT_ENET.offset2A0)
#define ENET_RMON_R_RESVD_0 (IMXRT_ENET.offset2A4)
#define ENET_RMON_R_P64 (IMXRT_ENET.offset2A8)
#define ENET_RMON_R_P65TO127 (IMXRT_ENET.offset2AC)
#define ENET_RMON_R_P128TO255 (IMXRT_ENET.offset2B0)
#define ENET_RMON_R_P256TO511 (IMXRT_ENET.offset2B4)
#define ENET_RMON_R_P512TO1023 (IMXRT_ENET.offset2B8)
#define ENET_RMON_R_P1024TO2047 (IMXRT_ENET.offset2BC)
#define ENET_RMON_R_P_GTE2048 (IMXRT_ENET.offset2C0)
#define ENET_RMON_R_OCTETS (IMXRT_ENET.offset2C4)
#define ENET_IEEE_R_DROP (IMXRT_ENET.offset2C8)
#define ENET_IEEE_R_FRAME_OK (IMXRT_ENET.offset2CC)
#define ENET_IEEE_R_CRC (IMXRT_ENET.offset2D0)
#define ENET_IEEE_R_ALIGN (IMXRT_ENET.offset2D4)
#define ENET_IEEE_R_MACERR (IMXRT_ENET.offset2D8)
#define ENET_IEEE_R_FDXFC (IMXRT_ENET.offset2DC)
#define ENET_IEEE_R_OCTETS_OK (IMXRT_ENET.offset2E0)
#define ENET_ATCR (IMXRT_ENET_TIMER.offset000)
#define ENET_ATVR (IMXRT_ENET_TIMER.offset004)
#define ENET_ATOFF (IMXRT_ENET_TIMER.offset008)
#define ENET_ATPER (IMXRT_ENET_TIMER.offset00C)
#define ENET_ATCOR (IMXRT_ENET_TIMER.offset010)
#define ENET_ATINC (IMXRT_ENET_TIMER.offset014)
#define ENET_ATSTMP (IMXRT_ENET_TIMER.offset018)
#define ENET_TGSR (IMXRT_ENET_TIMER.offset204)
#define ENET_TCSR0 (IMXRT_ENET_TIMER.offset208)
#define ENET_TCCR0 (IMXRT_ENET_TIMER.offset20C)
#define ENET_TCSR1 (IMXRT_ENET_TIMER.offset210)
#define ENET_TCCR1 (IMXRT_ENET_TIMER.offset214)
#define ENET_TCSR2 (IMXRT_ENET_TIMER.offset218)
#define ENET_TCCR2 (IMXRT_ENET_TIMER.offset21C)
#define ENET_TCSR3 (IMXRT_ENET_TIMER.offset220)
#define ENET_TCCR3 (IMXRT_ENET_TIMER.offset224)

#define IMXRT_ENET2 (*(IMXRT_REGISTER32_t *)0x402D4000)
#define IMXRT_ENET2_TIMER (*(IMXRT_REGISTER32_t *)0x402D4400)
#define ENET2_EIR (IMXRT_ENET2.offset004)
#define ENET2_EIMR (IMXRT_ENET2.offset008)
#define ENET2_RDAR (IMXRT_ENET2.offset010)
#define ENET2_TDAR (IMXRT_ENET2.offset014)
#define ENET2_ECR (IMXRT_ENET2.offset024)
#define ENET2_MMFR (IMXRT_ENET2.offset040)
#define ENET2_MSCR (IMXRT_ENET2.offset044)
#define ENET2_MIBC (IMXRT_ENET2.offset064)
#define ENET2_RCR (IMXRT_ENET2.offset084)
#define ENET2_TCR (IMXRT_ENET2.offset0C4)
#define ENET2_PALR (IMXRT_ENET2.offset0E4)
#define ENET2_PAUR (IMXRT_ENET2.offset0E8)
#define ENET2_OPD (IMXRT_ENET2.offset0EC)
#define ENET2_TXIC (IMXRT_ENET2.offset0F0)
#define ENET2_RXIC (IMXRT_ENET2.offset100)
#define ENET2_IAUR (IMXRT_ENET2.offset118)
#define ENET2_IALR (IMXRT_ENET2.offset11C)
#define ENET2_GAUR (IMXRT_ENET2.offset120)
#define ENET2_GALR (IMXRT_ENET2.offset124)
#define ENET2_TFWR (IMXRT_ENET2.offset144)
#define ENET2_RDSR (IMXRT_ENET2.offset180)
#define ENET2_TDSR (IMXRT_ENET2.offset184)
#define ENET2_MRBR (IMXRT_ENET2.offset188)
#define ENET2_RSFL (IMXRT_ENET2.offset190)
#define ENET2_RSEM (IMXRT_ENET2.offset194)
#define ENET2_RAEM (IMXRT_ENET2.offset198)
#define ENET2_RAFL (IMXRT_ENET2.offset19C)
#define ENET2_TSEM (IMXRT_ENET2.offset1A0)
#define ENET2_TAEM (IMXRT_ENET2.offset1A4)
#define ENET2_TAFL (IMXRT_ENET2.offset1A8)
#define ENET2_TIPG (IMXRT_ENET2.offset1AC)
#define ENET2_FTRL (IMXRT_ENET2.offset1B0)
#define ENET2_TACC (IMXRT_ENET2.offset1C0)
#define ENET2_RACC (IMXRT_ENET2.offset1C4)
#define ENET2_RMON_T_DROP (IMXRT_ENET2.offset200)
#define ENET2_RMON_T_PACKETS (IMXRT_ENET2.offset204)
#define ENET2_RMON_T_BC_PKT (IMXRT_ENET2.offset208)
#define ENET2_RMON_T_MC_PKT (IMXRT_ENET2.offset20C)
#define ENET2_RMON_T_CRC_ALIGN (IMXRT_ENET2.offset210)
#define ENET2_RMON_T_UNDERSIZE (IMXRT_ENET2.offset214)
#define ENET2_RMON_T_OVERSIZE (IMXRT_ENET2.offset218)
#define ENET2_RMON_T_FRAG (IMXRT_ENET2.offset21C)
#define ENET2_RMON_T_JAB (IMXRT_ENET2.offset220)
#define ENET2_RMON_T_COL (IMXRT_ENET2.offset224)
#define ENET2_RMON_T_P64 (IMXRT_ENET2.offset228)
#define ENET2_RMON_T_P65TO127 (IMXRT_ENET2.offset22C)
#define ENET2_RMON_T_P128TO255 (IMXRT_ENET2.offset230)
#define ENET2_RMON_T_P256TO511 (IMXRT_ENET2.offset234)
#define ENET2_RMON_T_P512TO1023 (IMXRT_ENET2.offset238)
#define ENET2_RMON_T_P1024TO2047 (IMXRT_ENET2.offset23C)
#define ENET2_RMON_T_P_GTE2048 (IMXRT_ENET2.offset240)
#define ENET2_RMON_T_OCTETS (IMXRT_ENET2.offset244)
#define ENET2_IEEE_T_DROP (IMXRT_ENET2.offset248)
#define ENET2_IEEE_T_FRAME_OK (IMXRT_ENET2.offset24C)
#define ENET2_IEEE_T_1COL (IMXRT_ENET2.offset250)
#define ENET2_IEEE_T_MCOL (IMXRT_ENET2.offset254)
#define ENET2_IEEE_T_DEF (IMXRT_ENET2.offset258)
#define ENET2_IEEE_T_LCOL (IMXRT_ENET2.offset25C)
#define ENET2_IEEE_T_EXCOL (IMXRT_ENET2.offset260)
#define ENET2_IEEE_T_MACERR (IMXRT_ENET2.offset264)
#define ENET2_IEEE_T_CSERR (IMXRT_ENET2.offset268)
#define ENET2_IEEE_T_SQE (IMXRT_ENET2.offset26C)
#define ENET2_IEEE_T_FDXFC (IMXRT_ENET2.offset270)
#define ENET2_IEEE_T_OCTETS_OK (IMXRT_ENET2.offset274)
#define ENET2_RMON_R_PACKETS (IMXRT_ENET2.offset284)
#define ENET2_RMON_R_BC_PKT (IMXRT_ENET2.offset288)
#define ENET2_RMON_R_MC_PKT (IMXRT_ENET2.offset28C)
#define ENET2_RMON_R_CRC_ALIGN (IMXRT_ENET2.offset290)
#define ENET2_RMON_R_UNDERSIZE (IMXRT_ENET2.offset294)
#define ENET2_RMON_R_OVERSIZE (IMXRT_ENET2.offset298)
#define ENET2_RMON_R_FRAG (IMXRT_ENET2.offset29C)
#define ENET2_RMON_R_JAB (IMXRT_ENET2.offset2A0)
#define ENET2_RMON_R_RESVD_0 (IMXRT_ENET2.offset2A4)
#define ENET2_RMON_R_P64 (IMXRT_ENET2.offset2A8)
#define ENET2_RMON_R_P65TO127 (IMXRT_ENET2.offset2AC)
#define ENET2_RMON_R_P128TO255 (IMXRT_ENET2.offset2B0)
#define ENET2_RMON_R_P256TO511 (IMXRT_ENET2.offset2B4)
#define ENET2_RMON_R_P512TO1023 (IMXRT_ENET2.offset2B8)
#define ENET2_RMON_R_P1024TO2047 (IMXRT_ENET2.offset2BC)
#define ENET2_RMON_R_P_GTE2048 (IMXRT_ENET2.offset2C0)
#define ENET2_RMON_R_OCTETS (IMXRT_ENET2.offset2C4)
#define ENET2_IEEE_R_DROP (IMXRT_ENET2.offset2C8)
#define ENET2_IEEE_R_FRAME_OK (IMXRT_ENET2.offset2CC)
#define ENET2_IEEE_R_CRC (IMXRT_ENET2.offset2D0)
#define ENET2_IEEE_R_ALIGN (IMXRT_ENET2.offset2D4)
#define ENET2_IEEE_R_MACERR (IMXRT_ENET2.offset2D8)
#define ENET2_IEEE_R_FDXFC (IMXRT_ENET2.offset2DC)
#define ENET2_IEEE_R_OCTETS_OK (IMXRT_ENET2.offset2E0)
#define ENET2_ATCR (IMXRT_ENET2_TIMER.offset000)
#define ENET2_ATVR (IMXRT_ENET2_TIMER.offset004)
#define ENET2_ATOFF (IMXRT_ENET2_TIMER.offset008)
#define ENET2_ATPER (IMXRT_ENET2_TIMER.offset00C)
#define ENET2_ATCOR (IMXRT_ENET2_TIMER.offset010)
#define ENET2_ATINC (IMXRT_ENET2_TIMER.offset014)
#define ENET2_ATSTMP (IMXRT_ENET2_TIMER.offset018)
#define ENET2_TGSR (IMXRT_ENET2_TIMER.offset204)
#define ENET2_TCSR0 (IMXRT_ENET2_TIMER.offset208)
#define ENET2_TCCR0 (IMXRT_ENET2_TIMER.offset20C)
#define ENET2_TCSR1 (IMXRT_ENET2_TIMER.offset210)
#define ENET2_TCCR1 (IMXRT_ENET2_TIMER.offset214)
#define ENET2_TCSR2 (IMXRT_ENET2_TIMER.offset218)
#define ENET2_TCCR2 (IMXRT_ENET2_TIMER.offset21C)
#define ENET2_TCSR3 (IMXRT_ENET2_TIMER.offset220)
#define ENET2_TCCR3 (IMXRT_ENET2_TIMER.offset224)

// 25.3.1.1: page 1199
#define IMXRT_EWM (*(IMXRT_REGISTER8_t *)0x402D8000)
#define EWM_CTRL (IMXRT_EWM.offset00)
#define EWM_SERV (IMXRT_EWM.offset01)
#define EWM_CMPL (IMXRT_EWM.offset02)
#define EWM_CMPH (IMXRT_EWM.offset03)
#define EWM_CLKCTRL (IMXRT_EWM.offset04)
#define EWM_CLKPRESCALER (IMXRT_EWM.offset05)

