gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
// 26.8: page 1249
#define IMXRT_FLEXCAN1 (*(IMXRT_REGISTER32_t *)0x401D0000)
#define IMXRT_FLEXCAN1_MASK (*(IMXRT_REGISTER32_t *)0x401D0800)
#define FLEXCAN1_MCR (IMXRT_FLEXCAN1.offset000)
#define FLEXCAN1_CTRL1 (IMXRT_FLEXCAN1.offset004)
#define FLEXCAN1_TIMER (IMXRT_FLEXCAN1.offset008)
#define FLEXCAN1_RXMGMASK (IMXRT_FLEXCAN1.offset010)
#define FLEXCAN1_RX14MASK (IMXRT_FLEXCAN1.offset014)
#define FLEXCAN1_RX15MASK (IMXRT_FLEXCAN1.offset018)
#define FLEXCAN1_ECR (IMXRT_FLEXCAN1.offset01C)
#define FLEXCAN1_ESR1 (IMXRT_FLEXCAN1.offset020)
#define FLEXCAN1_IMASK2 (IMXRT_FLEXCAN1.offset024)
#define FLEXCAN1_IMASK1 (IMXRT_FLEXCAN1.offset028)
#define FLEXCAN1_IFLAG2 (IMXRT_FLEXCAN1.offset02C)
#define FLEXCAN1_IFLAG1 (IMXRT_FLEXCAN1.offset030)
#define FLEXCAN1_CTRL2 (IMXRT_FLEXCAN1.offset034)
#define FLEXCAN1_ESR2 (IMXRT_FLEXCAN1.offset038)
#define FLEXCAN1_CRCR (IMXRT_FLEXCAN1.offset044)
#define FLEXCAN1_RXFGMASK (IMXRT_FLEXCAN1.offset048)
#define FLEXCAN1_RXFIR (IMXRT_FLEXCAN1.offset04C)
#define FLEXCAN1_RXIMR0 (IMXRT_FLEXCAN1_MASK.offset080)
#define FLEXCAN1_RXIMR1 (IMXRT_FLEXCAN1_MASK.offset084)
#define FLEXCAN1_RXIMR2 (IMXRT_FLEXCAN1_MASK.offset088)
#define FLEXCAN1_RXIMR3 (IMXRT_FLEXCAN1_MASK.offset08C)
#define FLEXCAN1_RXIMR4 (IMXRT_FLEXCAN1_MASK.offset090)
#define FLEXCAN1_RXIMR5 (IMXRT_FLEXCAN1_MASK.offset094)
#define FLEXCAN1_RXIMR6 (IMXRT_FLEXCAN1_MASK.offset098)
#define FLEXCAN1_RXIMR7 (IMXRT_FLEXCAN1_MASK.offset09C)
#define FLEXCAN1_RXIMR8 (IMXRT_FLEXCAN1_MASK.offset0A0)
#define FLEXCAN1_RXIMR9 (IMXRT_FLEXCAN1_MASK.offset0A4)
#define FLEXCAN1_RXIMR10 (IMXRT_FLEXCAN1_MASK.offset0A8)
#define FLEXCAN1_RXIMR11 (IMXRT_FLEXCAN1_MASK.offset0AC)
#define FLEXCAN1_RXIMR12 (IMXRT_FLEXCAN1_MASK.offset0B0)
#define FLEXCAN1_RXIMR13 (IMXRT_FLEXCAN1_MASK.offset0B4)
#define FLEXCAN1_RXIMR14 (IMXRT_FLEXCAN1_MASK.offset0B8)
#define FLEXCAN1_RXIMR15 (IMXRT_FLEXCAN1_MASK.offset0BC)
#define FLEXCAN1_RXIMR16 (IMXRT_FLEXCAN1_MASK.offset0C0)
#define FLEXCAN1_RXIMR17 (IMXRT_FLEXCAN1_MASK.offset0C4)
#define FLEXCAN1_RXIMR18 (IMXRT_FLEXCAN1_MASK.offset0C8)
#define FLEXCAN1_RXIMR19 (IMXRT_FLEXCAN1_MASK.offset0CC)
#define FLEXCAN1_RXIMR20 (IMXRT_FLEXCAN1_MASK.offset0D0)
#define FLEXCAN1_RXIMR21 (IMXRT_FLEXCAN1_MASK.offset0D4)
#define FLEXCAN1_RXIMR22 (IMXRT_FLEXCAN1_MASK.offset0D8)
#define FLEXCAN1_RXIMR23 (IMXRT_FLEXCAN1_MASK.offset0DC)
#define FLEXCAN1_RXIMR24 (IMXRT_FLEXCAN1_MASK.offset0E0)
#define FLEXCAN1_RXIMR25 (IMXRT_FLEXCAN1_MASK.offset0E4)
#define FLEXCAN1_RXIMR26 (IMXRT_FLEXCAN1_MASK.offset0E8)
#define FLEXCAN1_RXIMR27 (IMXRT_FLEXCAN1_MASK.offset0EC)
#define FLEXCAN1_RXIMR28 (IMXRT_FLEXCAN1_MASK.offset0F0)
#define FLEXCAN1_RXIMR29 (IMXRT_FLEXCAN1_MASK.offset0F4)
#define FLEXCAN1_RXIMR30 (IMXRT_FLEXCAN1_MASK.offset0F8)
#define FLEXCAN1_RXIMR31 (IMXRT_FLEXCAN1_MASK.offset0FC)
#define FLEXCAN1_RXIMR32 (IMXRT_FLEXCAN1_MASK.offset100)
#define FLEXCAN1_RXIMR33 (IMXRT_FLEXCAN1_MASK.offset104)
#define FLEXCAN1_RXIMR34 (IMXRT_FLEXCAN1_MASK.offset108)
#define FLEXCAN1_RXIMR35 (IMXRT_FLEXCAN1_MASK.offset10C)
#define FLEXCAN1_RXIMR36 (IMXRT_FLEXCAN1_MASK.offset110)
#define FLEXCAN1_RXIMR37 (IMXRT_FLEXCAN1_MASK.offset114)
#define FLEXCAN1_RXIMR38 (IMXRT_FLEXCAN1_MASK.offset118)
#define FLEXCAN1_RXIMR39 (IMXRT_FLEXCAN1_MASK.offset11C)
#define FLEXCAN1_RXIMR40 (IMXRT_FLEXCAN1_MASK.offset120)
#define FLEXCAN1_RXIMR41 (IMXRT_FLEXCAN1_MASK.offset124)
#define FLEXCAN1_RXIMR42 (IMXRT_FLEXCAN1_MASK.offset128)
#define FLEXCAN1_RXIMR43 (IMXRT_FLEXCAN1_MASK.offset12C)
#define FLEXCAN1_RXIMR44 (IMXRT_FLEXCAN1_MASK.offset130)
#define FLEXCAN1_RXIMR45 (IMXRT_FLEXCAN1_MASK.offset134)
#define FLEXCAN1_RXIMR46 (IMXRT_FLEXCAN1_MASK.offset138)
#define FLEXCAN1_RXIMR47 (IMXRT_FLEXCAN1_MASK.offset13C)
#define FLEXCAN1_RXIMR48 (IMXRT_FLEXCAN1_MASK.offset140)
#define FLEXCAN1_RXIMR49 (IMXRT_FLEXCAN1_MASK.offset144)
#define FLEXCAN1_RXIMR50 (IMXRT_FLEXCAN1_MASK.offset148)
#define FLEXCAN1_RXIMR51 (IMXRT_FLEXCAN1_MASK.offset14C)
#define FLEXCAN1_RXIMR52 (IMXRT_FLEXCAN1_MASK.offset150)
#define FLEXCAN1_RXIMR53 (IMXRT_FLEXCAN1_MASK.offset154)
#define FLEXCAN1_RXIMR54 (IMXRT_FLEXCAN1_MASK.offset158)
#define FLEXCAN1_RXIMR55 (IMXRT_FLEXCAN1_MASK.offset15C)
#define FLEXCAN1_RXIMR56 (IMXRT_FLEXCAN1_MASK.offset160)
#define FLEXCAN1_RXIMR57 (IMXRT_FLEXCAN1_MASK.offset164)
#define FLEXCAN1_RXIMR58 (IMXRT_FLEXCAN1_MASK.offset168)
#define FLEXCAN1_RXIMR59 (IMXRT_FLEXCAN1_MASK.offset16C)
#define FLEXCAN1_RXIMR60 (IMXRT_FLEXCAN1_MASK.offset170)
#define FLEXCAN1_RXIMR61 (IMXRT_FLEXCAN1_MASK.offset174)
#define FLEXCAN1_RXIMR62 (IMXRT_FLEXCAN1_MASK.offset178)
#define FLEXCAN1_RXIMR63 (IMXRT_FLEXCAN1_MASK.offset17C)
#define FLEXCAN1_GFWR (IMXRT_FLEXCAN1_MASK.offset1E0)
#define IMXRT_FLEXCAN2 (*(IMXRT_REGISTER32_t *)0x401D4000)
#define IMXRT_FLEXCAN2_MASK (*(IMXRT_REGISTER32_t *)0x401D4800)
#define FLEXCAN2_MCR (IMXRT_FLEXCAN2.offset000)
#define FLEXCAN2_CTRL1 (IMXRT_FLEXCAN2.offset004)
#define FLEXCAN2_TIMER (IMXRT_FLEXCAN2.offset008)
#define FLEXCAN2_RXMGMASK (IMXRT_FLEXCAN2.offset010)
#define FLEXCAN2_RX14MASK (IMXRT_FLEXCAN2.offset014)
#define FLEXCAN2_RX15MASK (IMXRT_FLEXCAN2.offset018)
#define FLEXCAN2_ECR (IMXRT_FLEXCAN2.offset01C)
#define FLEXCAN2_ESR1 (IMXRT_FLEXCAN2.offset020)
#define FLEXCAN2_IMASK2 (IMXRT_FLEXCAN2.offset024)
#define FLEXCAN2_IMASK1 (IMXRT_FLEXCAN2.offset028)
#define FLEXCAN2_IFLAG2 (IMXRT_FLEXCAN2.offset02C)
#define FLEXCAN2_IFLAG1 (IMXRT_FLEXCAN2.offset030)
#define FLEXCAN2_CTRL2 (IMXRT_FLEXCAN2.offset034)
#define FLEXCAN2_ESR2 (IMXRT_FLEXCAN2.offset038)
#define FLEXCAN2_CRCR (IMXRT_FLEXCAN2.offset044)
#define FLEXCAN2_RXFGMASK (IMXRT_FLEXCAN2.offset048)
#define FLEXCAN2_RXFIR (IMXRT_FLEXCAN2.offset04C)
#define FLEXCAN2_RXIMR0 (IMXRT_FLEXCAN2_MASK.offset080)
#define FLEXCAN2_RXIMR1 (IMXRT_FLEXCAN2_MASK.offset084)
#define FLEXCAN2_RXIMR2 (IMXRT_FLEXCAN2_MASK.offset088)
#define FLEXCAN2_RXIMR3 (IMXRT_FLEXCAN2_MASK.offset08C)
#define FLEXCAN2_RXIMR4 (IMXRT_FLEXCAN2_MASK.offset090)
#define FLEXCAN2_RXIMR5 (IMXRT_FLEXCAN2_MASK.offset094)
#define FLEXCAN2_RXIMR6 (IMXRT_FLEXCAN2_MASK.offset098)
#define FLEXCAN2_RXIMR7 (IMXRT_FLEXCAN2_MASK.offset09C)
#define FLEXCAN2_RXIMR8 (IMXRT_FLEXCAN2_MASK.offset0A0)
#define FLEXCAN2_RXIMR9 (IMXRT_FLEXCAN2_MASK.offset0A4)
#define FLEXCAN2_RXIMR10 (IMXRT_FLEXCAN2_MASK.offset0A8)
#define FLEXCAN2_RXIMR11 (IMXRT_FLEXCAN2_MASK.offset0AC)
#define FLEXCAN2_RXIMR12 (IMXRT_FLEXCAN2_MASK.offset0B0)
#define FLEXCAN2_RXIMR13 (IMXRT_FLEXCAN2_MASK.offset0B4)
#define FLEXCAN2_RXIMR14 (IMXRT_FLEXCAN2_MASK.offset0B8)
#define FLEXCAN2_RXIMR15 (IMXRT_FLEXCAN2_MASK.offset0BC)
#define FLEXCAN2_RXIMR16 (IMXRT_FLEXCAN2_MASK.offset0C0)
#define FLEXCAN2_RXIMR17 (IMXRT_FLEXCAN2_MASK.offset0C4)
#define FLEXCAN2_RXIMR18 (IMXRT_FLEXCAN2_MASK.offset0C8)
#define FLEXCAN2_RXIMR19 (IMXRT_FLEXCAN2_MASK.offset0CC)
#define FLEXCAN2_RXIMR20 (IMXRT_FLEXCAN2_MASK.offset0D0)
#define FLEXCAN2_RXIMR21 (IMXRT_FLEXCAN2_MASK.offset0D4)
#define FLEXCAN2_RXIMR22 (IMXRT_FLEXCAN2_MASK.offset0D8)
#define FLEXCAN2_RXIMR23 (IMXRT_FLEXCAN2_MASK.offset0DC)
#define FLEXCAN2_RXIMR24 (IMXRT_FLEXCAN2_MASK.offset0E0)
#define FLEXCAN2_RXIMR25 (IMXRT_FLEXCAN2_MASK.offset0E4)
#define FLEXCAN2_RXIMR26 (IMXRT_FLEXCAN2_MASK.offset0E8)
#define FLEXCAN2_RXIMR27 (IMXRT_FLEXCAN2_MASK.offset0EC)
#define FLEXCAN2_RXIMR28 (IMXRT_FLEXCAN2_MASK.offset0F0)
#define FLEXCAN2_RXIMR29 (IMXRT_FLEXCAN2_MASK.offset0F4)
#define FLEXCAN2_RXIMR30 (IMXRT_FLEXCAN2_MASK.offset0F8)
#define FLEXCAN2_RXIMR31 (IMXRT_FLEXCAN2_MASK.offset0FC)
#define FLEXCAN2_RXIMR32 (IMXRT_FLEXCAN2_MASK.offset100)
#define FLEXCAN2_RXIMR33 (IMXRT_FLEXCAN2_MASK.offset104)
#define FLEXCAN2_RXIMR34 (IMXRT_FLEXCAN2_MASK.offset108)
#define FLEXCAN2_RXIMR35 (IMXRT_FLEXCAN2_MASK.offset10C)
#define FLEXCAN2_RXIMR36 (IMXRT_FLEXCAN2_MASK.offset110)
#define FLEXCAN2_RXIMR37 (IMXRT_FLEXCAN2_MASK.offset114)
#define FLEXCAN2_RXIMR38 (IMXRT_FLEXCAN2_MASK.offset118)
#define FLEXCAN2_RXIMR39 (IMXRT_FLEXCAN2_MASK.offset11C)
#define FLEXCAN2_RXIMR40 (IMXRT_FLEXCAN2_MASK.offset120)
#define FLEXCAN2_RXIMR41 (IMXRT_FLEXCAN2_MASK.offset124)
#define FLEXCAN2_RXIMR42 (IMXRT_FLEXCAN2_MASK.offset128)
#define FLEXCAN2_RXIMR43 (IMXRT_FLEXCAN2_MASK.offset12C)
#define FLEXCAN2_RXIMR44 (IMXRT_FLEXCAN2_MASK.offset130)
#define FLEXCAN2_RXIMR45 (IMXRT_FLEXCAN2_MASK.offset134)
#define FLEXCAN2_RXIMR46 (IMXRT_FLEXCAN2_MASK.offset138)
#define FLEXCAN2_RXIMR47 (IMXRT_FLEXCAN2_MASK.offset13C)
#define FLEXCAN2_RXIMR48 (IMXRT_FLEXCAN2_MASK.offset140)
#define FLEXCAN2_RXIMR49 (IMXRT_FLEXCAN2_MASK.offset144)
#define FLEXCAN2_RXIMR50 (IMXRT_FLEXCAN2_MASK.offset148)
#define FLEXCAN2_RXIMR51 (IMXRT_FLEXCAN2_MASK.offset14C)
#define FLEXCAN2_RXIMR52 (IMXRT_FLEXCAN2_MASK.offset150)
#define FLEXCAN2_RXIMR53 (IMXRT_FLEXCAN2_MASK.offset154)
#define FLEXCAN2_RXIMR54 (IMXRT_FLEXCAN2_MASK.offset158)
#define FLEXCAN2_RXIMR55 (IMXRT_FLEXCAN2_MASK.offset15C)
#define FLEXCAN2_RXIMR56 (IMXRT_FLEXCAN2_MASK.offset160)
#define FLEXCAN2_RXIMR57 (IMXRT_FLEXCAN2_MASK.offset164)
#define FLEXCAN2_RXIMR58 (IMXRT_FLEXCAN2_MASK.offset168)
#define FLEXCAN2_RXIMR59 (IMXRT_FLEXCAN2_MASK.offset16C)
#define FLEXCAN2_RXIMR60 (IMXRT_FLEXCAN2_MASK.offset170)
#define FLEXCAN2_RXIMR61 (IMXRT_FLEXCAN2_MASK.offset174)
#define FLEXCAN2_RXIMR62 (IMXRT_FLEXCAN2_MASK.offset178)
#define FLEXCAN2_RXIMR63 (IMXRT_FLEXCAN2_MASK.offset17C)
#define FLEXCAN2_GFWR (IMXRT_FLEXCAN2_MASK.offset1E0)

