gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
#define IMXRT_FLEXCAN3 (*(IMXRT_REGISTER32_t *)0x401D8000)
#define IMXRT_FLEXCAN3_MASK (*(IMXRT_REGISTER32_t *)0x401D8800)
#define IMXRT_FLEXCAN3_EXT (*(IMXRT_REGISTER32_t *)0x401D8B00)
#define IMXRT_FLEXCAN3_ERXFIFO (*(IMXRT_REGISTER32_t *)0x401DB000)
#define FLEXCAN3_MCR (IMXRT_FLEXCAN3.offset000)
#define FLEXCAN3_CTRL1 (IMXRT_FLEXCAN3.offset004)
#define FLEXCAN3_TIMER (IMXRT_FLEXCAN3.offset008)
#define FLEXCAN3_RXMGMASK (IMXRT_FLEXCAN3.offset010)
#define FLEXCAN3_RX14MASK (IMXRT_FLEXCAN3.offset014)
#define FLEXCAN3_RX15MASK (IMXRT_FLEXCAN3.offset018)
#define FLEXCAN3_ECR (IMXRT_FLEXCAN3.offset01C)
#define FLEXCAN3_ESR1 (IMXRT_FLEXCAN3.offset020)
#define FLEXCAN3_IMASK2 (IMXRT_FLEXCAN3.offset024)
#define FLEXCAN3_IMASK1 (IMXRT_FLEXCAN3.offset028)
#define FLEXCAN3_IFLAG2 (IMXRT_FLEXCAN3.offset02C)
#define FLEXCAN3_IFLAG1 (IMXRT_FLEXCAN3.offset030)
#define FLEXCAN3_CTRL2 (IMXRT_FLEXCAN3.offset034)
#define FLEXCAN3_ESR2 (IMXRT_FLEXCAN3.offset038)
#define FLEXCAN3_CRCR (IMXRT_FLEXCAN3.offset044)
#define FLEXCAN3_RXFGMASK (IMXRT_FLEXCAN3.offset048)
#define FLEXCAN3_RXFIR (IMXRT_FLEXCAN3.offset04C)
#define FLEXCAN3_RXIMR0 (IMXRT_FLEXCAN3_MASK.offset080)
#define FLEXCAN3_RXIMR1 (IMXRT_FLEXCAN3_MASK.offset084)
#define FLEXCAN3_RXIMR2 (IMXRT_FLEXCAN3_MASK.offset088)
#define FLEXCAN3_RXIMR3 (IMXRT_FLEXCAN3_MASK.offset08C)
#define FLEXCAN3_RXIMR4 (IMXRT_FLEXCAN3_MASK.offset090)
#define FLEXCAN3_RXIMR5 (IMXRT_FLEXCAN3_MASK.offset094)
#define FLEXCAN3_RXIMR6 (IMXRT_FLEXCAN3_MASK.offset098)
#define FLEXCAN3_RXIMR7 (IMXRT_FLEXCAN3_MASK.offset09C)
#define FLEXCAN3_RXIMR8 (IMXRT_FLEXCAN3_MASK.offset0A0)
#define FLEXCAN3_RXIMR9 (IMXRT_FLEXCAN3_MASK.offset0A4)
#define FLEXCAN3_RXIMR10 (IMXRT_FLEXCAN3_MASK.offset0A8)
#define FLEXCAN3_RXIMR11 (IMXRT_FLEXCAN3_MASK.offset0AC)
#define FLEXCAN3_RXIMR12 (IMXRT_FLEXCAN3_MASK.offset0B0)
#define FLEXCAN3_RXIMR13 (IMXRT_FLEXCAN3_MASK.offset0B4)
#define FLEXCAN3_RXIMR14 (IMXRT_FLEXCAN3_MASK.offset0B8)
#define FLEXCAN3_RXIMR15 (IMXRT_FLEXCAN3_MASK.offset0BC)
#define FLEXCAN3_RXIMR16 (IMXRT_FLEXCAN3_MASK.offset0C0)
#define FLEXCAN3_RXIMR17 (IMXRT_FLEXCAN3_MASK.offset0C4)
#define FLEXCAN3_RXIMR18 (IMXRT_FLEXCAN3_MASK.offset0C8)
#define FLEXCAN3_RXIMR19 (IMXRT_FLEXCAN3_MASK.offset0CC)
#define FLEXCAN3_RXIMR20 (IMXRT_FLEXCAN3_MASK.offset0D0)
#define FLEXCAN3_RXIMR21 (IMXRT_FLEXCAN3_MASK.offset0D4)
#define FLEXCAN3_RXIMR22 (IMXRT_FLEXCAN3_MASK.offset0D8)
#define FLEXCAN3_RXIMR23 (IMXRT_FLEXCAN3_MASK.offset0DC)
#define FLEXCAN3_RXIMR24 (IMXRT_FLEXCAN3_MASK.offset0E0)
#define FLEXCAN3_RXIMR25 (IMXRT_FLEXCAN3_MASK.offset0E4)
#define FLEXCAN3_RXIMR26 (IMXRT_FLEXCAN3_MASK.offset0E8)
#define FLEXCAN3_RXIMR27 (IMXRT_FLEXCAN3_MASK.offset0EC)
#define FLEXCAN3_RXIMR28 (IMXRT_FLEXCAN3_MASK.offset0F0)
#define FLEXCAN3_RXIMR29 (IMXRT_FLEXCAN3_MASK.offset0F4)
#define FLEXCAN3_RXIMR30 (IMXRT_FLEXCAN3_MASK.offset0F8)
#define FLEXCAN3_RXIMR31 (IMXRT_FLEXCAN3_MASK.offset0FC)
#define FLEXCAN3_RXIMR32 (IMXRT_FLEXCAN3_MASK.offset100)
#define FLEXCAN3_RXIMR33 (IMXRT_FLEXCAN3_MASK.offset104)
#define FLEXCAN3_RXIMR34 (IMXRT_FLEXCAN3_MASK.offset108)
#define FLEXCAN3_RXIMR35 (IMXRT_FLEXCAN3_MASK.offset10C)
#define FLEXCAN3_RXIMR36 (IMXRT_FLEXCAN3_MASK.offset110)
#define FLEXCAN3_RXIMR37 (IMXRT_FLEXCAN3_MASK.offset114)
#define FLEXCAN3_RXIMR38 (IMXRT_FLEXCAN3_MASK.offset118)
#define FLEXCAN3_RXIMR39 (IMXRT_FLEXCAN3_MASK.offset11C)
#define FLEXCAN3_RXIMR40 (IMXRT_FLEXCAN3_MASK.offset120)
#define FLEXCAN3_RXIMR41 (IMXRT_FLEXCAN3_MASK.offset124)
#define FLEXCAN3_RXIMR42 (IMXRT_FLEXCAN3_MASK.offset128)
#define FLEXCAN3_RXIMR43 (IMXRT_FLEXCAN3_MASK.offset12C)
#define FLEXCAN3_RXIMR44 (IMXRT_FLEXCAN3_MASK.offset130)
#define FLEXCAN3_RXIMR45 (IMXRT_FLEXCAN3_MASK.offset134)
#define FLEXCAN3_RXIMR46 (IMXRT_FLEXCAN3_MASK.offset138)
#define FLEXCAN3_RXIMR47 (IMXRT_FLEXCAN3_MASK.offset13C)
#define FLEXCAN3_RXIMR48 (IMXRT_FLEXCAN3_MASK.offset140)
#define FLEXCAN3_RXIMR49 (IMXRT_FLEXCAN3_MASK.offset144)
#define FLEXCAN3_RXIMR50 (IMXRT_FLEXCAN3_MASK.offset148)
#define FLEXCAN3_RXIMR51 (IMXRT_FLEXCAN3_MASK.offset14C)
#define FLEXCAN3_RXIMR52 (IMXRT_FLEXCAN3_MASK.offset150)
#define FLEXCAN3_RXIMR53 (IMXRT_FLEXCAN3_MASK.offset154)
#define FLEXCAN3_RXIMR54 (IMXRT_FLEXCAN3_MASK.offset158)
#define FLEXCAN3_RXIMR55 (IMXRT_FLEXCAN3_MASK.offset15C)
#define FLEXCAN3_RXIMR56 (IMXRT_FLEXCAN3_MASK.offset160)
#define FLEXCAN3_RXIMR57 (IMXRT_FLEXCAN3_MASK.offset164)
#define FLEXCAN3_RXIMR58 (IMXRT_FLEXCAN3_MASK.offset168)
#define FLEXCAN3_RXIMR59 (IMXRT_FLEXCAN3_MASK.offset16C)
#define FLEXCAN3_RXIMR60 (IMXRT_FLEXCAN3_MASK.offset170)
#define FLEXCAN3_RXIMR61 (IMXRT_FLEXCAN3_MASK.offset174)
#define FLEXCAN3_RXIMR62 (IMXRT_FLEXCAN3_MASK.offset178)
#define FLEXCAN3_RXIMR63 (IMXRT_FLEXCAN3_MASK.offset17C)
#define FLEXCAN3_EPRS (IMXRT_FLEXCAN3_EXT.offset0F0)
#define FLEXCAN3_ENCBT (IMXRT_FLEXCAN3_EXT.offset0F4)
#define FLEXCAN3_EDCBT (IMXRT_FLEXCAN3_EXT.offset0F8)
#define FLEXCAN3_ETDC (IMXRT_FLEXCAN3_EXT.offset0FC)
#define FLEXCAN3_FDCTRL (IMXRT_FLEXCAN3_EXT.offset100)
#define FLEXCAN3_FDCBT (IMXRT_FLEXCAN3_EXT.offset104)
#define FLEXCAN3_FDCRC (IMXRT_FLEXCAN3_EXT.offset108)
#define FLEXCAN3_ERFCR (IMXRT_FLEXCAN3_EXT.offset10C)
#define FLEXCAN3_ERFIER (IMXRT_FLEXCAN3_EXT.offset110)
#define FLEXCAN3_ERFSR (IMXRT_FLEXCAN3_EXT.offset114)
#define FLEXCAN3_HR_TIME_STAMP0 (IMXRT_FLEXCAN3_EXT.offset130)
#define FLEXCAN3_HR_TIME_STAMP1 (IMXRT_FLEXCAN3_EXT.offset134)
#define FLEXCAN3_HR_TIME_STAMP2 (IMXRT_FLEXCAN3_EXT.offset138)
#define FLEXCAN3_HR_TIME_STAMP3 (IMXRT_FLEXCAN3_EXT.offset13C)
#define FLEXCAN3_HR_TIME_STAMP4 (IMXRT_FLEXCAN3_EXT.offset140)
#define FLEXCAN3_HR_TIME_STAMP5 (IMXRT_FLEXCAN3_EXT.offset144)
#define FLEXCAN3_HR_TIME_STAMP6 (IMXRT_FLEXCAN3_EXT.offset148)
#define FLEXCAN3_HR_TIME_STAMP7 (IMXRT_FLEXCAN3_EXT.offset14C)
#define FLEXCAN3_HR_TIME_STAMP8 (IMXRT_FLEXCAN3_EXT.offset150)
#define FLEXCAN3_HR_TIME_STAMP9 (IMXRT_FLEXCAN3_EXT.offset154)
#define FLEXCAN3_HR_TIME_STAMP10 (IMXRT_FLEXCAN3_EXT.offset158)
#define FLEXCAN3_HR_TIME_STAMP11 (IMXRT_FLEXCAN3_EXT.offset15C)
#define FLEXCAN3_HR_TIME_STAMP12 (IMXRT_FLEXCAN3_EXT.offset160)
#define FLEXCAN3_HR_TIME_STAMP13 (IMXRT_FLEXCAN3_EXT.offset164)
#define FLEXCAN3_HR_TIME_STAMP14 (IMXRT_FLEXCAN3_EXT.offset168)
#define FLEXCAN3_HR_TIME_STAMP15 (IMXRT_FLEXCAN3_EXT.offset16C)
#define FLEXCAN3_HR_TIME_STAMP16 (IMXRT_FLEXCAN3_EXT.offset170)
#define FLEXCAN3_HR_TIME_STAMP17 (IMXRT_FLEXCAN3_EXT.offset174)
#define FLEXCAN3_HR_TIME_STAMP18 (IMXRT_FLEXCAN3_EXT.offset178)
#define FLEXCAN3_HR_TIME_STAMP19 (IMXRT_FLEXCAN3_EXT.offset17C)
#define FLEXCAN3_HR_TIME_STAMP20 (IMXRT_FLEXCAN3_EXT.offset180)
#define FLEXCAN3_HR_TIME_STAMP21 (IMXRT_FLEXCAN3_EXT.offset184)
#define FLEXCAN3_HR_TIME_STAMP22 (IMXRT_FLEXCAN3_EXT.offset188)
#define FLEXCAN3_HR_TIME_STAMP23 (IMXRT_FLEXCAN3_EXT.offset18C)
#define FLEXCAN3_HR_TIME_STAMP24 (IMXRT_FLEXCAN3_EXT.offset190)
#define FLEXCAN3_HR_TIME_STAMP25 (IMXRT_FLEXCAN3_EXT.offset194)
#define FLEXCAN3_HR_TIME_STAMP26 (IMXRT_FLEXCAN3_EXT.offset198)
#define FLEXCAN3_HR_TIME_STAMP27 (IMXRT_FLEXCAN3_EXT.offset19C)
#define FLEXCAN3_HR_TIME_STAMP28 (IMXRT_FLEXCAN3_EXT.offset1A0)
#define FLEXCAN3_HR_TIME_STAMP29 (IMXRT_FLEXCAN3_EXT.offset1A4)
#define FLEXCAN3_HR_TIME_STAMP30 (IMXRT_FLEXCAN3_EXT.offset1A8)
#define FLEXCAN3_HR_TIME_STAMP31 (IMXRT_FLEXCAN3_EXT.offset1AC)
#define FLEXCAN3_HR_TIME_STAMP32 (IMXRT_FLEXCAN3_EXT.offset1B0)
#define FLEXCAN3_HR_TIME_STAMP33 (IMXRT_FLEXCAN3_EXT.offset1B4)
#define FLEXCAN3_HR_TIME_STAMP34 (IMXRT_FLEXCAN3_EXT.offset1B8)
#define FLEXCAN3_HR_TIME_STAMP35 (IMXRT_FLEXCAN3_EXT.offset1BC)
#define FLEXCAN3_HR_TIME_STAMP36 (IMXRT_FLEXCAN3_EXT.offset1C0)
#define FLEXCAN3_HR_TIME_STAMP37 (IMXRT_FLEXCAN3_EXT.offset1C4)
#define FLEXCAN3_HR_TIME_STAMP38 (IMXRT_FLEXCAN3_EXT.offset1C8)
#define FLEXCAN3_HR_TIME_STAMP39 (IMXRT_FLEXCAN3_EXT.offset1CC)
#define FLEXCAN3_HR_TIME_STAMP40 (IMXRT_FLEXCAN3_EXT.offset1D0)
#define FLEXCAN3_HR_TIME_STAMP41 (IMXRT_FLEXCAN3_EXT.offset1D4)
#define FLEXCAN3_HR_TIME_STAMP42 (IMXRT_FLEXCAN3_EXT.offset1D8)
#define FLEXCAN3_HR_TIME_STAMP43 (IMXRT_FLEXCAN3_EXT.offset1DC)
#define FLEXCAN3_HR_TIME_STAMP44 (IMXRT_FLEXCAN3_EXT.offset1E0)
#define FLEXCAN3_HR_TIME_STAMP45 (IMXRT_FLEXCAN3_EXT.offset1E4)
#define FLEXCAN3_HR_TIME_STAMP46 (IMXRT_FLEXCAN3_EXT.offset1E8)
#define FLEXCAN3_HR_TIME_STAMP47 (IMXRT_FLEXCAN3_EXT.offset1EC)
#define FLEXCAN3_HR_TIME_STAMP48 (IMXRT_FLEXCAN3_EXT.offset1F0)
#define FLEXCAN3_HR_TIME_STAMP49 (IMXRT_FLEXCAN3_EXT.offset1F4)
#define FLEXCAN3_HR_TIME_STAMP50 (IMXRT_FLEXCAN3_EXT.offset1F8)
#define FLEXCAN3_HR_TIME_STAMP51 (IMXRT_FLEXCAN3_EXT.offset1FC)
#define FLEXCAN3_HR_TIME_STAMP52 (IMXRT_FLEXCAN3_EXT.offset200)
#define FLEXCAN3_HR_TIME_STAMP53 (IMXRT_FLEXCAN3_EXT.offset204)
#define FLEXCAN3_HR_TIME_STAMP54 (IMXRT_FLEXCAN3_EXT.offset208)
#define FLEXCAN3_HR_TIME_STAMP55 (IMXRT_FLEXCAN3_EXT.offset20C)
#define FLEXCAN3_HR_TIME_STAMP56 (IMXRT_FLEXCAN3_EXT.offset210)
#define FLEXCAN3_HR_TIME_STAMP57 (IMXRT_FLEXCAN3_EXT.offset234)
#define FLEXCAN3_HR_TIME_STAMP58 (IMXRT_FLEXCAN3_EXT.offset218)
#define FLEXCAN3_HR_TIME_STAMP59 (IMXRT_FLEXCAN3_EXT.offset21C)
#define FLEXCAN3_HR_TIME_STAMP60 (IMXRT_FLEXCAN3_EXT.offset220)
#define FLEXCAN3_HR_TIME_STAMP61 (IMXRT_FLEXCAN3_EXT.offset224)
#define FLEXCAN3_HR_TIME_STAMP62 (IMXRT_FLEXCAN3_EXT.offset228)
#define FLEXCAN3_HR_TIME_STAMP63 (IMXRT_FLEXCAN3_EXT.offset22C)
#define FLEXCAN3_ERFFEL0 (IMXRT_FLEXCAN3_ERXFIFO.offset000)
#define FLEXCAN3_ERFFEL1 (IMXRT_FLEXCAN3_ERXFIFO.offset004)
#define FLEXCAN3_ERFFEL2 (IMXRT_FLEXCAN3_ERXFIFO.offset008)
#define FLEXCAN3_ERFFEL3 (IMXRT_FLEXCAN3_ERXFIFO.offset00C)
#define FLEXCAN3_ERFFEL4 (IMXRT_FLEXCAN3_ERXFIFO.offset010)
#define FLEXCAN3_ERFFEL5 (IMXRT_FLEXCAN3_ERXFIFO.offset014)
#define FLEXCAN3_ERFFEL6 (IMXRT_FLEXCAN3_ERXFIFO.offset018)
#define FLEXCAN3_ERFFEL7 (IMXRT_FLEXCAN3_ERXFIFO.offset01C)
#define FLEXCAN3_ERFFEL8 (IMXRT_FLEXCAN3_ERXFIFO.offset020)
#define FLEXCAN3_ERFFEL9 (IMXRT_FLEXCAN3_ERXFIFO.offset024)
#define FLEXCAN3_ERFFEL10 (IMXRT_FLEXCAN3_ERXFIFO.offset028)
#define FLEXCAN3_ERFFEL11 (IMXRT_FLEXCAN3_ERXFIFO.offset02C)
#define FLEXCAN3_ERFFEL12 (IMXRT_FLEXCAN3_ERXFIFO.offset030)
#define FLEXCAN3_ERFFEL13 (IMXRT_FLEXCAN3_ERXFIFO.offset034)
#define FLEXCAN3_ERFFEL14 (IMXRT_FLEXCAN3_ERXFIFO.offset038)
#define FLEXCAN3_ERFFEL15 (IMXRT_FLEXCAN3_ERXFIFO.offset03C)
#define FLEXCAN3_ERFFEL16 (IMXRT_FLEXCAN3_ERXFIFO.offset040)
#define FLEXCAN3_ERFFEL17 (IMXRT_FLEXCAN3_ERXFIFO.offset044)
#define FLEXCAN3_ERFFEL18 (IMXRT_FLEXCAN3_ERXFIFO.offset048)
#define FLEXCAN3_ERFFEL19 (IMXRT_FLEXCAN3_ERXFIFO.offset04C)
#define FLEXCAN3_ERFFEL20 (IMXRT_FLEXCAN3_ERXFIFO.offset050)
#define FLEXCAN3_ERFFEL21 (IMXRT_FLEXCAN3_ERXFIFO.offset054)
#define FLEXCAN3_ERFFEL22 (IMXRT_FLEXCAN3_ERXFIFO.offset058)
#define FLEXCAN3_ERFFEL23 (IMXRT_FLEXCAN3_ERXFIFO.offset05C)
#define FLEXCAN3_ERFFEL24 (IMXRT_FLEXCAN3_ERXFIFO.offset060)
#define FLEXCAN3_ERFFEL25 (IMXRT_FLEXCAN3_ERXFIFO.offset064)
#define FLEXCAN3_ERFFEL26 (IMXRT_FLEXCAN3_ERXFIFO.offset068)
#define FLEXCAN3_ERFFEL27 (IMXRT_FLEXCAN3_ERXFIFO.offset06C)
#define FLEXCAN3_ERFFEL28 (IMXRT_FLEXCAN3_ERXFIFO.offset070)
#define FLEXCAN3_ERFFEL29 (IMXRT_FLEXCAN3_ERXFIFO.offset074)
#define FLEXCAN3_ERFFEL30 (IMXRT_FLEXCAN3_ERXFIFO.offset078)
#define FLEXCAN3_ERFFEL31 (IMXRT_FLEXCAN3_ERXFIFO.offset07C)
#define FLEXCAN3_ERFFEL32 (IMXRT_FLEXCAN3_ERXFIFO.offset080)
#define FLEXCAN3_ERFFEL33 (IMXRT_FLEXCAN3_ERXFIFO.offset084)
#define FLEXCAN3_ERFFEL34 (IMXRT_FLEXCAN3_ERXFIFO.offset088)
#define FLEXCAN3_ERFFEL35 (IMXRT_FLEXCAN3_ERXFIFO.offset08C)
#define FLEXCAN3_ERFFEL36 (IMXRT_FLEXCAN3_ERXFIFO.offset090)
#define FLEXCAN3_ERFFEL37 (IMXRT_FLEXCAN3_ERXFIFO.offset094)
#define FLEXCAN3_ERFFEL38 (IMXRT_FLEXCAN3_ERXFIFO.offset098)
#define FLEXCAN3_ERFFEL39 (IMXRT_FLEXCAN3_ERXFIFO.offset09C)
#define FLEXCAN3_ERFFEL40 (IMXRT_FLEXCAN3_ERXFIFO.offset0A0)
#define FLEXCAN3_ERFFEL41 (IMXRT_FLEXCAN3_ERXFIFO.offset0A4)
#define FLEXCAN3_ERFFEL42 (IMXRT_FLEXCAN3_ERXFIFO.offset0A8)
#define FLEXCAN3_ERFFEL43 (IMXRT_FLEXCAN3_ERXFIFO.offset0AC)
#define FLEXCAN3_ERFFEL44 (IMXRT_FLEXCAN3_ERXFIFO.offset0B0)
#define FLEXCAN3_ERFFEL45 (IMXRT_FLEXCAN3_ERXFIFO.offset0B4)
#define FLEXCAN3_ERFFEL46 (IMXRT_FLEXCAN3_ERXFIFO.offset0B8)
#define FLEXCAN3_ERFFEL47 (IMXRT_FLEXCAN3_ERXFIFO.offset0BC)
#define FLEXCAN3_ERFFEL48 (IMXRT_FLEXCAN3_ERXFIFO.offset0C0)
#define FLEXCAN3_ERFFEL49 (IMXRT_FLEXCAN3_ERXFIFO.offset0C4)
#define FLEXCAN3_ERFFEL50 (IMXRT_FLEXCAN3_ERXFIFO.offset0C8)
#define FLEXCAN3_ERFFEL51 (IMXRT_FLEXCAN3_ERXFIFO.offset0CC)
#define FLEXCAN3_ERFFEL52 (IMXRT_FLEXCAN3_ERXFIFO.offset0D0)
#define FLEXCAN3_ERFFEL53 (IMXRT_FLEXCAN3_ERXFIFO.offset0D4)
#define FLEXCAN3_ERFFEL54 (IMXRT_FLEXCAN3_ERXFIFO.offset0D8)
#define FLEXCAN3_ERFFEL55 (IMXRT_FLEXCAN3_ERXFIFO.offset0DC)
#define FLEXCAN3_ERFFEL56 (IMXRT_FLEXCAN3_ERXFIFO.offset0E0)
#define FLEXCAN3_ERFFEL57 (IMXRT_FLEXCAN3_ERXFIFO.offset0E4)
#define FLEXCAN3_ERFFEL58 (IMXRT_FLEXCAN3_ERXFIFO.offset0E8)
#define FLEXCAN3_ERFFEL59 (IMXRT_FLEXCAN3_ERXFIFO.offset0EC)
#define FLEXCAN3_ERFFEL60 (IMXRT_FLEXCAN3_ERXFIFO.offset0F0)
#define FLEXCAN3_ERFFEL61 (IMXRT_FLEXCAN3_ERXFIFO.offset0F4)
#define FLEXCAN3_ERFFEL62 (IMXRT_FLEXCAN3_ERXFIFO.offset0F8)
#define FLEXCAN3_ERFFEL63 (IMXRT_FLEXCAN3_ERXFIFO.offset0FC)
#define FLEXCAN3_ERFFEL64 (IMXRT_FLEXCAN3_ERXFIFO.offset100)
#define FLEXCAN3_ERFFEL65 (IMXRT_FLEXCAN3_ERXFIFO.offset104)
#define FLEXCAN3_ERFFEL66 (IMXRT_FLEXCAN3_ERXFIFO.offset108)
#define FLEXCAN3_ERFFEL67 (IMXRT_FLEXCAN3_ERXFIFO.offset10C)
#define FLEXCAN3_ERFFEL68 (IMXRT_FLEXCAN3_ERXFIFO.offset110)
#define FLEXCAN3_ERFFEL69 (IMXRT_FLEXCAN3_ERXFIFO.offset114)
#define FLEXCAN3_ERFFEL70 (IMXRT_FLEXCAN3_ERXFIFO.offset118)
#define FLEXCAN3_ERFFEL71 (IMXRT_FLEXCAN3_ERXFIFO.offset11C)
#define FLEXCAN3_ERFFEL72 (IMXRT_FLEXCAN3_ERXFIFO.offset120)
#define FLEXCAN3_ERFFEL73 (IMXRT_FLEXCAN3_ERXFIFO.offset124)
#define FLEXCAN3_ERFFEL74 (IMXRT_FLEXCAN3_ERXFIFO.offset128)
#define FLEXCAN3_ERFFEL75 (IMXRT_FLEXCAN3_ERXFIFO.offset12C)
#define FLEXCAN3_ERFFEL76 (IMXRT_FLEXCAN3_ERXFIFO.offset130)
#define FLEXCAN3_ERFFEL77 (IMXRT_FLEXCAN3_ERXFIFO.offset134)
#define FLEXCAN3_ERFFEL78 (IMXRT_FLEXCAN3_ERXFIFO.offset138)
#define FLEXCAN3_ERFFEL79 (IMXRT_FLEXCAN3_ERXFIFO.offset13C)
#define FLEXCAN3_ERFFEL80 (IMXRT_FLEXCAN3_ERXFIFO.offset140)
#define FLEXCAN3_ERFFEL81 (IMXRT_FLEXCAN3_ERXFIFO.offset144)
#define FLEXCAN3_ERFFEL82 (IMXRT_FLEXCAN3_ERXFIFO.offset148)
#define FLEXCAN3_ERFFEL83 (IMXRT_FLEXCAN3_ERXFIFO.offset14C)
#define FLEXCAN3_ERFFEL84 (IMXRT_FLEXCAN3_ERXFIFO.offset150)
#define FLEXCAN3_ERFFEL85 (IMXRT_FLEXCAN3_ERXFIFO.offset154)
#define FLEXCAN3_ERFFEL86 (IMXRT_FLEXCAN3_ERXFIFO.offset158)
#define FLEXCAN3_ERFFEL87 (IMXRT_FLEXCAN3_ERXFIFO.offset15C)
#define FLEXCAN3_ERFFEL88 (IMXRT_FLEXCAN3_ERXFIFO.offset160)
#define FLEXCAN3_ERFFEL89 (IMXRT_FLEXCAN3_ERXFIFO.offset164)
#define FLEXCAN3_ERFFEL90 (IMXRT_FLEXCAN3_ERXFIFO.offset168)
#define FLEXCAN3_ERFFEL91 (IMXRT_FLEXCAN3_ERXFIFO.offset16C)
#define FLEXCAN3_ERFFEL92 (IMXRT_FLEXCAN3_ERXFIFO.offset170)
#define FLEXCAN3_ERFFEL93 (IMXRT_FLEXCAN3_ERXFIFO.offset174)
#define FLEXCAN3_ERFFEL94 (IMXRT_FLEXCAN3_ERXFIFO.offset178)
#define FLEXCAN3_ERFFEL95 (IMXRT_FLEXCAN3_ERXFIFO.offset17C)
#define FLEXCAN3_ERFFEL96 (IMXRT_FLEXCAN3_ERXFIFO.offset180)
#define FLEXCAN3_ERFFEL97 (IMXRT_FLEXCAN3_ERXFIFO.offset184)
#define FLEXCAN3_ERFFEL98 (IMXRT_FLEXCAN3_ERXFIFO.offset188)
#define FLEXCAN3_ERFFEL99 (IMXRT_FLEXCAN3_ERXFIFO.offset18C)
#define FLEXCAN3_ERFFEL100 (IMXRT_FLEXCAN3_ERXFIFO.offset190)
#define FLEXCAN3_ERFFEL101 (IMXRT_FLEXCAN3_ERXFIFO.offset194)
#define FLEXCAN3_ERFFEL102 (IMXRT_FLEXCAN3_ERXFIFO.offset198)
#define FLEXCAN3_ERFFEL103 (IMXRT_FLEXCAN3_ERXFIFO.offset19C)
#define FLEXCAN3_ERFFEL104 (IMXRT_FLEXCAN3_ERXFIFO.offset1A0)
#define FLEXCAN3_ERFFEL105 (IMXRT_FLEXCAN3_ERXFIFO.offset1A4)
#define FLEXCAN3_ERFFEL106 (IMXRT_FLEXCAN3_ERXFIFO.offset1A8)
#define FLEXCAN3_ERFFEL107 (IMXRT_FLEXCAN3_ERXFIFO.offset1AC)
#define FLEXCAN3_ERFFEL108 (IMXRT_FLEXCAN3_ERXFIFO.offset1B0)
#define FLEXCAN3_ERFFEL109 (IMXRT_FLEXCAN3_ERXFIFO.offset1B4)
#define FLEXCAN3_ERFFEL110 (IMXRT_FLEXCAN3_ERXFIFO.offset1B8)
#define FLEXCAN3_ERFFEL111 (IMXRT_FLEXCAN3_ERXFIFO.offset1BC)
#define FLEXCAN3_ERFFEL112 (IMXRT_FLEXCAN3_ERXFIFO.offset1C0)
#define FLEXCAN3_ERFFEL113 (IMXRT_FLEXCAN3_ERXFIFO.offset1C4)
#define FLEXCAN3_ERFFEL114 (IMXRT_FLEXCAN3_ERXFIFO.offset1C8)
#define FLEXCAN3_ERFFEL115 (IMXRT_FLEXCAN3_ERXFIFO.offset1CC)
#define FLEXCAN3_ERFFEL116 (IMXRT_FLEXCAN3_ERXFIFO.offset1D0)
#define FLEXCAN3_ERFFEL117 (IMXRT_FLEXCAN3_ERXFIFO.offset1D4)
#define FLEXCAN3_ERFFEL118 (IMXRT_FLEXCAN3_ERXFIFO.offset1D8)
#define FLEXCAN3_ERFFEL119 (IMXRT_FLEXCAN3_ERXFIFO.offset1DC)
#define FLEXCAN3_ERFFEL120 (IMXRT_FLEXCAN3_ERXFIFO.offset1E0)
#define FLEXCAN3_ERFFEL121 (IMXRT_FLEXCAN3_ERXFIFO.offset1E4)
#define FLEXCAN3_ERFFEL122 (IMXRT_FLEXCAN3_ERXFIFO.offset1E8)
#define FLEXCAN3_ERFFEL123 (IMXRT_FLEXCAN3_ERXFIFO.offset1EC)
#define FLEXCAN3_ERFFEL124 (IMXRT_FLEXCAN3_ERXFIFO.offset1F0)
#define FLEXCAN3_ERFFEL125 (IMXRT_FLEXCAN3_ERXFIFO.offset1F4)
#define FLEXCAN3_ERFFEL126 (IMXRT_FLEXCAN3_ERXFIFO.offset1F8)
#define FLEXCAN3_ERFFEL127 (IMXRT_FLEXCAN3_ERXFIFO.offset1FC)

// 27.3.1.1: page 1292
typedef struct
{
    const uint32_t VERID;             // 0x00 (IMXRT_FLEXIO1.offset000)
    volatile uint32_t PARAM;          // 0x04 // (IMXRT_FLEXIO1.offset004)
    volatile uint32_t CTRL;           // 0x08(IMXRT_FLEXIO1.offset008)
    volatile uint32_t PIN;            // 0x0c (IMXRT_FLEXIO1.offset00C)
    volatile uint32_t SHIFTSTAT;      // 0x10 (IMXRT_FLEXIO1.offset010)
    volatile uint32_t SHIFTERR;       // 0x14(IMXRT_FLEXIO1.offset014)
    volatile uint32_t TIMSTAT;        // 0x18 (IMXRT_FLEXIO1.offset018)
    const uint32_t UNUSED0;           // 0x1c
    volatile uint32_t SHIFTSIEN;      // 0x20 (IMXRT_FLEXIO1.offset020)
    volatile uint32_t SHIFTEIEN;      // 0x24 (IMXRT_FLEXIO1.offset024)
    volatile uint32_t TIMIEN;         // 0x28 (IMXRT_FLEXIO1.offset028)
    const uint32_t UNUSED1;           // 0x2c
    volatile uint32_t SHIFTSDEN;      // 0x30 (IMXRT_FLEXIO1.offset030)
    const uint32_t UNUSED2[3];        // 0x34 38 3C
    volatile uint32_t SHIFTSTATE;     // 0x40 (IMXRT_FLEXIO1.offset040)
    const uint32_t UNUSED3[15];       // 0x44..  50... 60... 70...
    volatile uint32_t SHIFTCTL[4];    // 0x80 84 88 8C
    const uint32_t UNUSED4[28];       // 0x90 - 0xfc
    volatile uint32_t SHIFTCFG[4];    // 0x100 104 108 10C (IMXRT_FLEXIO1.offset100)
    const uint32_t UNUSED5[60];       // 0x110 - 0x1FC
    volatile uint32_t SHIFTBUF[4];    // 0x200 204 208 20c (IMXRT_FLEXIO1.offset200)
    const uint32_t UNUSED6[28];       //
    volatile uint32_t SHIFTBUFBIS[4]; // 0x280        // (IMXRT_FLEXIO1.offset280)
    const uint32_t UNUSED7[28];       //
    volatile uint32_t SHIFTBUFBYS[4]; // 0x300 (IMXRT_FLEXIO1.offset300)
    const uint32_t UNUSED8[28];       //
    volatile uint32_t SHIFTBUFBBS[4]; // 0x380 (IMXRT_FLEXIO1.offset380)
    const uint32_t UNUSED9[28];       //
    volatile uint32_t TIMCTL[4];      // 0x400
    const uint32_t UNUSED10[28];      //
    volatile uint32_t TIMCFG[4];      // 0x480
    const uint32_t UNUSED11[28];      //
    volatile uint32_t TIMCMP[4];      // 0x500
    const uint32_t UNUSED12[28 + 64]; //
    volatile uint32_t SHIFTBUFNBS[4]; // 0x680
    const uint32_t UNUSED13[28];      //
    volatile uint32_t SHIFTBUFHWS[4]; // 0x700
    const uint32_t UNUSED14[28];      //
    volatile uint32_t SHIFTBUFNIS[4]; // 0x780
} IMXRT_FLEXIO_t;

