gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
#define IMXRT_FLEXIO1_S (*(IMXRT_FLEXIO_t *)0x401AC000)
#define IMXRT_FLEXIO2_S (*(IMXRT_FLEXIO_t *)0x401B0000)
#define IMXRT_FLEXIO3_S (*(IMXRT_FLEXIO_t *)0x42020000)

#define IMXRT_FLEXIO1 (*(IMXRT_REGISTER32_t *)0x401AC000)
#define IMXRT_FLEXIO1_b (*(IMXRT_REGISTER32_t *)0x401AC400)
#define FLEXIO1_VERID (IMXRT_FLEXIO1.offset000)
#define FLEXIO1_PARAM (IMXRT_FLEXIO1.offset004)
#define FLEXIO1_CTRL (IMXRT_FLEXIO1.offset008)
#define FLEXIO1_PIN (IMXRT_FLEXIO1.offset00C)
#define FLEXIO1_SHIFTSTAT (IMXRT_FLEXIO1.offset010)
#define FLEXIO1_SHIFTERR (IMXRT_FLEXIO1.offset014)
#define FLEXIO1_TIMSTAT (IMXRT_FLEXIO1.offset018)
#define FLEXIO1_SHIFTSIEN (IMXRT_FLEXIO1.offset020)
#define FLEXIO1_SHIFTEIEN (IMXRT_FLEXIO1.offset024)
#define FLEXIO1_TIMIEN (IMXRT_FLEXIO1.offset028)
#define FLEXIO1_SHIFTSDEN (IMXRT_FLEXIO1.offset030)
#define FLEXIO1_SHIFTSTATE (IMXRT_FLEXIO1.offset040)
#define FLEXIO1_SHIFTCTL0 (IMXRT_FLEXIO1.offset080)
#define FLEXIO1_SHIFTCTL1 (IMXRT_FLEXIO1.offset084)
#define FLEXIO1_SHIFTCTL2 (IMXRT_FLEXIO1.offset088)
#define FLEXIO1_SHIFTCTL3 (IMXRT_FLEXIO1.offset08C)
#define FLEXIO1_SHIFTCFG0 (IMXRT_FLEXIO1.offset100)
#define FLEXIO1_SHIFTCFG1 (IMXRT_FLEXIO1.offset104)
#define FLEXIO1_SHIFTCFG2 (IMXRT_FLEXIO1.offset108)
#define FLEXIO1_SHIFTCFG3 (IMXRT_FLEXIO1.offset10C)
#define FLEXIO1_SHIFTBUF0 (IMXRT_FLEXIO1.offset200)
#define FLEXIO1_SHIFTBUF1 (IMXRT_FLEXIO1.offset204)
#define FLEXIO1_SHIFTBUF2 (IMXRT_FLEXIO1.offset208)
#define FLEXIO1_SHIFTBUF3 (IMXRT_FLEXIO1.offset20C)
#define FLEXIO1_SHIFTBUFBIS0 (IMXRT_FLEXIO1.offset280)
#define FLEXIO1_SHIFTBUFBIS1 (IMXRT_FLEXIO1.offset284)
#define FLEXIO1_SHIFTBUFBIS2 (IMXRT_FLEXIO1.offset288)
#define FLEXIO1_SHIFTBUFBIS3 (IMXRT_FLEXIO1.offset28C)
#define FLEXIO1_SHIFTBUFBYS0 (IMXRT_FLEXIO1.offset300)
#define FLEXIO1_SHIFTBUFBYS1 (IMXRT_FLEXIO1.offset304)
#define FLEXIO1_SHIFTBUFBYS2 (IMXRT_FLEXIO1.offset308)
#define FLEXIO1_SHIFTBUFBYS3 (IMXRT_FLEXIO1.offset30C)
#define FLEXIO1_SHIFTBUFBBS0 (IMXRT_FLEXIO1.offset380)
#define FLEXIO1_SHIFTBUFBBS1 (IMXRT_FLEXIO1.offset384)
#define FLEXIO1_SHIFTBUFBBS2 (IMXRT_FLEXIO1.offset388)
#define FLEXIO1_SHIFTBUFBBS3 (IMXRT_FLEXIO1.offset38C)
#define FLEXIO1_TIMCTL0 (IMXRT_FLEXIO1_b.offset000)
#define FLEXIO1_TIMCTL1 (IMXRT_FLEXIO1_b.offset004)
#define FLEXIO1_TIMCTL2 (IMXRT_FLEXIO1_b.offset008)
#define FLEXIO1_TIMCTL3 (IMXRT_FLEXIO1_b.offset00C)
#define FLEXIO1_TIMCFG0 (IMXRT_FLEXIO1_b.offset080)
#define FLEXIO1_TIMCFG1 (IMXRT_FLEXIO1_b.offset084)
#define FLEXIO1_TIMCFG2 (IMXRT_FLEXIO1_b.offset088)
#define FLEXIO1_TIMCFG3 (IMXRT_FLEXIO1_b.offset08C)
#define FLEXIO1_TIMCMP0 (IMXRT_FLEXIO1_b.offset100)
#define FLEXIO1_TIMCMP1 (IMXRT_FLEXIO1_b.offset104)
#define FLEXIO1_TIMCMP2 (IMXRT_FLEXIO1_b.offset108)
#define FLEXIO1_TIMCMP3 (IMXRT_FLEXIO1_b.offset10C)
#define FLEXIO1_SHIFTBUFNBS0 (IMXRT_FLEXIO1_b.offset280)
#define FLEXIO1_SHIFTBUFNBS1 (IMXRT_FLEXIO1_b.offset284)
#define FLEXIO1_SHIFTBUFNBS2 (IMXRT_FLEXIO1_b.offset288)
#define FLEXIO1_SHIFTBUFNBS3 (IMXRT_FLEXIO1_b.offset28C)
#define FLEXIO1_SHIFTBUFHWS0 (IMXRT_FLEXIO1_b.offset300)
#define FLEXIO1_SHIFTBUFHWS1 (IMXRT_FLEXIO1_b.offset304)
#define FLEXIO1_SHIFTBUFHWS2 (IMXRT_FLEXIO1_b.offset308)
#define FLEXIO1_SHIFTBUFHWS3 (IMXRT_FLEXIO1_b.offset30C)
#define FLEXIO1_SHIFTBUFNIS0 (IMXRT_FLEXIO1_b.offset380)
#define FLEXIO1_SHIFTBUFNIS1 (IMXRT_FLEXIO1_b.offset384)
#define FLEXIO1_SHIFTBUFNIS2 (IMXRT_FLEXIO1_b.offset388)
#define FLEXIO1_SHIFTBUFNIS3 (IMXRT_FLEXIO1_b.offset38C)
#define IMXRT_FLEXIO2 (*(IMXRT_REGISTER32_t *)0x401B0000)
#define IMXRT_FLEXIO2_b (*(IMXRT_REGISTER32_t *)0x401B0400)
#define FLEXIO2_VERID (IMXRT_FLEXIO2.offset000)
#define FLEXIO2_PARAM (IMXRT_FLEXIO2.offset004)
#define FLEXIO2_CTRL (IMXRT_FLEXIO2.offset008)
#define FLEXIO2_PIN (IMXRT_FLEXIO2.offset00C)
#define FLEXIO2_SHIFTSTAT (IMXRT_FLEXIO2.offset010)
#define FLEXIO2_SHIFTERR (IMXRT_FLEXIO2.offset014)
#define FLEXIO2_TIMSTAT (IMXRT_FLEXIO2.offset018)
#define FLEXIO2_SHIFTSIEN (IMXRT_FLEXIO2.offset020)
#define FLEXIO2_SHIFTEIEN (IMXRT_FLEXIO2.offset024)
#define FLEXIO2_TIMIEN (IMXRT_FLEXIO2.offset028)
#define FLEXIO2_SHIFTSDEN (IMXRT_FLEXIO2.offset030)
#define FLEXIO2_SHIFTSTATE (IMXRT_FLEXIO2.offset040)
#define FLEXIO2_SHIFTCTL0 (IMXRT_FLEXIO2.offset080)
#define FLEXIO2_SHIFTCTL1 (IMXRT_FLEXIO2.offset084)
#define FLEXIO2_SHIFTCTL2 (IMXRT_FLEXIO2.offset088)
#define FLEXIO2_SHIFTCTL3 (IMXRT_FLEXIO2.offset08C)
#define FLEXIO2_SHIFTCFG0 (IMXRT_FLEXIO2.offset100)
#define FLEXIO2_SHIFTCFG1 (IMXRT_FLEXIO2.offset104)
#define FLEXIO2_SHIFTCFG2 (IMXRT_FLEXIO2.offset108)
#define FLEXIO2_SHIFTCFG3 (IMXRT_FLEXIO2.offset10C)
#define FLEXIO2_SHIFTBUF0 (IMXRT_FLEXIO2.offset200)
#define FLEXIO2_SHIFTBUF1 (IMXRT_FLEXIO2.offset204)
#define FLEXIO2_SHIFTBUF2 (IMXRT_FLEXIO2.offset208)
#define FLEXIO2_SHIFTBUF3 (IMXRT_FLEXIO2.offset20C)
#define FLEXIO2_SHIFTBUFBIS0 (IMXRT_FLEXIO2.offset280)
#define FLEXIO2_SHIFTBUFBIS1 (IMXRT_FLEXIO2.offset284)
#define FLEXIO2_SHIFTBUFBIS2 (IMXRT_FLEXIO2.offset288)
#define FLEXIO2_SHIFTBUFBIS3 (IMXRT_FLEXIO2.offset28C)
#define FLEXIO2_SHIFTBUFBYS0 (IMXRT_FLEXIO2.offset300)
#define FLEXIO2_SHIFTBUFBYS1 (IMXRT_FLEXIO2.offset304)
#define FLEXIO2_SHIFTBUFBYS2 (IMXRT_FLEXIO2.offset308)
#define FLEXIO2_SHIFTBUFBYS3 (IMXRT_FLEXIO2.offset30C)
#define FLEXIO2_SHIFTBUFBBS0 (IMXRT_FLEXIO2.offset380)
#define FLEXIO2_SHIFTBUFBBS1 (IMXRT_FLEXIO2.offset384)
#define FLEXIO2_SHIFTBUFBBS2 (IMXRT_FLEXIO2.offset388)
#define FLEXIO2_SHIFTBUFBBS3 (IMXRT_FLEXIO2.offset38C)
#define FLEXIO2_TIMCTL0 (IMXRT_FLEXIO2_b.offset000)
#define FLEXIO2_TIMCTL1 (IMXRT_FLEXIO2_b.offset004)
#define FLEXIO2_TIMCTL2 (IMXRT_FLEXIO2_b.offset008)
#define FLEXIO2_TIMCTL3 (IMXRT_FLEXIO2_b.offset00C)
#define FLEXIO2_TIMCFG0 (IMXRT_FLEXIO2_b.offset080)
#define FLEXIO2_TIMCFG1 (IMXRT_FLEXIO2_b.offset084)
#define FLEXIO2_TIMCFG2 (IMXRT_FLEXIO2_b.offset088)
#define FLEXIO2_TIMCFG3 (IMXRT_FLEXIO2_b.offset08C)
#define FLEXIO2_TIMCMP0 (IMXRT_FLEXIO2_b.offset100)
#define FLEXIO2_TIMCMP1 (IMXRT_FLEXIO2_b.offset104)
#define FLEXIO2_TIMCMP2 (IMXRT_FLEXIO2_b.offset108)
#define FLEXIO2_TIMCMP3 (IMXRT_FLEXIO2_b.offset10C)
#define FLEXIO2_SHIFTBUFNBS0 (IMXRT_FLEXIO2_b.offset280)
#define FLEXIO2_SHIFTBUFNBS1 (IMXRT_FLEXIO2_b.offset284)
#define FLEXIO2_SHIFTBUFNBS2 (IMXRT_FLEXIO2_b.offset288)
#define FLEXIO2_SHIFTBUFNBS3 (IMXRT_FLEXIO2_b.offset28C)
#define FLEXIO2_SHIFTBUFHWS0 (IMXRT_FLEXIO2_b.offset300)
#define FLEXIO2_SHIFTBUFHWS1 (IMXRT_FLEXIO2_b.offset304)
#define FLEXIO2_SHIFTBUFHWS2 (IMXRT_FLEXIO2_b.offset308)
#define FLEXIO2_SHIFTBUFHWS3 (IMXRT_FLEXIO2_b.offset30C)
#define FLEXIO2_SHIFTBUFNIS0 (IMXRT_FLEXIO2_b.offset380)
#define FLEXIO2_SHIFTBUFNIS1 (IMXRT_FLEXIO2_b.offset384)
#define FLEXIO2_SHIFTBUFNIS2 (IMXRT_FLEXIO2_b.offset388)
#define FLEXIO2_SHIFTBUFNIS3 (IMXRT_FLEXIO2_b.offset38C)
// FLEXIO3 only present in RT1062
#define IMXRT_FLEXIO3 (*(IMXRT_REGISTER32_t *)0x42020000)
#define IMXRT_FLEXIO3_b (*(IMXRT_REGISTER32_t *)0x42020400)
#define FLEXIO3_VERID (IMXRT_FLEXIO3.offset000)
#define FLEXIO3_PARAM (IMXRT_FLEXIO3.offset004)
#define FLEXIO3_CTRL (IMXRT_FLEXIO3.offset008)
#define FLEXIO3_PIN (IMXRT_FLEXIO3.offset00C)
#define FLEXIO3_SHIFTSTAT (IMXRT_FLEXIO3.offset010)
#define FLEXIO3_SHIFTERR (IMXRT_FLEXIO3.offset014)
#define FLEXIO3_TIMSTAT (IMXRT_FLEXIO3.offset018)
#define FLEXIO3_SHIFTSIEN (IMXRT_FLEXIO3.offset020)
#define FLEXIO3_SHIFTEIEN (IMXRT_FLEXIO3.offset024)
#define FLEXIO3_TIMIEN (IMXRT_FLEXIO3.offset028)
#define FLEXIO3_SHIFTSDEN (IMXRT_FLEXIO3.offset030)
#define FLEXIO3_SHIFTSTATE (IMXRT_FLEXIO3.offset040)
#define FLEXIO3_SHIFTCTL0 (IMXRT_FLEXIO3.offset080)
#define FLEXIO3_SHIFTCTL1 (IMXRT_FLEXIO3.offset084)
#define FLEXIO3_SHIFTCTL2 (IMXRT_FLEXIO3.offset088)
#define FLEXIO3_SHIFTCTL3 (IMXRT_FLEXIO3.offset08C)
#define FLEXIO3_SHIFTCFG0 (IMXRT_FLEXIO3.offset100)
#define FLEXIO3_SHIFTCFG1 (IMXRT_FLEXIO3.offset104)
#define FLEXIO3_SHIFTCFG2 (IMXRT_FLEXIO3.offset108)
#define FLEXIO3_SHIFTCFG3 (IMXRT_FLEXIO3.offset10C)
#define FLEXIO3_SHIFTBUF0 (IMXRT_FLEXIO3.offset200)
#define FLEXIO3_SHIFTBUF1 (IMXRT_FLEXIO3.offset204)
#define FLEXIO3_SHIFTBUF2 (IMXRT_FLEXIO3.offset208)
#define FLEXIO3_SHIFTBUF3 (IMXRT_FLEXIO3.offset20C)
#define FLEXIO3_SHIFTBUFBIS0 (IMXRT_FLEXIO3.offset280)
#define FLEXIO3_SHIFTBUFBIS1 (IMXRT_FLEXIO3.offset284)
#define FLEXIO3_SHIFTBUFBIS2 (IMXRT_FLEXIO3.offset288)
#define FLEXIO3_SHIFTBUFBIS3 (IMXRT_FLEXIO3.offset28C)
#define FLEXIO3_SHIFTBUFBYS0 (IMXRT_FLEXIO3.offset300)
#define FLEXIO3_SHIFTBUFBYS1 (IMXRT_FLEXIO3.offset304)
#define FLEXIO3_SHIFTBUFBYS2 (IMXRT_FLEXIO3.offset308)
#define FLEXIO3_SHIFTBUFBYS3 (IMXRT_FLEXIO3.offset30C)
#define FLEXIO3_SHIFTBUFBBS0 (IMXRT_FLEXIO3.offset380)
#define FLEXIO3_SHIFTBUFBBS1 (IMXRT_FLEXIO3.offset384)
#define FLEXIO3_SHIFTBUFBBS2 (IMXRT_FLEXIO3.offset388)
#define FLEXIO3_SHIFTBUFBBS3 (IMXRT_FLEXIO3.offset38C)
#define FLEXIO3_TIMCTL0 (IMXRT_FLEXIO3_b.offset000)
#define FLEXIO3_TIMCTL1 (IMXRT_FLEXIO3_b.offset004)
#define FLEXIO3_TIMCTL2 (IMXRT_FLEXIO3_b.offset008)
#define FLEXIO3_TIMCTL3 (IMXRT_FLEXIO3_b.offset00C)
#define FLEXIO3_TIMCFG0 (IMXRT_FLEXIO3_b.offset080)
#define FLEXIO3_TIMCFG1 (IMXRT_FLEXIO3_b.offset084)
#define FLEXIO3_TIMCFG2 (IMXRT_FLEXIO3_b.offset088)
#define FLEXIO3_TIMCFG3 (IMXRT_FLEXIO3_b.offset08C)
#define FLEXIO3_TIMCMP0 (IMXRT_FLEXIO3_b.offset100)
#define FLEXIO3_TIMCMP1 (IMXRT_FLEXIO3_b.offset104)
#define FLEXIO3_TIMCMP2 (IMXRT_FLEXIO3_b.offset108)
#define FLEXIO3_TIMCMP3 (IMXRT_FLEXIO3_b.offset10C)
#define FLEXIO3_SHIFTBUFNBS0 (IMXRT_FLEXIO3_b.offset280)
#define FLEXIO3_SHIFTBUFNBS1 (IMXRT_FLEXIO3_b.offset284)
#define FLEXIO3_SHIFTBUFNBS2 (IMXRT_FLEXIO3_b.offset288)
#define FLEXIO3_SHIFTBUFNBS3 (IMXRT_FLEXIO3_b.offset28C)
#define FLEXIO3_SHIFTBUFHWS0 (IMXRT_FLEXIO3_b.offset300)
#define FLEXIO3_SHIFTBUFHWS1 (IMXRT_FLEXIO3_b.offset304)
#define FLEXIO3_SHIFTBUFHWS2 (IMXRT_FLEXIO3_b.offset308)
#define FLEXIO3_SHIFTBUFHWS3 (IMXRT_FLEXIO3_b.offset30C)
#define FLEXIO3_SHIFTBUFNIS0 (IMXRT_FLEXIO3_b.offset380)
#define FLEXIO3_SHIFTBUFNIS1 (IMXRT_FLEXIO3_b.offset384)
#define FLEXIO3_SHIFTBUFNIS2 (IMXRT_FLEXIO3_b.offset388)
#define FLEXIO3_SHIFTBUFNIS3 (IMXRT_FLEXIO3_b.offset38C)
#define FLEXIO_CTRL_DOZEN ((uint32_t)(1 << 31))
#define FLEXIO_CTRL_DBGE ((uint32_t)(1 << 30))
#define FLEXIO_CTRL_FASTACC ((uint32_t)(1 << 2))
#define FLEXIO_CTRL_SWRST ((uint32_t)(1 << 1))
#define FLEXIO_CTRL_FLEXEN ((uint32_t)(1 << 0))
#define FLEXIO_SHIFTCTL_TIMSEL(n) ((uint32_t)(((n)&0x03) << 24))
#define FLEXIO_SHIFTCTL_TIMPOL ((uint32_t)(1 << 23))
#define FLEXIO_SHIFTCTL_PINCFG(n) ((uint32_t)(((n)&0x03) << 16))
#define FLEXIO_SHIFTCTL_PINSEL(n) ((uint32_t)(((n)&0x1F) << 8))
#define FLEXIO_SHIFTCTL_PINPOL ((uint32_t)(1 << 7))
#define FLEXIO_SHIFTCTL_SMOD(n) ((uint32_t)(((n)&0x07) << 0))
#define FLEXIO_SHIFTCFG_PWIDTH(n) ((uint32_t)(((n)&0x1F) << 16))
#define FLEXIO_SHIFTCFG_INSRC ((uint32_t)(1 << 8))
#define FLEXIO_SHIFTCFG_SSTOP(n) ((uint32_t)(((n)&0x03) << 4))
#define FLEXIO_SHIFTCFG_SSTART(n) ((uint32_t)(((n)&0x03) << 0))
#define FLEXIO_TIMCTL_TRGSEL(n) ((uint32_t)(((n)&0x3F) << 24))
#define FLEXIO_TIMCTL_TRGPOL ((uint32_t)(1 << 23))
#define FLEXIO_TIMCTL_TRGSRC ((uint32_t)(1 << 22))
#define FLEXIO_TIMCTL_PINCFG(n) ((uint32_t)(((n)&0x03) << 16))
#define FLEXIO_TIMCTL_PINSEL(n) ((uint32_t)(((n)&0x1F) << 8))
#define FLEXIO_TIMCTL_PINPOL ((uint32_t)(1 << 7))
#define FLEXIO_TIMCTL_TIMOD(n) ((uint32_t)(((n)&0x03) << 0))
#define FLEXIO_TIMCFG_TIMOUT(n) ((uint32_t)(((n)&0x03) << 24))
#define FLEXIO_TIMCFG_TIMDEC(n) ((uint32_t)(((n)&0x03) << 20))
#define FLEXIO_TIMCFG_TIMRST(n) ((uint32_t)(((n)&0x07) << 16))
#define FLEXIO_TIMCFG_TIMDIS(n) ((uint32_t)(((n)&0x07) << 12))
#define FLEXIO_TIMCFG_TIMENA(n) ((uint32_t)(((n)&0x07) << 8))
#define FLEXIO_TIMCFG_TSTOP(n) ((uint32_t)(((n)&0x03) << 4))
#define FLEXIO_TIMCFG_TSTART ((uint32_t)(1 << 1))

// 28.4.1: page 1354
typedef struct
{
    struct
    {
        volatile uint16_t CNT;
        volatile uint16_t INIT;
        volatile uint16_t CTRL2;
        volatile uint16_t CTRL;
        volatile uint16_t unused1;
        volatile uint16_t VAL0;
        volatile uint16_t FRACVAL1;
        volatile uint16_t VAL1;
        volatile uint16_t FRACVAL2;
        volatile uint16_t VAL2;
        volatile uint16_t FRACVAL3;
        volatile uint16_t VAL3;
        volatile uint16_t FRACVAL4;
        volatile uint16_t VAL4;
        volatile uint16_t FRACVAL5;
        volatile uint16_t VAL5;
        volatile uint16_t FRCTRL;
        volatile uint16_t OCTRL;
        volatile uint16_t STS;
        volatile uint16_t INTEN;
        volatile uint16_t DMAEN;
        volatile uint16_t TCTRL;
        volatile uint16_t DISMAP0;
        volatile uint16_t DISMAP1;
        volatile uint16_t DTCNT0;
        volatile uint16_t DTCNT1;
        volatile uint16_t CAPTCTRLA;
        volatile uint16_t CAPTCOMPA;
        volatile uint16_t CAPTCTRLB;
        volatile uint16_t CAPTCOMPB;
        volatile uint16_t CAPTCTRLX;
        volatile uint16_t CAPTCOMPX;
        volatile uint16_t CVAL0;
        volatile uint16_t CVAL0CYC;
        volatile uint16_t CVAL1;
        volatile uint16_t CVAL1CYC;
        volatile uint16_t CVAL2;
        volatile uint16_t CVAL2CYC;
        volatile uint16_t CVAL3;
        volatile uint16_t CVAL3CYC;
        volatile uint16_t CVAL4;
        volatile uint16_t CVAL4CYC;
        volatile uint16_t CVAL5;
        volatile uint16_t CVAL5CYC;
        volatile uint16_t unused2;
        volatile uint16_t unused3;
        volatile uint16_t unused4;
        volatile uint16_t unused5;
    } SM[4];
    volatile uint16_t OUTEN;
    volatile uint16_t MASK;
    volatile uint16_t SWCOUT;
    volatile uint16_t DTSRCSEL;
    volatile uint16_t MCTRL;
    volatile uint16_t MCTRL2;
    volatile uint16_t FCTRL0;
    volatile uint16_t FSTS0;
    volatile uint16_t FFILT0;
    volatile uint16_t FTST0;
    volatile uint16_t FCTRL20;
} IMXRT_FLEXPWM_t;
