gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
#define FLEXPWM3_SM1FRACVAL3 (IMXRT_FLEXPWM3.SM[1].FRACVAL3)
#define FLEXPWM3_SM1VAL3 (IMXRT_FLEXPWM3.SM[1].VAL3)
#define FLEXPWM3_SM1FRACVAL4 (IMXRT_FLEXPWM3.SM[1].FRACVAL4)
#define FLEXPWM3_SM1VAL4 (IMXRT_FLEXPWM3.SM[1].VAL4)
#define FLEXPWM3_SM1FRACVAL5 (IMXRT_FLEXPWM3.SM[1].FRACVAL5)
#define FLEXPWM3_SM1VAL5 (IMXRT_FLEXPWM3.SM[1].VAL5)
#define FLEXPWM3_SM1FRCTRL (IMXRT_FLEXPWM3.SM[1].FRCTRL)
#define FLEXPWM3_SM1OCTRL (IMXRT_FLEXPWM3.SM[1].OCTRL)
#define FLEXPWM3_SM1STS (IMXRT_FLEXPWM3.SM[1].STS)
#define FLEXPWM3_SM1INTEN (IMXRT_FLEXPWM3.SM[1].INTEN)
#define FLEXPWM3_SM1DMAEN (IMXRT_FLEXPWM3.SM[1].DMAEN)
#define FLEXPWM3_SM1TCTRL (IMXRT_FLEXPWM3.SM[1].TCTRL)
#define FLEXPWM3_SM1DISMAP0 (IMXRT_FLEXPWM3.SM[1].DISMAP0)
#define FLEXPWM3_SM1DISMAP1 (IMXRT_FLEXPWM3.SM[1].DISMAP1)
#define FLEXPWM3_SM1DTCNT0 (IMXRT_FLEXPWM3.SM[1].DTCNT0)
#define FLEXPWM3_SM1DTCNT1 (IMXRT_FLEXPWM3.SM[1].DTCNT1)
#define FLEXPWM3_SM1CAPTCTRLA (IMXRT_FLEXPWM3.SM[1].CAPTCTRLA)
#define FLEXPWM3_SM1CAPTCOMPA (IMXRT_FLEXPWM3.SM[1].CAPTCOMPA)
#define FLEXPWM3_SM1CAPTCTRLB (IMXRT_FLEXPWM3.SM[1].CAPTCTRLB)
#define FLEXPWM3_SM1CAPTCOMPB (IMXRT_FLEXPWM3.SM[1].CAPTCOMPB)
#define FLEXPWM3_SM1CAPTCTRLX (IMXRT_FLEXPWM3.SM[1].CAPTCTRLX)
#define FLEXPWM3_SM1CAPTCOMPX (IMXRT_FLEXPWM3.SM[1].CAPTCOMPX)
#define FLEXPWM3_SM1CVAL0 (IMXRT_FLEXPWM3.SM[1].CVAL0)
#define FLEXPWM3_SM1CVAL0CYC (IMXRT_FLEXPWM3.SM[1].CVAL0CYC)
#define FLEXPWM3_SM1CVAL1 (IMXRT_FLEXPWM3.SM[1].CVAL1)
#define FLEXPWM3_SM1CVAL1CYC (IMXRT_FLEXPWM3.SM[1].CVAL1CYC)
#define FLEXPWM3_SM1CVAL2 (IMXRT_FLEXPWM3.SM[1].CVAL2)
#define FLEXPWM3_SM1CVAL2CYC (IMXRT_FLEXPWM3.SM[1].CVAL2CYC)
#define FLEXPWM3_SM1CVAL3 (IMXRT_FLEXPWM3.SM[1].CVAL3)
#define FLEXPWM3_SM1CVAL3CYC (IMXRT_FLEXPWM3.SM[1].CVAL3CYC)
#define FLEXPWM3_SM1CVAL4 (IMXRT_FLEXPWM3.SM[1].CVAL4)
#define FLEXPWM3_SM1CVAL4CYC (IMXRT_FLEXPWM3.SM[1].CVAL4CYC)
#define FLEXPWM3_SM1CVAL5 (IMXRT_FLEXPWM3.SM[1].CVAL5)
#define FLEXPWM3_SM1CVAL5CYC (IMXRT_FLEXPWM3.SM[1].CVAL5CYC)
#define FLEXPWM3_SM2CNT (IMXRT_FLEXPWM3.SM[2].CNT)
#define FLEXPWM3_SM2INIT (IMXRT_FLEXPWM3.SM[2].INIT)
#define FLEXPWM3_SM2CTRL2 (IMXRT_FLEXPWM3.SM[2].CTRL2)
#define FLEXPWM3_SM2CTRL (IMXRT_FLEXPWM3.SM[2].CTRL)
#define FLEXPWM3_SM2VAL0 (IMXRT_FLEXPWM3.SM[2].VAL0)
#define FLEXPWM3_SM2FRACVAL1 (IMXRT_FLEXPWM3.SM[2].FRACVAL1)
#define FLEXPWM3_SM2VAL1 (IMXRT_FLEXPWM3.SM[2].VAL1)
#define FLEXPWM3_SM2FRACVAL2 (IMXRT_FLEXPWM3.SM[2].FRACVAL2)
#define FLEXPWM3_SM2VAL2 (IMXRT_FLEXPWM3.SM[2].VAL2)
#define FLEXPWM3_SM2FRACVAL3 (IMXRT_FLEXPWM3.SM[2].FRACVAL3)
#define FLEXPWM3_SM2VAL3 (IMXRT_FLEXPWM3.SM[2].VAL3)
#define FLEXPWM3_SM2FRACVAL4 (IMXRT_FLEXPWM3.SM[2].FRACVAL4)
#define FLEXPWM3_SM2VAL4 (IMXRT_FLEXPWM3.SM[2].VAL4)
#define FLEXPWM3_SM2FRACVAL5 (IMXRT_FLEXPWM3.SM[2].FRACVAL5)
#define FLEXPWM3_SM2VAL5 (IMXRT_FLEXPWM3.SM[2].VAL5)
#define FLEXPWM3_SM2FRCTRL (IMXRT_FLEXPWM3.SM[2].FRCTRL)
#define FLEXPWM3_SM2OCTRL (IMXRT_FLEXPWM3.SM[2].OCTRL)
#define FLEXPWM3_SM2STS (IMXRT_FLEXPWM3.SM[2].STS)
#define FLEXPWM3_SM2INTEN (IMXRT_FLEXPWM3.SM[2].INTEN)
#define FLEXPWM3_SM2DMAEN (IMXRT_FLEXPWM3.SM[2].DMAEN)
#define FLEXPWM3_SM2TCTRL (IMXRT_FLEXPWM3.SM[2].TCTRL)
#define FLEXPWM3_SM2DISMAP0 (IMXRT_FLEXPWM3.SM[2].DISMAP0)
#define FLEXPWM3_SM2DISMAP1 (IMXRT_FLEXPWM3.SM[2].DISMAP1)
#define FLEXPWM3_SM2DTCNT0 (IMXRT_FLEXPWM3.SM[2].DTCNT0)
#define FLEXPWM3_SM2DTCNT1 (IMXRT_FLEXPWM3.SM[2].DTCNT1)
#define FLEXPWM3_SM2CAPTCTRLA (IMXRT_FLEXPWM3.SM[2].CAPTCTRLA)
#define FLEXPWM3_SM2CAPTCOMPA (IMXRT_FLEXPWM3.SM[2].CAPTCOMPA)
#define FLEXPWM3_SM2CAPTCTRLB (IMXRT_FLEXPWM3.SM[2].CAPTCTRLB)
#define FLEXPWM3_SM2CAPTCOMPB (IMXRT_FLEXPWM3.SM[2].CAPTCOMPB)
#define FLEXPWM3_SM2CAPTCTRLX (IMXRT_FLEXPWM3.SM[2].CAPTCTRLX)
#define FLEXPWM3_SM2CAPTCOMPX (IMXRT_FLEXPWM3.SM[2].CAPTCOMPX)
#define FLEXPWM3_SM2CVAL0 (IMXRT_FLEXPWM3.SM[2].CVAL0)
#define FLEXPWM3_SM2CVAL0CYC (IMXRT_FLEXPWM3.SM[2].CVAL0CYC)
#define FLEXPWM3_SM2CVAL1 (IMXRT_FLEXPWM3.SM[2].CVAL1)
#define FLEXPWM3_SM2CVAL1CYC (IMXRT_FLEXPWM3.SM[2].CVAL1CYC)
#define FLEXPWM3_SM2CVAL2 (IMXRT_FLEXPWM3.SM[2].CVAL2)
#define FLEXPWM3_SM2CVAL2CYC (IMXRT_FLEXPWM3.SM[2].CVAL2CYC)
#define FLEXPWM3_SM2CVAL3 (IMXRT_FLEXPWM3.SM[2].CVAL3)
#define FLEXPWM3_SM2CVAL3CYC (IMXRT_FLEXPWM3.SM[2].CVAL3CYC)
#define FLEXPWM3_SM2CVAL4 (IMXRT_FLEXPWM3.SM[2].CVAL4)
#define FLEXPWM3_SM2CVAL4CYC (IMXRT_FLEXPWM3.SM[2].CVAL4CYC)
#define FLEXPWM3_SM2CVAL5 (IMXRT_FLEXPWM3.SM[2].CVAL5)
#define FLEXPWM3_SM2CVAL5CYC (IMXRT_FLEXPWM3.SM[2].CVAL5CYC)
#define FLEXPWM3_SM3CNT (IMXRT_FLEXPWM3.SM[3].CNT)
#define FLEXPWM3_SM3INIT (IMXRT_FLEXPWM3.SM[3].INIT)
#define FLEXPWM3_SM3CTRL2 (IMXRT_FLEXPWM3.SM[3].CTRL2)
#define FLEXPWM3_SM3CTRL (IMXRT_FLEXPWM3.SM[3].CTRL)
#define FLEXPWM3_SM3VAL0 (IMXRT_FLEXPWM3.SM[3].VAL0)
#define FLEXPWM3_SM3FRACVAL1 (IMXRT_FLEXPWM3.SM[3].FRACVAL1)
#define FLEXPWM3_SM3VAL1 (IMXRT_FLEXPWM3.SM[3].VAL1)
#define FLEXPWM3_SM3FRACVAL2 (IMXRT_FLEXPWM3.SM[3].FRACVAL2)
#define FLEXPWM3_SM3VAL2 (IMXRT_FLEXPWM3.SM[3].VAL2)
#define FLEXPWM3_SM3FRACVAL3 (IMXRT_FLEXPWM3.SM[3].FRACVAL3)
#define FLEXPWM3_SM3VAL3 (IMXRT_FLEXPWM3.SM[3].VAL3)
#define FLEXPWM3_SM3FRACVAL4 (IMXRT_FLEXPWM3.SM[3].FRACVAL4)
#define FLEXPWM3_SM3VAL4 (IMXRT_FLEXPWM3.SM[3].VAL4)
#define FLEXPWM3_SM3FRACVAL5 (IMXRT_FLEXPWM3.SM[3].FRACVAL5)
#define FLEXPWM3_SM3VAL5 (IMXRT_FLEXPWM3.SM[3].VAL5)
#define FLEXPWM3_SM3FRCTRL (IMXRT_FLEXPWM3.SM[3].FRCTRL)
#define FLEXPWM3_SM3OCTRL (IMXRT_FLEXPWM3.SM[3].OCTRL)
#define FLEXPWM3_SM3STS (IMXRT_FLEXPWM3.SM[3].STS)
#define FLEXPWM3_SM3INTEN (IMXRT_FLEXPWM3.SM[3].INTEN)
#define FLEXPWM3_SM3DMAEN (IMXRT_FLEXPWM3.SM[3].DMAEN)
#define FLEXPWM3_SM3TCTRL (IMXRT_FLEXPWM3.SM[3].TCTRL)
#define FLEXPWM3_SM3DISMAP0 (IMXRT_FLEXPWM3.SM[3].DISMAP0)
#define FLEXPWM3_SM3DISMAP1 (IMXRT_FLEXPWM3.SM[3].DISMAP1)
#define FLEXPWM3_SM3DTCNT0 (IMXRT_FLEXPWM3.SM[3].DTCNT0)
#define FLEXPWM3_SM3DTCNT1 (IMXRT_FLEXPWM3.SM[3].DTCNT1)
#define FLEXPWM3_SM3CAPTCTRLA (IMXRT_FLEXPWM3.SM[3].CAPTCTRLA)
#define FLEXPWM3_SM3CAPTCOMPA (IMXRT_FLEXPWM3.SM[3].CAPTCOMPA)
#define FLEXPWM3_SM3CAPTCTRLB (IMXRT_FLEXPWM3.SM[3].CAPTCTRLB)
#define FLEXPWM3_SM3CAPTCOMPB (IMXRT_FLEXPWM3.SM[3].CAPTCOMPB)
#define FLEXPWM3_SM3CAPTCTRLX (IMXRT_FLEXPWM3.SM[3].CAPTCTRLX)
#define FLEXPWM3_SM3CAPTCOMPX (IMXRT_FLEXPWM3.SM[3].CAPTCOMPX)
#define FLEXPWM3_SM3CVAL0 (IMXRT_FLEXPWM3.SM[3].CVAL0)
#define FLEXPWM3_SM3CVAL0CYC (IMXRT_FLEXPWM3.SM[3].CVAL0CYC)
#define FLEXPWM3_SM3CVAL1 (IMXRT_FLEXPWM3.SM[3].CVAL1)
#define FLEXPWM3_SM3CVAL1CYC (IMXRT_FLEXPWM3.SM[3].CVAL1CYC)
#define FLEXPWM3_SM3CVAL2 (IMXRT_FLEXPWM3.SM[3].CVAL2)
#define FLEXPWM3_SM3CVAL2CYC (IMXRT_FLEXPWM3.SM[3].CVAL2CYC)
#define FLEXPWM3_SM3CVAL3 (IMXRT_FLEXPWM3.SM[3].CVAL3)
#define FLEXPWM3_SM3CVAL3CYC (IMXRT_FLEXPWM3.SM[3].CVAL3CYC)
#define FLEXPWM3_SM3CVAL4 (IMXRT_FLEXPWM3.SM[3].CVAL4)
#define FLEXPWM3_SM3CVAL4CYC (IMXRT_FLEXPWM3.SM[3].CVAL4CYC)
#define FLEXPWM3_SM3CVAL5 (IMXRT_FLEXPWM3.SM[3].CVAL5)
#define FLEXPWM3_SM3CVAL5CYC (IMXRT_FLEXPWM3.SM[3].CVAL5CYC)
#define FLEXPWM3_OUTEN (IMXRT_FLEXPWM3.OUTEN)
#define FLEXPWM3_MASK (IMXRT_FLEXPWM3.MASK)
#define FLEXPWM3_SWCOUT (IMXRT_FLEXPWM3.SWCOUT)
#define FLEXPWM3_DTSRCSEL (IMXRT_FLEXPWM3.DTSRCSEL)
#define FLEXPWM3_MCTRL (IMXRT_FLEXPWM3.MCTRL)
#define FLEXPWM3_MCTRL2 (IMXRT_FLEXPWM3.MCTRL2)
#define FLEXPWM3_FCTRL0 (IMXRT_FLEXPWM3.FCTRL0)
#define FLEXPWM3_FSTS0 (IMXRT_FLEXPWM3.FSTS0)
#define FLEXPWM3_FFILT0 (IMXRT_FLEXPWM3.FFILT0)
#define FLEXPWM3_FTST0 (IMXRT_FLEXPWM3.FTST0)
#define FLEXPWM3_FCTRL20 (IMXRT_FLEXPWM3.FCTRL20)
#define FLEXPWM4_SM0CNT (IMXRT_FLEXPWM4.SM[0].CNT)
#define FLEXPWM4_SM0INIT (IMXRT_FLEXPWM4.SM[0].INIT)
#define FLEXPWM4_SM0CTRL2 (IMXRT_FLEXPWM4.SM[0].CTRL2)
#define FLEXPWM4_SM0CTRL (IMXRT_FLEXPWM4.SM[0].CTRL)
#define FLEXPWM4_SM0VAL0 (IMXRT_FLEXPWM4.SM[0].VAL0)
#define FLEXPWM4_SM0FRACVAL1 (IMXRT_FLEXPWM4.SM[0].FRACVAL1)
#define FLEXPWM4_SM0VAL1 (IMXRT_FLEXPWM4.SM[0].VAL1)
#define FLEXPWM4_SM0FRACVAL2 (IMXRT_FLEXPWM4.SM[0].FRACVAL2)
#define FLEXPWM4_SM0VAL2 (IMXRT_FLEXPWM4.SM[0].VAL2)
#define FLEXPWM4_SM0FRACVAL3 (IMXRT_FLEXPWM4.SM[0].FRACVAL3)
#define FLEXPWM4_SM0VAL3 (IMXRT_FLEXPWM4.SM[0].VAL3)
#define FLEXPWM4_SM0FRACVAL4 (IMXRT_FLEXPWM4.SM[0].FRACVAL4)
#define FLEXPWM4_SM0VAL4 (IMXRT_FLEXPWM4.SM[0].VAL4)
#define FLEXPWM4_SM0FRACVAL5 (IMXRT_FLEXPWM4.SM[0].FRACVAL5)
#define FLEXPWM4_SM0VAL5 (IMXRT_FLEXPWM4.SM[0].VAL5)
#define FLEXPWM4_SM0FRCTRL (IMXRT_FLEXPWM4.SM[0].FRCTRL)
#define FLEXPWM4_SM0OCTRL (IMXRT_FLEXPWM4.SM[0].OCTRL)
#define FLEXPWM4_SM0STS (IMXRT_FLEXPWM4.SM[0].STS)
#define FLEXPWM4_SM0INTEN (IMXRT_FLEXPWM4.SM[0].INTEN)
#define FLEXPWM4_SM0DMAEN (IMXRT_FLEXPWM4.SM[0].DMAEN)
#define FLEXPWM4_SM0TCTRL (IMXRT_FLEXPWM4.SM[0].TCTRL)
#define FLEXPWM4_SM0DISMAP0 (IMXRT_FLEXPWM4.SM[0].DISMAP0)
#define FLEXPWM4_SM0DISMAP1 (IMXRT_FLEXPWM4.SM[0].DISMAP1)
#define FLEXPWM4_SM0DTCNT0 (IMXRT_FLEXPWM4.SM[0].DTCNT0)
#define FLEXPWM4_SM0DTCNT1 (IMXRT_FLEXPWM4.SM[0].DTCNT1)
#define FLEXPWM4_SM0CAPTCTRLA (IMXRT_FLEXPWM4.SM[0].CAPTCTRLA)
#define FLEXPWM4_SM0CAPTCOMPA (IMXRT_FLEXPWM4.SM[0].CAPTCOMPA)
#define FLEXPWM4_SM0CAPTCTRLB (IMXRT_FLEXPWM4.SM[0].CAPTCTRLB)
#define FLEXPWM4_SM0CAPTCOMPB (IMXRT_FLEXPWM4.SM[0].CAPTCOMPB)
#define FLEXPWM4_SM0CAPTCTRLX (IMXRT_FLEXPWM4.SM[0].CAPTCTRLX)
#define FLEXPWM4_SM0CAPTCOMPX (IMXRT_FLEXPWM4.SM[0].CAPTCOMPX)
#define FLEXPWM4_SM0CVAL0 (IMXRT_FLEXPWM4.SM[0].CVAL0)
#define FLEXPWM4_SM0CVAL0CYC (IMXRT_FLEXPWM4.SM[0].CVAL0CYC)
#define FLEXPWM4_SM0CVAL1 (IMXRT_FLEXPWM4.SM[0].CVAL1)
#define FLEXPWM4_SM0CVAL1CYC (IMXRT_FLEXPWM4.SM[0].CVAL1CYC)
#define FLEXPWM4_SM0CVAL2 (IMXRT_FLEXPWM4.SM[0].CVAL2)
#define FLEXPWM4_SM0CVAL2CYC (IMXRT_FLEXPWM4.SM[0].CVAL2CYC)
#define FLEXPWM4_SM0CVAL3 (IMXRT_FLEXPWM4.SM[0].CVAL3)
#define FLEXPWM4_SM0CVAL3CYC (IMXRT_FLEXPWM4.SM[0].CVAL3CYC)
#define FLEXPWM4_SM0CVAL4 (IMXRT_FLEXPWM4.SM[0].CVAL4)
#define FLEXPWM4_SM0CVAL4CYC (IMXRT_FLEXPWM4.SM[0].CVAL4CYC)
#define FLEXPWM4_SM0CVAL5 (IMXRT_FLEXPWM4.SM[0].CVAL5)
#define FLEXPWM4_SM0CVAL5CYC (IMXRT_FLEXPWM4.SM[0].CVAL5CYC)
#define FLEXPWM4_SM1CNT (IMXRT_FLEXPWM4.SM[1].CNT)
#define FLEXPWM4_SM1INIT (IMXRT_FLEXPWM4.SM[1].INIT)
#define FLEXPWM4_SM1CTRL2 (IMXRT_FLEXPWM4.SM[1].CTRL2)
#define FLEXPWM4_SM1CTRL (IMXRT_FLEXPWM4.SM[1].CTRL)
#define FLEXPWM4_SM1VAL0 (IMXRT_FLEXPWM4.SM[1].VAL0)
#define FLEXPWM4_SM1FRACVAL1 (IMXRT_FLEXPWM4.SM[1].FRACVAL1)
#define FLEXPWM4_SM1VAL1 (IMXRT_FLEXPWM4.SM[1].VAL1)
#define FLEXPWM4_SM1FRACVAL2 (IMXRT_FLEXPWM4.SM[1].FRACVAL2)
#define FLEXPWM4_SM1VAL2 (IMXRT_FLEXPWM4.SM[1].VAL2)
#define FLEXPWM4_SM1FRACVAL3 (IMXRT_FLEXPWM4.SM[1].FRACVAL3)
#define FLEXPWM4_SM1VAL3 (IMXRT_FLEXPWM4.SM[1].VAL3)
#define FLEXPWM4_SM1FRACVAL4 (IMXRT_FLEXPWM4.SM[1].FRACVAL4)
#define FLEXPWM4_SM1VAL4 (IMXRT_FLEXPWM4.SM[1].VAL4)
#define FLEXPWM4_SM1FRACVAL5 (IMXRT_FLEXPWM4.SM[1].FRACVAL5)
#define FLEXPWM4_SM1VAL5 (IMXRT_FLEXPWM4.SM[1].VAL5)
#define FLEXPWM4_SM1FRCTRL (IMXRT_FLEXPWM4.SM[1].FRCTRL)
#define FLEXPWM4_SM1OCTRL (IMXRT_FLEXPWM4.SM[1].OCTRL)
#define FLEXPWM4_SM1STS (IMXRT_FLEXPWM4.SM[1].STS)
#define FLEXPWM4_SM1INTEN (IMXRT_FLEXPWM4.SM[1].INTEN)
#define FLEXPWM4_SM1DMAEN (IMXRT_FLEXPWM4.SM[1].DMAEN)
#define FLEXPWM4_SM1TCTRL (IMXRT_FLEXPWM4.SM[1].TCTRL)
#define FLEXPWM4_SM1DISMAP0 (IMXRT_FLEXPWM4.SM[1].DISMAP0)
#define FLEXPWM4_SM1DISMAP1 (IMXRT_FLEXPWM4.SM[1].DISMAP1)
#define FLEXPWM4_SM1DTCNT0 (IMXRT_FLEXPWM4.SM[1].DTCNT0)
#define FLEXPWM4_SM1DTCNT1 (IMXRT_FLEXPWM4.SM[1].DTCNT1)
#define FLEXPWM4_SM1CAPTCTRLA (IMXRT_FLEXPWM4.SM[1].CAPTCTRLA)
#define FLEXPWM4_SM1CAPTCOMPA (IMXRT_FLEXPWM4.SM[1].CAPTCOMPA)
#define FLEXPWM4_SM1CAPTCTRLB (IMXRT_FLEXPWM4.SM[1].CAPTCTRLB)
#define FLEXPWM4_SM1CAPTCOMPB (IMXRT_FLEXPWM4.SM[1].CAPTCOMPB)
#define FLEXPWM4_SM1CAPTCTRLX (IMXRT_FLEXPWM4.SM[1].CAPTCTRLX)
#define FLEXPWM4_SM1CAPTCOMPX (IMXRT_FLEXPWM4.SM[1].CAPTCOMPX)
#define FLEXPWM4_SM1CVAL0 (IMXRT_FLEXPWM4.SM[1].CVAL0)
#define FLEXPWM4_SM1CVAL0CYC (IMXRT_FLEXPWM4.SM[1].CVAL0CYC)
#define FLEXPWM4_SM1CVAL1 (IMXRT_FLEXPWM4.SM[1].CVAL1)
#define FLEXPWM4_SM1CVAL1CYC (IMXRT_FLEXPWM4.SM[1].CVAL1CYC)
#define FLEXPWM4_SM1CVAL2 (IMXRT_FLEXPWM4.SM[1].CVAL2)
#define FLEXPWM4_SM1CVAL2CYC (IMXRT_FLEXPWM4.SM[1].CVAL2CYC)
#define FLEXPWM4_SM1CVAL3 (IMXRT_FLEXPWM4.SM[1].CVAL3)
#define FLEXPWM4_SM1CVAL3CYC (IMXRT_FLEXPWM4.SM[1].CVAL3CYC)
#define FLEXPWM4_SM1CVAL4 (IMXRT_FLEXPWM4.SM[1].CVAL4)
#define FLEXPWM4_SM1CVAL4CYC (IMXRT_FLEXPWM4.SM[1].CVAL4CYC)
#define FLEXPWM4_SM1CVAL5 (IMXRT_FLEXPWM4.SM[1].CVAL5)
#define FLEXPWM4_SM1CVAL5CYC (IMXRT_FLEXPWM4.SM[1].CVAL5CYC)
#define FLEXPWM4_SM2CNT (IMXRT_FLEXPWM4.SM[2].CNT)
#define FLEXPWM4_SM2INIT (IMXRT_FLEXPWM4.SM[2].INIT)
#define FLEXPWM4_SM2CTRL2 (IMXRT_FLEXPWM4.SM[2].CTRL2)
#define FLEXPWM4_SM2CTRL (IMXRT_FLEXPWM4.SM[2].CTRL)
#define FLEXPWM4_SM2VAL0 (IMXRT_FLEXPWM4.SM[2].VAL0)
#define FLEXPWM4_SM2FRACVAL1 (IMXRT_FLEXPWM4.SM[2].FRACVAL1)
#define FLEXPWM4_SM2VAL1 (IMXRT_FLEXPWM4.SM[2].VAL1)
#define FLEXPWM4_SM2FRACVAL2 (IMXRT_FLEXPWM4.SM[2].FRACVAL2)
#define FLEXPWM4_SM2VAL2 (IMXRT_FLEXPWM4.SM[2].VAL2)
#define FLEXPWM4_SM2FRACVAL3 (IMXRT_FLEXPWM4.SM[2].FRACVAL3)
#define FLEXPWM4_SM2VAL3 (IMXRT_FLEXPWM4.SM[2].VAL3)
#define FLEXPWM4_SM2FRACVAL4 (IMXRT_FLEXPWM4.SM[2].FRACVAL4)
#define FLEXPWM4_SM2VAL4 (IMXRT_FLEXPWM4.SM[2].VAL4)
#define FLEXPWM4_SM2FRACVAL5 (IMXRT_FLEXPWM4.SM[2].FRACVAL5)
#define FLEXPWM4_SM2VAL5 (IMXRT_FLEXPWM4.SM[2].VAL5)
#define FLEXPWM4_SM2FRCTRL (IMXRT_FLEXPWM4.SM[2].FRCTRL)
#define FLEXPWM4_SM2OCTRL (IMXRT_FLEXPWM4.SM[2].OCTRL)
#define FLEXPWM4_SM2STS (IMXRT_FLEXPWM4.SM[2].STS)
#define FLEXPWM4_SM2INTEN (IMXRT_FLEXPWM4.SM[2].INTEN)
#define FLEXPWM4_SM2DMAEN (IMXRT_FLEXPWM4.SM[2].DMAEN)
#define FLEXPWM4_SM2TCTRL (IMXRT_FLEXPWM4.SM[2].TCTRL)
#define FLEXPWM4_SM2DISMAP0 (IMXRT_FLEXPWM4.SM[2].DISMAP0)
#define FLEXPWM4_SM2DISMAP1 (IMXRT_FLEXPWM4.SM[2].DISMAP1)
#define FLEXPWM4_SM2DTCNT0 (IMXRT_FLEXPWM4.SM[2].DTCNT0)
#define FLEXPWM4_SM2DTCNT1 (IMXRT_FLEXPWM4.SM[2].DTCNT1)
#define FLEXPWM4_SM2CAPTCTRLA (IMXRT_FLEXPWM4.SM[2].CAPTCTRLA)
#define FLEXPWM4_SM2CAPTCOMPA (IMXRT_FLEXPWM4.SM[2].CAPTCOMPA)
#define FLEXPWM4_SM2CAPTCTRLB (IMXRT_FLEXPWM4.SM[2].CAPTCTRLB)
#define FLEXPWM4_SM2CAPTCOMPB (IMXRT_FLEXPWM4.SM[2].CAPTCOMPB)
#define FLEXPWM4_SM2CAPTCTRLX (IMXRT_FLEXPWM4.SM[2].CAPTCTRLX)
#define FLEXPWM4_SM2CAPTCOMPX (IMXRT_FLEXPWM4.SM[2].CAPTCOMPX)
#define FLEXPWM4_SM2CVAL0 (IMXRT_FLEXPWM4.SM[2].CVAL0)
#define FLEXPWM4_SM2CVAL0CYC (IMXRT_FLEXPWM4.SM[2].CVAL0CYC)
#define FLEXPWM4_SM2CVAL1 (IMXRT_FLEXPWM4.SM[2].CVAL1)
#define FLEXPWM4_SM2CVAL1CYC (IMXRT_FLEXPWM4.SM[2].CVAL1CYC)
#define FLEXPWM4_SM2CVAL2 (IMXRT_FLEXPWM4.SM[2].CVAL2)
#define FLEXPWM4_SM2CVAL2CYC (IMXRT_FLEXPWM4.SM[2].CVAL2CYC)
#define FLEXPWM4_SM2CVAL3 (IMXRT_FLEXPWM4.SM[2].CVAL3)
#define FLEXPWM4_SM2CVAL3CYC (IMXRT_FLEXPWM4.SM[2].CVAL3CYC)
#define FLEXPWM4_SM2CVAL4 (IMXRT_FLEXPWM4.SM[2].CVAL4)
#define FLEXPWM4_SM2CVAL4CYC (IMXRT_FLEXPWM4.SM[2].CVAL4CYC)
#define FLEXPWM4_SM2CVAL5 (IMXRT_FLEXPWM4.SM[2].CVAL5)
#define FLEXPWM4_SM2CVAL5CYC (IMXRT_FLEXPWM4.SM[2].CVAL5CYC)
#define FLEXPWM4_SM3CNT (IMXRT_FLEXPWM4.SM[3].CNT)
#define FLEXPWM4_SM3INIT (IMXRT_FLEXPWM4.SM[3].INIT)
#define FLEXPWM4_SM3CTRL2 (IMXRT_FLEXPWM4.SM[3].CTRL2)
#define FLEXPWM4_SM3CTRL (IMXRT_FLEXPWM4.SM[3].CTRL)
#define FLEXPWM4_SM3VAL0 (IMXRT_FLEXPWM4.SM[3].VAL0)
#define FLEXPWM4_SM3FRACVAL1 (IMXRT_FLEXPWM4.SM[3].FRACVAL1)
#define FLEXPWM4_SM3VAL1 (IMXRT_FLEXPWM4.SM[3].VAL1)
#define FLEXPWM4_SM3FRACVAL2 (IMXRT_FLEXPWM4.SM[3].FRACVAL2)
#define FLEXPWM4_SM3VAL2 (IMXRT_FLEXPWM4.SM[3].VAL2)
#define FLEXPWM4_SM3FRACVAL3 (IMXRT_FLEXPWM4.SM[3].FRACVAL3)
#define FLEXPWM4_SM3VAL3 (IMXRT_FLEXPWM4.SM[3].VAL3)
#define FLEXPWM4_SM3FRACVAL4 (IMXRT_FLEXPWM4.SM[3].FRACVAL4)
#define FLEXPWM4_SM3VAL4 (IMXRT_FLEXPWM4.SM[3].VAL4)
#define FLEXPWM4_SM3FRACVAL5 (IMXRT_FLEXPWM4.SM[3].FRACVAL5)
#define FLEXPWM4_SM3VAL5 (IMXRT_FLEXPWM4.SM[3].VAL5)
#define FLEXPWM4_SM3FRCTRL (IMXRT_FLEXPWM4.SM[3].FRCTRL)
#define FLEXPWM4_SM3OCTRL (IMXRT_FLEXPWM4.SM[3].OCTRL)
#define FLEXPWM4_SM3STS (IMXRT_FLEXPWM4.SM[3].STS)
#define FLEXPWM4_SM3INTEN (IMXRT_FLEXPWM4.SM[3].INTEN)
#define FLEXPWM4_SM3DMAEN (IMXRT_FLEXPWM4.SM[3].DMAEN)
#define FLEXPWM4_SM3TCTRL (IMXRT_FLEXPWM4.SM[3].TCTRL)
#define FLEXPWM4_SM3DISMAP0 (IMXRT_FLEXPWM4.SM[3].DISMAP0)
#define FLEXPWM4_SM3DISMAP1 (IMXRT_FLEXPWM4.SM[3].DISMAP1)
#define FLEXPWM4_SM3DTCNT0 (IMXRT_FLEXPWM4.SM[3].DTCNT0)
#define FLEXPWM4_SM3DTCNT1 (IMXRT_FLEXPWM4.SM[3].DTCNT1)
#define FLEXPWM4_SM3CAPTCTRLA (IMXRT_FLEXPWM4.SM[3].CAPTCTRLA)
#define FLEXPWM4_SM3CAPTCOMPA (IMXRT_FLEXPWM4.SM[3].CAPTCOMPA)
#define FLEXPWM4_SM3CAPTCTRLB (IMXRT_FLEXPWM4.SM[3].CAPTCTRLB)
#define FLEXPWM4_SM3CAPTCOMPB (IMXRT_FLEXPWM4.SM[3].CAPTCOMPB)
#define FLEXPWM4_SM3CAPTCTRLX (IMXRT_FLEXPWM4.SM[3].CAPTCTRLX)
#define FLEXPWM4_SM3CAPTCOMPX (IMXRT_FLEXPWM4.SM[3].CAPTCOMPX)
#define FLEXPWM4_SM3CVAL0 (IMXRT_FLEXPWM4.SM[3].CVAL0)
#define FLEXPWM4_SM3CVAL0CYC (IMXRT_FLEXPWM4.SM[3].CVAL0CYC)
#define FLEXPWM4_SM3CVAL1 (IMXRT_FLEXPWM4.SM[3].CVAL1)
#define FLEXPWM4_SM3CVAL1CYC (IMXRT_FLEXPWM4.SM[3].CVAL1CYC)
#define FLEXPWM4_SM3CVAL2 (IMXRT_FLEXPWM4.SM[3].CVAL2)
#define FLEXPWM4_SM3CVAL2CYC (IMXRT_FLEXPWM4.SM[3].CVAL2CYC)
#define FLEXPWM4_SM3CVAL3 (IMXRT_FLEXPWM4.SM[3].CVAL3)
#define FLEXPWM4_SM3CVAL3CYC (IMXRT_FLEXPWM4.SM[3].CVAL3CYC)
#define FLEXPWM4_SM3CVAL4 (IMXRT_FLEXPWM4.SM[3].CVAL4)
#define FLEXPWM4_SM3CVAL4CYC (IMXRT_FLEXPWM4.SM[3].CVAL4CYC)
#define FLEXPWM4_SM3CVAL5 (IMXRT_FLEXPWM4.SM[3].CVAL5)
#define FLEXPWM4_SM3CVAL5CYC (IMXRT_FLEXPWM4.SM[3].CVAL5CYC)
#define FLEXPWM4_OUTEN (IMXRT_FLEXPWM4.OUTEN)
#define FLEXPWM4_MASK (IMXRT_FLEXPWM4.MASK)
#define FLEXPWM4_SWCOUT (IMXRT_FLEXPWM4.SWCOUT)
#define FLEXPWM4_DTSRCSEL (IMXRT_FLEXPWM4.DTSRCSEL)
#define FLEXPWM4_MCTRL (IMXRT_FLEXPWM4.MCTRL)
#define FLEXPWM4_MCTRL2 (IMXRT_FLEXPWM4.MCTRL2)
#define FLEXPWM4_FCTRL0 (IMXRT_FLEXPWM4.FCTRL0)
#define FLEXPWM4_FSTS0 (IMXRT_FLEXPWM4.FSTS0)
#define FLEXPWM4_FFILT0 (IMXRT_FLEXPWM4.FFILT0)
#define FLEXPWM4_FTST0 (IMXRT_FLEXPWM4.FTST0)
#define FLEXPWM4_FCTRL20 (IMXRT_FLEXPWM4.FCTRL20)
// page 1361
#define FLEXPWM_SMCTRL2_DBGEN ((uint16_t)(1 << 15))
#define FLEXPWM_SMCTRL2_WAITEN ((uint16_t)(1 << 14))
#define FLEXPWM_SMCTRL2_INDEP ((uint16_t)(1 << 13))
#define FLEXPWM_SMCTRL2_PWM23_INIT ((uint16_t)(1 << 12))
#define FLEXPWM_SMCTRL2_PWM45_INIT ((uint16_t)(1 << 11))
#define FLEXPWM_SMCTRL2_PWMX_INIT ((uint16_t)(1 << 10))
#define FLEXPWM_SMCTRL2_INIT_SEL(n) ((uint16_t)(((n)&0x03) << 8))
#define FLEXPWM_SMCTRL2_FRCEN ((uint16_t)(1 << 7))
#define FLEXPWM_SMCTRL2_FORCE ((uint16_t)(1 << 6))
#define FLEXPWM_SMCTRL2_FORCE_SEL(n) ((uint16_t)(((n)&0x07) << 3))
#define FLEXPWM_SMCTRL2_RELOAD_SEL ((uint16_t)(1 << 2))
#define FLEXPWM_SMCTRL2_CLK_SEL(n) ((uint16_t)(((n)&0x03) << 0))
#define FLEXPWM_SMCTRL_LDFQ(n) ((uint16_t)(((n)&0x0F) << 12))
#define FLEXPWM_SMCTRL_HALF ((uint16_t)(1 << 11))
#define FLEXPWM_SMCTRL_FULL ((uint16_t)(1 << 10))
#define FLEXPWM_SMCTRL_DT(n) ((uint16_t)(((n)&0x03) << 8))
#define FLEXPWM_SMCTRL_COMPMODE ((uint16_t)(1 << 7))
#define FLEXPWM_SMCTRL_PRSC(n) ((uint16_t)(((n)&0x0F) << 4))
#define FLEXPWM_SMCTRL_SPLIT ((uint16_t)(1 << 3))
#define FLEXPWM_SMCTRL_LDMOD ((uint16_t)(1 << 2))
#define FLEXPWM_SMCTRL_DBLX ((uint16_t)(1 << 1))
#define FLEXPWM_SMCTRL_DBLEN ((uint16_t)(1 << 0))
#define FLEXPWM_SMFRCTRL_TEST ((uint16_t)(1 << 15))
#define FLEXPWM_SMFRCTRL_FRAC_PU ((uint16_t)(1 << 8))
#define FLEXPWM_SMFRCTRL_FRAC45_EN ((uint16_t)(1 << 4))
#define FLEXPWM_SMFRCTRL_FRAC23_EN ((uint16_t)(1 << 2))
#define FLEXPWM_SMFRCTRL_FRAC1_EN ((uint16_t)(1 << 1))
#define FLEXPWM_SMOCTRL_PWMA_IN ((uint16_t)(1 << 15))
#define FLEXPWM_SMOCTRL_PWMB_IN ((uint16_t)(1 << 14))
#define FLEXPWM_SMOCTRL_PWMX_IN ((uint16_t)(1 << 13))
#define FLEXPWM_SMOCTRL_POLA ((uint16_t)(1 << 10))
#define FLEXPWM_SMOCTRL_POLB ((uint16_t)(1 << 9))
#define FLEXPWM_SMOCTRL_POLX ((uint16_t)(1 << 8))
#define FLEXPWM_SMOCTRL_PWMAFS(n) ((uint16_t)(((n)&0x03) << 4))
#define FLEXPWM_SMOCTRL_PWMBFS(n) ((uint16_t)(((n)&0x03) << 2))
#define FLEXPWM_SMOCTRL_PWMXFS(n) ((uint16_t)(((n)&0x03) << 0))
#define FLEXPWM_SMSTS_RUF ((uint16_t)(1 << 14))
#define FLEXPWM_SMSTS_REF ((uint16_t)(1 << 13))
#define FLEXPWM_SMSTS_RF ((uint16_t)(1 << 12))
#define FLEXPWM_SMSTS_CFA1 ((uint16_t)(1 << 11))
#define FLEXPWM_SMSTS_CFA0 ((uint16_t)(1 << 10))
#define FLEXPWM_SMSTS_CFB1 ((uint16_t)(1 << 9))
#define FLEXPWM_SMSTS_CFB0 ((uint16_t)(1 << 8))
#define FLEXPWM_SMSTS_CFX1 ((uint16_t)(1 << 7))
#define FLEXPWM_SMSTS_CFX0 ((uint16_t)(1 << 6))
#define FLEXPWM_SMSTS_CMPF(n) ((uint16_t)(((n)&0x3F) << 0))
#define FLEXPWM_SMINTEN_REIE ((uint16_t)(1 << 13))
#define FLEXPWM_SMINTEN_RIE ((uint16_t)(1 << 12))
#define FLEXPWM_SMINTEN_CA1IE ((uint16_t)(1 << 11))
#define FLEXPWM_SMINTEN_CA0IE ((uint16_t)(1 << 10))
#define FLEXPWM_SMINTEN_CB1IE ((uint16_t)(1 << 9))
#define FLEXPWM_SMINTEN_CB0IE ((uint16_t)(1 << 8))
#define FLEXPWM_SMINTEN_CX1IE ((uint16_t)(1 << 7))
#define FLEXPWM_SMINTEN_CX0IE ((uint16_t)(1 << 6))
#define FLEXPWM_SMINTEN_CMPIE(n) ((uint16_t)(((n)&0x3F) << 0))
#define FLEXPWM_SMDMAEN_VALDE ((uint16_t)(1 << 9))
#define FLEXPWM_SMDMAEN_FAND ((uint16_t)(1 << 8))
#define FLEXPWM_SMDMAEN_CAPTDE(n) ((uint16_t)(((n)&0x03) << 6))
#define FLEXPWM_SMDMAEN_CA1DE ((uint16_t)(1 << 5))
#define FLEXPWM_SMDMAEN_CA0DE ((uint16_t)(1 << 4))
#define FLEXPWM_SMDMAEN_CB1DE ((uint16_t)(1 << 3))
#define FLEXPWM_SMDMAEN_CB0DE ((uint16_t)(1 << 2))
#define FLEXPWM_SMDMAEN_CX1DE ((uint16_t)(1 << 1))
#define FLEXPWM_SMDMAEN_CX0DE ((uint16_t)(1 << 0))
#define FLEXPWM_SMTCTRL_PWAOT0 ((uint16_t)(1 << 15))
#define FLEXPWM_SMTCTRL_PWBOT1 ((uint16_t)(1 << 14))
#define FLEXPWM_SMTCTRL_TRGFRQ ((uint16_t)(1 << 12))
#define FLEXPWM_SMTCTRL_OUT_TRIG_EN(n) ((uint16_t)(((n)&0x1F) << 0))
#define FLEXPWM_SMDISMAP0_DIS0X(n) ((uint16_t)(((n)&0x0F) << 8))
#define FLEXPWM_SMDISMAP0_DIS0B(n) ((uint16_t)(((n)&0x0F) << 4))
#define FLEXPWM_SMDISMAP0_DIS0A(n) ((uint16_t)(((n)&0x0F) << 0))
#define FLEXPWM_SMDISMAP1_DIS1X(n) ((uint16_t)(((n)&0x0F) << 8))
#define FLEXPWM_SMDISMAP1_DIS1B(n) ((uint16_t)(((n)&0x0F) << 4))
#define FLEXPWM_SMDISMAP1_DIS1A(n) ((uint16_t)(((n)&0x0F) << 0))
#define FLEXPWM_SMCAPTCTRLA_CA1CNT(n) ((uint16_t)(((n)&0x07) << 13))
#define FLEXPWM_SMCAPTCTRLA_CA0CNT(n) ((uint16_t)(((n)&0x07) << 10))
#define FLEXPWM_SMCAPTCTRLA_CFAWM(n) ((uint16_t)(((n)&0x03) << 8))
#define FLEXPWM_SMCAPTCTRLA_EDGCNTA_EN ((uint16_t)(1 << 7))
#define FLEXPWM_SMCAPTCTRLA_INP_SELA ((uint16_t)(1 << 6))
#define FLEXPWM_SMCAPTCTRLA_EDGA1(n) ((uint16_t)(((n)&0x03) << 4))
#define FLEXPWM_SMCAPTCTRLA_EDGA0(n) ((uint16_t)(((n)&0x03) << 2))
#define FLEXPWM_SMCAPTCTRLA_ONESHOTA ((uint16_t)(1 << 1))
#define FLEXPWM_SMCAPTCTRLA_ARMA ((uint16_t)(1 << 0))
#define FLEXPWM_SMCAPTCOMPA_EDGCNTA(n) ((uint16_t)(((n)&0xFF) << 8))
#define FLEXPWM_SMCAPTCOMPA_EDGCMPA(n) ((uint16_t)(((n)&0xFF) << 0))
#define FLEXPWM_SMCAPTCTRLB_CB1CNT(n) ((uint16_t)(((n)&0x07) << 13))
#define FLEXPWM_SMCAPTCTRLB_CB0CNT(n) ((uint16_t)(((n)&0x07) << 10))
#define FLEXPWM_SMCAPTCTRLB_CFBWM(n) ((uint16_t)(((n)&0x03) << 8))
#define FLEXPWM_SMCAPTCTRLB_EDGCNTB_EN ((uint16_t)(1 << 7))
#define FLEXPWM_SMCAPTCTRLB_INP_SELB ((uint16_t)(1 << 6))
#define FLEXPWM_SMCAPTCTRLB_EDGB1(n) ((uint16_t)(((n)&0x03) << 4))
#define FLEXPWM_SMCAPTCTRLB_EDGB0(n) ((uint16_t)(((n)&0x03) << 2))
#define FLEXPWM_SMCAPTCTRLB_ONESHOTB ((uint16_t)(1 << 1))
#define FLEXPWM_SMCAPTCTRLB_ARMB ((uint16_t)(1 << 0))
#define FLEXPWM_SMCAPTCOMPB_EDGCNTB(n) ((uint16_t)(((n)&0xFF) << 8))
#define FLEXPWM_SMCAPTCOMPB_EDGCMPB(n) ((uint16_t)(((n)&0xFF) << 0))
#define FLEXPWM_SMCAPTCTRLX_CX1CNT(n) ((uint16_t)(((n)&0x07) << 13))
#define FLEXPWM_SMCAPTCTRLX_CX0CNT(n) ((uint16_t)(((n)&0x07) << 10))
#define FLEXPWM_SMCAPTCTRLX_CFXWM(n) ((uint16_t)(((n)&0x03) << 8))
#define FLEXPWM_SMCAPTCTRLX_EDGCNTX_EN ((uint16_t)(1 << 7))
#define FLEXPWM_SMCAPTCTRLX_INP_SELX ((uint16_t)(1 << 6))
#define FLEXPWM_SMCAPTCTRLX_EDGX1(n) ((uint16_t)(((n)&0x03) << 4))
#define FLEXPWM_SMCAPTCTRLX_EDGX0(n) ((uint16_t)(((n)&0x03) << 2))
#define FLEXPWM_SMCAPTCTRLX_ONESHOTX ((uint16_t)(1 << 1))
#define FLEXPWM_SMCAPTCTRLX_ARMX ((uint16_t)(1 << 0))
#define FLEXPWM_SMCAPTCOMPX_EDGCNTX(n) ((uint16_t)(((n)&0xFF) << 8))
