gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
#define FLEXPWM_SMCAPTCOMPX_EDGCMPX(n) ((uint16_t)(((n)&0xFF) << 0))
#define FLEXPWM_OUTEN_PWMA_EN(n) ((uint16_t)(((n)&0x0F) << 8))
#define FLEXPWM_OUTEN_PWMB_EN(n) ((uint16_t)(((n)&0x0F) << 4))
#define FLEXPWM_OUTEN_PWMX_EN(n) ((uint16_t)(((n)&0x0F) << 0))
#define FLEXPWM_MASK_UPDATE_MASK(n) ((uint16_t)(((n)&0x0F) << 12))
#define FLEXPWM_MASK_MASKA(n) ((uint16_t)(((n)&0x0F) << 8))
#define FLEXPWM_MASK_MASKB(n) ((uint16_t)(((n)&0x0F) << 4))
#define FLEXPWM_MASK_MASKX(n) ((uint16_t)(((n)&0x0F) << 0))
#define FLEXPWM_SWCOUT_SM3OUT23 ((uint16_t)(1 << 7))
#define FLEXPWM_SWCOUT_SM3OUT45 ((uint16_t)(1 << 6))
#define FLEXPWM_SWCOUT_SM2OUT23 ((uint16_t)(1 << 5))
#define FLEXPWM_SWCOUT_SM2OUT45 ((uint16_t)(1 << 4))
#define FLEXPWM_SWCOUT_SM1OUT23 ((uint16_t)(1 << 3))
#define FLEXPWM_SWCOUT_SM1OUT45 ((uint16_t)(1 << 2))
#define FLEXPWM_SWCOUT_SM0OUT23 ((uint16_t)(1 << 1))
#define FLEXPWM_SWCOUT_SM0OUT45 ((uint16_t)(1 << 0))
#define FLEXPWM_DTSRCSEL_SM3SEL23(n) ((uint16_t)(((n)&0x03) << 14))
#define FLEXPWM_DTSRCSEL_SM3SEL45(n) ((uint16_t)(((n)&0x03) << 12))
#define FLEXPWM_DTSRCSEL_SM2SEL23(n) ((uint16_t)(((n)&0x03) << 10))
#define FLEXPWM_DTSRCSEL_SM2SEL45(n) ((uint16_t)(((n)&0x03) << 8))
#define FLEXPWM_DTSRCSEL_SM1SEL23(n) ((uint16_t)(((n)&0x03) << 6))
#define FLEXPWM_DTSRCSEL_SM1SEL45(n) ((uint16_t)(((n)&0x03) << 4))
#define FLEXPWM_DTSRCSEL_SM0SEL23(n) ((uint16_t)(((n)&0x03) << 2))
#define FLEXPWM_DTSRCSEL_SM0SEL45(n) ((uint16_t)(((n)&0x03) << 0))
#define FLEXPWM_MCTRL_IPOL(n) ((uint16_t)(((n)&0x0F) << 12))
#define FLEXPWM_MCTRL_RUN(n) ((uint16_t)(((n)&0x0F) << 8))
#define FLEXPWM_MCTRL_CLDOK(n) ((uint16_t)(((n)&0x0F) << 4))
#define FLEXPWM_MCTRL_LDOK(n) ((uint16_t)(((n)&0x0F) << 0))
#define FLEXPWM_MCTRL2_MONPLL(n) ((uint16_t)(((n)&0x03) << 0))
#define FLEXPWM_FCTRL0_FLVL(n) ((uint16_t)(((n)&0x0F) << 12))
#define FLEXPWM_FCTRL0_FAUTO(n) ((uint16_t)(((n)&0x0F) << 8))
#define FLEXPWM_FCTRL0_FSAFE(n) ((uint16_t)(((n)&0x0F) << 4))
#define FLEXPWM_FCTRL0_FIE(n) ((uint16_t)(((n)&0x0F) << 0))
#define FLEXPWM_FSTS0_FHALF(n) ((uint16_t)(((n)&0x0F) << 12))
#define FLEXPWM_FSTS0_FFPIN(n) ((uint16_t)(((n)&0x0F) << 8))
#define FLEXPWM_FSTS0_FFULL(n) ((uint16_t)(((n)&0x0F) << 4))
#define FLEXPWM_FSTS0_FFLAG(n) ((uint16_t)(((n)&0x0F) << 0))
#define FLEXPWM_FFILT0_GSTR ((uint16_t)(1 << 15))
#define FLEXPWM_FFILT0_FILT_CNT(n) ((uint16_t)(((n)&0x07) << 8))
#define FLEXPWM_FFILT0_FILT_PER(n) ((uint16_t)(((n)&0xFF) << 0))
#define FLEXPWM_FTST0_FTEST ((uint16_t)(1 << 0))
#define FLEXPWM_FCTRL20_NOCOMB(n) ((uint16_t)(((n)&0x0F) << 0))

// 29.3.1.1: page 1468
#define IMXRT_FLEXRAM (*(IMXRT_REGISTER32_t *)0x400B0000)
#define FLEXRAM_TCM_CTRL (IMXRT_FLEXRAM.offset000)
#define FLEXRAM_INT_STATUS (IMXRT_FLEXRAM.offset010)
#define FLEXRAM_INT_STAT_EN (IMXRT_FLEXRAM.offset014)
#define FLEXRAM_INT_SIG_EN (IMXRT_FLEXRAM.offset018)
#define FLEXRAM_TCM_CTRL_FORCE_CLK_ON ((uint32_t)(1 << 2))
#define FLEXRAM_TCM_CTRL_TCM_RWAIT_EN ((uint32_t)(1 << 1))
#define FLEXRAM_TCM_CTRL_TCM_WWAIT_EN ((uint32_t)(1 << 0))
#define FLEXRAM_INT_STATUS_OCRAM_ERR_STATUS ((uint32_t)(1 << 5))
#define FLEXRAM_INT_STATUS_DTCM_ERR_STATUS ((uint32_t)(1 << 4))
#define FLEXRAM_INT_STATUS_ITCM_ERR_STATUS ((uint32_t)(1 << 3))
#define FLEXRAM_INT_STAT_EN_OCRAM_ERR_STAT_EN ((uint32_t)(1 << 5))
#define FLEXRAM_INT_STAT_EN_DTCM_ERR_STAT_EN ((uint32_t)(1 << 4))
#define FLEXRAM_INT_STAT_EN_ITCM_ERR_STAT_EN ((uint32_t)(1 << 3))
#define FLEXRAM_INT_SIG_EN_OCRAM_ERR_SIG_EN ((uint32_t)(1 << 5))
#define FLEXRAM_INT_SIG_EN_DTCM_ERR_SIG_EN ((uint32_t)(1 << 4))
#define FLEXRAM_INT_SIG_EN_ITCM_ERR_SIG_EN ((uint32_t)(1 << 3))

// 30.5.2.1: page 1481
#define IMXRT_FLEXSPI (*(IMXRT_REGISTER32_t *)0x402A8000)
#define FLEXSPI_MCR0 (IMXRT_FLEXSPI.offset000)
#define FLEXSPI_MCR0_AHBGRANTWAIT(n) ((uint32_t)(((n)&0xFF) << 24))
#define FLEXSPI_MCR0_AHBGRANTWAIT_MASK ((uint32_t)(0xFF << 24))
#define FLEXSPI_MCR0_IPGRANTWAIT(n) ((uint32_t)(((n)&0xFF) << 16))
#define FLEXSPI_MCR0_IPGRANTWAIT_MASK ((uint32_t)(0xFF << 16))
#define FLEXSPI_MCR0_SCKFREERUNEN ((uint32_t)(1 << 14))
#define FLEXSPI_MCR0_COMBINATIONEN ((uint32_t)(1 << 13))
#define FLEXSPI_MCR0_DOZEEN ((uint32_t)(1 << 12))
#define FLEXSPI_MCR0_HSEN ((uint32_t)(1 << 11))
#define FLEXSPI_MCR0_ATDFEN ((uint32_t)(1 << 7))
#define FLEXSPI_MCR0_ARDFEN ((uint32_t)(1 << 6))
#define FLEXSPI_MCR0_RXCLKSRC(n) ((uint32_t)(((n)&0x03) << 4))
#define FLEXSPI_MCR0_RXCLKSRC_MASK ((uint32_t)(0x03 << 4))
#define FLEXSPI_MCR0_MDIS ((uint32_t)(1 << 1))
#define FLEXSPI_MCR0_SWRESET ((uint32_t)(1 << 0))
#define FLEXSPI_MCR1 (IMXRT_FLEXSPI.offset004)
#define FLEXSPI_MCR1_SEQWAIT(n) ((uint32_t)(((n)&0xFFFF) << 16))
#define FLEXSPI_MCR1_AHBBUSWAIT(n) ((uint32_t)(((n)&0xFFFF) << 0))
#define FLEXSPI_MCR2 (IMXRT_FLEXSPI.offset008)
#define FLEXSPI_MCR2_RESUMEWAIT(n) ((uint32_t)(((n)&0xFF) << 24))
#define FLEXSPI_MCR2_RESUMEWAIT_MASK ((uint32_t)(0xFF << 24))
#define FLEXSPI_MCR2_SCKBDIFFOPT ((uint32_t)(1 << 19))
#define FLEXSPI_MCR2_SAMEDEVICEEN ((uint32_t)(1 << 15))
#define FLEXSPI_MCR2_CLRLEARNPHASE ((uint32_t)(1 << 14))
#define FLEXSPI_MCR2_CLRAHBBUFOPT ((uint32_t)(1 << 11))
#define FLEXSPI_AHBCR (IMXRT_FLEXSPI.offset00C)
#define FLEXSPI_AHBCR_READADDROPT ((uint32_t)(1 << 6))
#define FLEXSPI_AHBCR_PREFETCHEN ((uint32_t)(1 << 5))
#define FLEXSPI_AHBCR_BUFFERABLEEN ((uint32_t)(1 << 4))
#define FLEXSPI_AHBCR_CACHABLEEN ((uint32_t)(1 << 3))
#define FLEXSPI_AHBCR_APAREN ((uint32_t)(1 << 0))
#define FLEXSPI_INTEN (IMXRT_FLEXSPI.offset010)
#define FLEXSPI_INTEN_SEQTIMEOUTEN ((uint32_t)(1 << 11))
#define FLEXSPI_INTEN_AHBBUSTIMEOUTEN ((uint32_t)(1 << 10))
#define FLEXSPI_INTEN_SCKSTOPBYWREN ((uint32_t)(1 << 9))
#define FLEXSPI_INTEN_SCKSTOPBYRDEN ((uint32_t)(1 << 8))
#define FLEXSPI_INTEN_IPTXWEEN ((uint32_t)(1 << 6))
#define FLEXSPI_INTEN_IPRXWAEN ((uint32_t)(1 << 5))
#define FLEXSPI_INTEN_AHBCMDERREN ((uint32_t)(1 << 4))
#define FLEXSPI_INTEN_IPCMDERREN ((uint32_t)(1 << 3))
#define FLEXSPI_INTEN_AHBCMDGEEN ((uint32_t)(1 << 2))
#define FLEXSPI_INTEN_IPCMDGEEN ((uint32_t)(1 << 1))
#define FLEXSPI_INTEN_IPCMDDONEEN ((uint32_t)(1 << 0))
#define FLEXSPI_INTR (IMXRT_FLEXSPI.offset014)
#define FLEXSPI_INTR_SEQTIMEOUT ((uint32_t)(1 << 11))
#define FLEXSPI_INTR_AHBBUSTIMEOUT ((uint32_t)(1 << 10))
#define FLEXSPI_INTR_SCKSTOPBYWR ((uint32_t)(1 << 9))
#define FLEXSPI_INTR_SCKSTOPBYRD ((uint32_t)(1 << 8))
#define FLEXSPI_INTR_IPTXWE ((uint32_t)(1 << 6))
#define FLEXSPI_INTR_IPRXWA ((uint32_t)(1 << 5))
#define FLEXSPI_INTR_AHBCMDERR ((uint32_t)(1 << 4))
#define FLEXSPI_INTR_IPCMDERR ((uint32_t)(1 << 3))
#define FLEXSPI_INTR_AHBCMDGE ((uint32_t)(1 << 2))
#define FLEXSPI_INTR_IPCMDGE ((uint32_t)(1 << 1))
#define FLEXSPI_INTR_IPCMDDONE ((uint32_t)(1 << 0))
#define FLEXSPI_LUTKEY (IMXRT_FLEXSPI.offset018)
#define FLEXSPI_LUTKEY_VALUE ((uint32_t)0x5AF05AF0)
#define FLEXSPI_LUTCR (IMXRT_FLEXSPI.offset01C)
#define FLEXSPI_LUTCR_UNLOCK ((uint32_t)(1 << 1))
#define FLEXSPI_LUTCR_LOCK ((uint32_t)(1 << 0))
#define FLEXSPI_AHBRXBUF0CR0 (IMXRT_FLEXSPI.offset020)
#define FLEXSPI_AHBRXBUF1CR0 (IMXRT_FLEXSPI.offset024)
#define FLEXSPI_AHBRXBUF2CR0 (IMXRT_FLEXSPI.offset028)
#define FLEXSPI_AHBRXBUF3CR0 (IMXRT_FLEXSPI.offset02C)
#define FLEXSPI_AHBRXBUFCR0_PREFETCHEN ((uint32_t)(1 << 31))
#define FLEXSPI_AHBRXBUFCR0_PRIORITY(n) ((uint32_t)(((n)&0x03) << 24))
#define FLEXSPI_AHBRXBUFCR0_PRIORITY_MASK ((uint32_t)((0x03) << 24))
#define FLEXSPI_AHBRXBUFCR0_MSTRID(n) ((uint32_t)(((n)&0x0F) << 16))
#define FLEXSPI_AHBRXBUFCR0_MSTRID_MASK ((uint32_t)((0x0F) << 16))
#define FLEXSPI_AHBRXBUFCR0_BUFSZ(n) ((uint32_t)(((n)&0xFF) << 0))
#define FLEXSPI_AHBRXBUFCR0_BUFSZ_MASK ((uint32_t)((0xFF) << 0))
#define FLEXSPI_FLSHA1CR0 (IMXRT_FLEXSPI.offset060)
#define FLEXSPI_FLSHA2CR0 (IMXRT_FLEXSPI.offset064)
#define FLEXSPI_FLSHB1CR0 (IMXRT_FLEXSPI.offset068)
#define FLEXSPI_FLSHB2CR0 (IMXRT_FLEXSPI.offset06C)
#define FLEXSPI_FLSHCR0_FLSHSZ(n) ((uint32_t)(((n)&0x7FFFFF) << 0))
#define FLEXSPI_FLSHCR0_FLSHSZ_MASK ((uint32_t)((0x7FFFFF) << 0))
#define FLEXSPI_FLSHA1CR1 (IMXRT_FLEXSPI.offset070)
#define FLEXSPI_FLSHA2CR1 (IMXRT_FLEXSPI.offset074)
#define FLEXSPI_FLSHB1CR1 (IMXRT_FLEXSPI.offset078)
#define FLEXSPI_FLSHB2CR1 (IMXRT_FLEXSPI.offset07C)
#define FLEXSPI_FLSHCR1_CSINTERVAL(n) ((uint32_t)(((n)&0xFFFF) << 16))
#define FLEXSPI_FLSHCR1_CSINTERVAL_MASK ((uint32_t)((0xFFFF) << 16))
#define FLEXSPI_FLSHCR1_CSINTERVALUNIT ((uint32_t)(1 << 15))
#define FLEXSPI_FLSHCR1_CAS(n) ((uint32_t)(((n)&0x0F) << 11))
#define FLEXSPI_FLSHCR1_WA ((uint32_t)(1 << 10))
#define FLEXSPI_FLSHCR1_TCSH(n) ((uint32_t)(((n)&0x1F) << 5))
#define FLEXSPI_FLSHCR1_TCSH_MASK ((uint32_t)((0x1F) << 5))
#define FLEXSPI_FLSHCR1_TCSS(n) ((uint32_t)(((n)&0x1F) << 0))
#define FLEXSPI_FLSHCR1_TCSS_MASK ((uint32_t)((0x1F) << 0))
#define FLEXSPI_FLSHA1CR2 (IMXRT_FLEXSPI.offset080)
#define FLEXSPI_FLSHA2CR2 (IMXRT_FLEXSPI.offset084)
#define FLEXSPI_FLSHB1CR2 (IMXRT_FLEXSPI.offset088)
#define FLEXSPI_FLSHB2CR2 (IMXRT_FLEXSPI.offset08C)
#define FLEXSPI_FLSHCR2_CLRINSTRPTR ((uint32_t)(1 << 31))
#define FLEXSPI_FLSHCR2_AWRWAITUNIT(n) ((uint32_t)(((n)&0x07) << 28))
#define FLEXSPI_FLSHCR2_AWRWAIT(n) ((uint32_t)(((n)&0xFFF) << 16))
#define FLEXSPI_FLSHCR2_AWRSEQNUM(n) ((uint32_t)(((n)&0x07) << 13))
#define FLEXSPI_FLSHCR2_AWRSEQID(n) ((uint32_t)(((n)&0x0F) << 8))
#define FLEXSPI_FLSHCR2_ARDSEQNUM(n) ((uint32_t)(((n)&0x07) << 5))
#define FLEXSPI_FLSHCR2_ARDSEQID(n) ((uint32_t)(((n)&0x0F) << 0))
#define FLEXSPI_FLSHCR4 (IMXRT_FLEXSPI.offset094)
#define FLEXSPI_FLSHCR4_WMENB ((uint32_t)(1 << 3))
#define FLEXSPI_FLSHCR4_WMENA ((uint32_t)(1 << 2))
#define FLEXSPI_FLSHCR4_WMOPT1 ((uint32_t)(1 << 0))
#define FLEXSPI_IPCR0 (IMXRT_FLEXSPI.offset0A0)
#define FLEXSPI_IPCR0_SFAR(n) ((uint32_t)(n))
#define FLEXSPI_IPCR1 (IMXRT_FLEXSPI.offset0A4)
#define FLEXSPI_IPCR1_IPAREN ((uint32_t)(1 << 31))
#define FLEXSPI_IPCR1_ISEQNUM(n) ((uint32_t)(((n)&0x07) << 24))
#define FLEXSPI_IPCR1_ISEQID(n) ((uint32_t)(((n)&0x0F) << 16))
#define FLEXSPI_IPCR1_IDATSZ(n) ((uint32_t)(((n)&0xFFFF) << 0))
#define FLEXSPI_IPCMD (IMXRT_FLEXSPI.offset0B0)
#define FLEXSPI_IPCMD_TRG ((uint32_t)(1 << 0))
#define FLEXSPI_IPRXFCR (IMXRT_FLEXSPI.offset0B8)
#define FLEXSPI_IPRXFCR_RXWMRK(n) ((uint32_t)(((n)&0x0F) << 2))
#define FLEXSPI_IPRXFCR_RXDMAEN ((uint32_t)(1 << 1))
#define FLEXSPI_IPRXFCR_CLRIPRXF ((uint32_t)(1 << 0))
#define FLEXSPI_IPTXFCR (IMXRT_FLEXSPI.offset0BC)
#define FLEXSPI_IPTXFCR_TXWMRK(n) ((uint32_t)(((n)&0x0F) << 2))
#define FLEXSPI_IPTXFCR_TXDMAEN ((uint32_t)(1 << 1))
#define FLEXSPI_IPTXFCR_CLRIPTXF ((uint32_t)(1 << 0))
#define FLEXSPI_DLLACR (IMXRT_FLEXSPI.offset0C0)
#define FLEXSPI_DLLBCR (IMXRT_FLEXSPI.offset0C4)
#define FLEXSPI_DLLCR_OVRDVAL(n) ((uint32_t)(((n)&0x3F) << 9))
#define FLEXSPI_DLLCR_OVRDEN ((uint32_t)(1 << 8))
#define FLEXSPI_DLLCR_SLVDLYTARGET(n) ((uint32_t)(((n)&0x0F) << 3))
#define FLEXSPI_DLLCR_DLLRESET ((uint32_t)(1 << 1))
#define FLEXSPI_DLLCR_DLLEN ((uint32_t)(1 << 0))
#define FLEXSPI_STS0 (IMXRT_FLEXSPI.offset0E0)
#define FLEXSPI_STS0_ARBCMDSRC(n) ((uint32_t)(((n)&0x03) << 2))
#define FLEXSPI_STS0_ARBIDLE ((uint32_t)(1 << 1))
#define FLEXSPI_STS0_SEQIDLE ((uint32_t)(1 << 0))
#define FLEXSPI_STS1 (IMXRT_FLEXSPI.offset0E4)
#define FLEXSPI_STS1_IPCMDERRCODE(n) ((uint32_t)(((n)&0x0F) << 24))
#define FLEXSPI_STS1_IPCMDERRID(n) ((uint32_t)(((n)&0x0F) << 16))
#define FLEXSPI_STS1_AHBCMDERRCODE(n) ((uint32_t)(((n)&0x0F) << 8))
#define FLEXSPI_STS1_AHBCMDERRID(n) ((uint32_t)(((n)&0x0F) << 0))
#define FLEXSPI_STS2 (IMXRT_FLEXSPI.offset0E8)
#define FLEXSPI_STS2_BREFSEL(n) ((uint32_t)(((n)&0x3F) << 24))
#define FLEXSPI_STS2_BSLVSEL(n) ((uint32_t)(((n)&0x3F) << 18))
#define FLEXSPI_STS2_BREFLOCK ((uint32_t)(1 << 17))
#define FLEXSPI_STS2_BSLVLOCK ((uint32_t)(1 << 16))
#define FLEXSPI_STS2_AREFSEL(n) ((uint32_t)(((n)&0x3F) << 8))
#define FLEXSPI_STS2_ASLVSEL(n) ((uint32_t)(((n)&0x3F) << 2))
#define FLEXSPI_STS2_AREFLOCK ((uint32_t)(1 << 1))
#define FLEXSPI_STS2_ASLVLOCK ((uint32_t)(1 << 0))
#define FLEXSPI_AHBSPNDSTS (IMXRT_FLEXSPI.offset0EC)
#define FLEXSPI_AHBSPNDSTS_DATLFT(n) ((uint32_t)(((n)&0xFFFF) << 16))
#define FLEXSPI_AHBSPNDSTS_BUFID(n) ((uint32_t)(((n)&0x7) << 1))
#define FLEXSPI_AHBSPNDSTS_ACTIVE ((uint32_t)(1 << 0))
#define FLEXSPI_IPRXFSTS (IMXRT_FLEXSPI.offset0F0)
#define FLEXSPI_IPRXFSTS_RDCNTR(n) ((uint32_t)(((n)&0xFFFF) << 16))
#define FLEXSPI_IPRXFSTS_FILL(n) ((uint32_t)(((n)&0xFF) << 0))
#define FLEXSPI_IPTXFSTS (IMXRT_FLEXSPI.offset0F4)
#define FLEXSPI_IPTXFSTS_WRCNTR(n) ((uint32_t)(((n)&0xFFFF) << 16))
#define FLEXSPI_IPTXFSTS_FILL(n) ((uint32_t)(((n)&0xFF) << 0))
#define FLEXSPI_RFDR0 (IMXRT_FLEXSPI.offset100)
#define FLEXSPI_RFDR1 (IMXRT_FLEXSPI.offset104)
#define FLEXSPI_RFDR2 (IMXRT_FLEXSPI.offset108)
#define FLEXSPI_RFDR3 (IMXRT_FLEXSPI.offset10C)
#define FLEXSPI_RFDR4 (IMXRT_FLEXSPI.offset110)
#define FLEXSPI_RFDR5 (IMXRT_FLEXSPI.offset114)
#define FLEXSPI_RFDR6 (IMXRT_FLEXSPI.offset118)
#define FLEXSPI_RFDR7 (IMXRT_FLEXSPI.offset11C)
#define FLEXSPI_RFDR8 (IMXRT_FLEXSPI.offset120)
#define FLEXSPI_RFDR9 (IMXRT_FLEXSPI.offset124)
#define FLEXSPI_RFDR10 (IMXRT_FLEXSPI.offset128)
#define FLEXSPI_RFDR11 (IMXRT_FLEXSPI.offset12C)
#define FLEXSPI_RFDR12 (IMXRT_FLEXSPI.offset130)
#define FLEXSPI_RFDR13 (IMXRT_FLEXSPI.offset134)
#define FLEXSPI_RFDR14 (IMXRT_FLEXSPI.offset138)
#define FLEXSPI_RFDR15 (IMXRT_FLEXSPI.offset13C)
#define FLEXSPI_RFDR16 (IMXRT_FLEXSPI.offset140)
#define FLEXSPI_RFDR17 (IMXRT_FLEXSPI.offset144)
#define FLEXSPI_RFDR18 (IMXRT_FLEXSPI.offset148)
#define FLEXSPI_RFDR19 (IMXRT_FLEXSPI.offset14C)
#define FLEXSPI_RFDR20 (IMXRT_FLEXSPI.offset150)
#define FLEXSPI_RFDR21 (IMXRT_FLEXSPI.offset154)
#define FLEXSPI_RFDR22 (IMXRT_FLEXSPI.offset158)
#define FLEXSPI_RFDR23 (IMXRT_FLEXSPI.offset15C)
#define FLEXSPI_RFDR24 (IMXRT_FLEXSPI.offset160)
#define FLEXSPI_RFDR25 (IMXRT_FLEXSPI.offset164)
#define FLEXSPI_RFDR26 (IMXRT_FLEXSPI.offset168)
#define FLEXSPI_RFDR27 (IMXRT_FLEXSPI.offset16C)
#define FLEXSPI_RFDR28 (IMXRT_FLEXSPI.offset170)
#define FLEXSPI_RFDR29 (IMXRT_FLEXSPI.offset174)
#define FLEXSPI_RFDR30 (IMXRT_FLEXSPI.offset178)
#define FLEXSPI_RFDR31 (IMXRT_FLEXSPI.offset17C)
#define FLEXSPI_TFDR0 (IMXRT_FLEXSPI.offset180)
#define FLEXSPI_TFDR1 (IMXRT_FLEXSPI.offset184)
#define FLEXSPI_TFDR2 (IMXRT_FLEXSPI.offset188)
#define FLEXSPI_TFDR3 (IMXRT_FLEXSPI.offset18C)
#define FLEXSPI_TFDR4 (IMXRT_FLEXSPI.offset190)
#define FLEXSPI_TFDR5 (IMXRT_FLEXSPI.offset194)
#define FLEXSPI_TFDR6 (IMXRT_FLEXSPI.offset198)
#define FLEXSPI_TFDR7 (IMXRT_FLEXSPI.offset19C)
#define FLEXSPI_TFDR8 (IMXRT_FLEXSPI.offset1A0)
#define FLEXSPI_TFDR9 (IMXRT_FLEXSPI.offset1A4)
#define FLEXSPI_TFDR10 (IMXRT_FLEXSPI.offset1A8)
#define FLEXSPI_TFDR11 (IMXRT_FLEXSPI.offset1AC)
#define FLEXSPI_TFDR12 (IMXRT_FLEXSPI.offset1B0)
#define FLEXSPI_TFDR13 (IMXRT_FLEXSPI.offset1B4)
#define FLEXSPI_TFDR14 (IMXRT_FLEXSPI.offset1B8)
#define FLEXSPI_TFDR15 (IMXRT_FLEXSPI.offset1BC)
#define FLEXSPI_TFDR16 (IMXRT_FLEXSPI.offset1C0)
#define FLEXSPI_TFDR17 (IMXRT_FLEXSPI.offset1C4)
#define FLEXSPI_TFDR18 (IMXRT_FLEXSPI.offset1C8)
#define FLEXSPI_TFDR19 (IMXRT_FLEXSPI.offset1CC)
#define FLEXSPI_TFDR20 (IMXRT_FLEXSPI.offset1D0)
#define FLEXSPI_TFDR21 (IMXRT_FLEXSPI.offset1D4)
#define FLEXSPI_TFDR22 (IMXRT_FLEXSPI.offset1D8)
#define FLEXSPI_TFDR23 (IMXRT_FLEXSPI.offset1DC)
#define FLEXSPI_TFDR24 (IMXRT_FLEXSPI.offset1E0)
#define FLEXSPI_TFDR25 (IMXRT_FLEXSPI.offset1E4)
#define FLEXSPI_TFDR26 (IMXRT_FLEXSPI.offset1E8)
#define FLEXSPI_TFDR27 (IMXRT_FLEXSPI.offset1EC)
#define FLEXSPI_TFDR28 (IMXRT_FLEXSPI.offset1F0)
#define FLEXSPI_TFDR29 (IMXRT_FLEXSPI.offset1F4)
#define FLEXSPI_TFDR30 (IMXRT_FLEXSPI.offset1F8)
#define FLEXSPI_TFDR31 (IMXRT_FLEXSPI.offset1FC)
#define FLEXSPI_LUT0 (IMXRT_FLEXSPI.offset200)
#define FLEXSPI_LUT1 (IMXRT_FLEXSPI.offset204)
#define FLEXSPI_LUT2 (IMXRT_FLEXSPI.offset208)
#define FLEXSPI_LUT3 (IMXRT_FLEXSPI.offset20C)
#define FLEXSPI_LUT4 (IMXRT_FLEXSPI.offset210)
#define FLEXSPI_LUT5 (IMXRT_FLEXSPI.offset214)
#define FLEXSPI_LUT6 (IMXRT_FLEXSPI.offset218)
#define FLEXSPI_LUT7 (IMXRT_FLEXSPI.offset21C)
#define FLEXSPI_LUT8 (IMXRT_FLEXSPI.offset220)
#define FLEXSPI_LUT9 (IMXRT_FLEXSPI.offset224)
#define FLEXSPI_LUT10 (IMXRT_FLEXSPI.offset228)
#define FLEXSPI_LUT11 (IMXRT_FLEXSPI.offset22C)
#define FLEXSPI_LUT12 (IMXRT_FLEXSPI.offset230)
#define FLEXSPI_LUT13 (IMXRT_FLEXSPI.offset234)
#define FLEXSPI_LUT14 (IMXRT_FLEXSPI.offset238)
#define FLEXSPI_LUT15 (IMXRT_FLEXSPI.offset23C)
#define FLEXSPI_LUT16 (IMXRT_FLEXSPI.offset240)
#define FLEXSPI_LUT17 (IMXRT_FLEXSPI.offset244)
#define FLEXSPI_LUT18 (IMXRT_FLEXSPI.offset248)
#define FLEXSPI_LUT19 (IMXRT_FLEXSPI.offset24C)
#define FLEXSPI_LUT20 (IMXRT_FLEXSPI.offset250)
#define FLEXSPI_LUT21 (IMXRT_FLEXSPI.offset254)
#define FLEXSPI_LUT22 (IMXRT_FLEXSPI.offset258)
#define FLEXSPI_LUT23 (IMXRT_FLEXSPI.offset25C)
#define FLEXSPI_LUT24 (IMXRT_FLEXSPI.offset260)
#define FLEXSPI_LUT25 (IMXRT_FLEXSPI.offset264)
#define FLEXSPI_LUT26 (IMXRT_FLEXSPI.offset268)
#define FLEXSPI_LUT27 (IMXRT_FLEXSPI.offset26C)
#define FLEXSPI_LUT28 (IMXRT_FLEXSPI.offset270)
#define FLEXSPI_LUT29 (IMXRT_FLEXSPI.offset274)
#define FLEXSPI_LUT30 (IMXRT_FLEXSPI.offset278)
#define FLEXSPI_LUT31 (IMXRT_FLEXSPI.offset27C)
#define FLEXSPI_LUT32 (IMXRT_FLEXSPI.offset280)
#define FLEXSPI_LUT33 (IMXRT_FLEXSPI.offset284)
#define FLEXSPI_LUT34 (IMXRT_FLEXSPI.offset288)
#define FLEXSPI_LUT35 (IMXRT_FLEXSPI.offset28C)
#define FLEXSPI_LUT36 (IMXRT_FLEXSPI.offset290)
#define FLEXSPI_LUT37 (IMXRT_FLEXSPI.offset294)
#define FLEXSPI_LUT38 (IMXRT_FLEXSPI.offset298)
#define FLEXSPI_LUT39 (IMXRT_FLEXSPI.offset29C)
#define FLEXSPI_LUT40 (IMXRT_FLEXSPI.offset2A0)
#define FLEXSPI_LUT41 (IMXRT_FLEXSPI.offset2A4)
#define FLEXSPI_LUT42 (IMXRT_FLEXSPI.offset2A8)
#define FLEXSPI_LUT43 (IMXRT_FLEXSPI.offset2AC)
#define FLEXSPI_LUT44 (IMXRT_FLEXSPI.offset2B0)
#define FLEXSPI_LUT45 (IMXRT_FLEXSPI.offset2B4)
#define FLEXSPI_LUT46 (IMXRT_FLEXSPI.offset2B8)
#define FLEXSPI_LUT47 (IMXRT_FLEXSPI.offset2BC)
#define FLEXSPI_LUT48 (IMXRT_FLEXSPI.offset2C0)
#define FLEXSPI_LUT49 (IMXRT_FLEXSPI.offset2C4)
#define FLEXSPI_LUT50 (IMXRT_FLEXSPI.offset2C8)
#define FLEXSPI_LUT51 (IMXRT_FLEXSPI.offset2CC)
#define FLEXSPI_LUT52 (IMXRT_FLEXSPI.offset2D0)
#define FLEXSPI_LUT53 (IMXRT_FLEXSPI.offset2D4)
#define FLEXSPI_LUT54 (IMXRT_FLEXSPI.offset2D8)
#define FLEXSPI_LUT55 (IMXRT_FLEXSPI.offset2DC)
#define FLEXSPI_LUT56 (IMXRT_FLEXSPI.offset2E0)
#define FLEXSPI_LUT57 (IMXRT_FLEXSPI.offset2E4)
#define FLEXSPI_LUT58 (IMXRT_FLEXSPI.offset2E8)
#define FLEXSPI_LUT59 (IMXRT_FLEXSPI.offset2EC)
#define FLEXSPI_LUT60 (IMXRT_FLEXSPI.offset2F0)
#define FLEXSPI_LUT61 (IMXRT_FLEXSPI.offset2F4)
#define FLEXSPI_LUT62 (IMXRT_FLEXSPI.offset2F8)
#define FLEXSPI_LUT63 (IMXRT_FLEXSPI.offset2FC)
#define FLEXSPI_LUT_OPCODE1(n) ((uint32_t)(((n)&0x3F) << 26))
#define FLEXSPI_LUT_NUM_PADS1(n) ((uint32_t)(((n)&0x03) << 24))
#define FLEXSPI_LUT_OPERAND1(n) ((uint32_t)(((n)&0xFF) << 16))
#define FLEXSPI_LUT_OPCODE0(n) ((uint32_t)(((n)&0x3F) << 10))
#define FLEXSPI_LUT_NUM_PADS0(n) ((uint32_t)(((n)&0x03) << 8))
#define FLEXSPI_LUT_OPERAND0(n) ((uint32_t)(((n)&0xFF) << 0))
#define FLEXSPI_LUT_INSTRUCTION(opcode, pads, operand) ((uint32_t)( \
    (((opcode)&0x3F) << 10) | (((pads)&0x03) << 8) | ((operand)&0xFF)))
// 30.7.8: page 1532
#define FLEXSPI_LUT_OPCODE_CMD_SDR 0x01
#define FLEXSPI_LUT_OPCODE_CMD_DDR 0x21
#define FLEXSPI_LUT_OPCODE_RADDR_SDR 0x02
#define FLEXSPI_LUT_OPCODE_RADDR_DDR 0x22
#define FLEXSPI_LUT_OPCODE_CADDR_SDR 0x03
#define FLEXSPI_LUT_OPCODE_CADDR_DDR 0x23
#define FLEXSPI_LUT_OPCODE_MODE1_SDR 0x04
#define FLEXSPI_LUT_OPCODE_MODE1_DDR 0x24
#define FLEXSPI_LUT_OPCODE_MODE2_SDR 0x05
#define FLEXSPI_LUT_OPCODE_MODE2_DDR 0x25
#define FLEXSPI_LUT_OPCODE_MODE4_SDR 0x06
#define FLEXSPI_LUT_OPCODE_MODE4_DDR 0x26
#define FLEXSPI_LUT_OPCODE_MODE8_SDR 0x07
#define FLEXSPI_LUT_OPCODE_MODE8_DDR 0x27
#define FLEXSPI_LUT_OPCODE_WRITE_SDR 0x08
#define FLEXSPI_LUT_OPCODE_WRITE_DDR 0x28
#define FLEXSPI_LUT_OPCODE_READ_SDR 0x09
#define FLEXSPI_LUT_OPCODE_READ_DDR 0x29
#define FLEXSPI_LUT_OPCODE_LEARN_SDR 0x0A
#define FLEXSPI_LUT_OPCODE_LEARN_DDR 0x2A
#define FLEXSPI_LUT_OPCODE_DATSZ_SDR 0x0B
#define FLEXSPI_LUT_OPCODE_DATSZ_DDR 0x2B
#define FLEXSPI_LUT_OPCODE_DUMMY_SDR 0x0C
#define FLEXSPI_LUT_OPCODE_DUMMY_DDR 0x2C
#define FLEXSPI_LUT_OPCODE_DUMMY_RWDS_SDR 0x0D
#define FLEXSPI_LUT_OPCODE_DUMMY_RWDS_DDR 0x2D
#define FLEXSPI_LUT_OPCODE_JMP_ON_CS 0x1F
#define FLEXSPI_LUT_OPCODE_STOP 0x00
#define FLEXSPI_LUT_NUM_PADS_1 0x00
#define FLEXSPI_LUT_NUM_PADS_2 0x01
#define FLEXSPI_LUT_NUM_PADS_4 0x02
#define FLEXSPI_LUT_NUM_PADS_8 0x03

