gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
#define IMXRT_FLEXSPI2 (*(IMXRT_REGISTER32_t *)0x402A4000)
#define FLEXSPI2_MCR0 (IMXRT_FLEXSPI2.offset000)
#define FLEXSPI2_MCR1 (IMXRT_FLEXSPI2.offset004)
#define FLEXSPI2_MCR2 (IMXRT_FLEXSPI2.offset008)
#define FLEXSPI2_AHBCR (IMXRT_FLEXSPI2.offset00C)
#define FLEXSPI2_INTEN (IMXRT_FLEXSPI2.offset010)
#define FLEXSPI2_INTR (IMXRT_FLEXSPI2.offset014)
#define FLEXSPI2_LUTKEY (IMXRT_FLEXSPI2.offset018)
#define FLEXSPI2_LUTCR (IMXRT_FLEXSPI2.offset01C)
#define FLEXSPI2_AHBRXBUF0CR0 (IMXRT_FLEXSPI2.offset020)
#define FLEXSPI2_AHBRXBUF1CR0 (IMXRT_FLEXSPI2.offset024)
#define FLEXSPI2_AHBRXBUF2CR0 (IMXRT_FLEXSPI2.offset028)
#define FLEXSPI2_AHBRXBUF3CR0 (IMXRT_FLEXSPI2.offset02C)
#define FLEXSPI2_FLSHA1CR0 (IMXRT_FLEXSPI2.offset060)
#define FLEXSPI2_FLSHA2CR0 (IMXRT_FLEXSPI2.offset064)
#define FLEXSPI2_FLSHB1CR0 (IMXRT_FLEXSPI2.offset068)
#define FLEXSPI2_FLSHB2CR0 (IMXRT_FLEXSPI2.offset06C)
#define FLEXSPI2_FLSHA1CR1 (IMXRT_FLEXSPI2.offset070)
#define FLEXSPI2_FLSHA2CR1 (IMXRT_FLEXSPI2.offset074)
#define FLEXSPI2_FLSHB1CR1 (IMXRT_FLEXSPI2.offset078)
#define FLEXSPI2_FLSHB2CR1 (IMXRT_FLEXSPI2.offset07C)
#define FLEXSPI2_FLSHA1CR2 (IMXRT_FLEXSPI2.offset080)
#define FLEXSPI2_FLSHA2CR2 (IMXRT_FLEXSPI2.offset084)
#define FLEXSPI2_FLSHB1CR2 (IMXRT_FLEXSPI2.offset088)
#define FLEXSPI2_FLSHB2CR2 (IMXRT_FLEXSPI2.offset08C)
#define FLEXSPI2_FLSHCR4 (IMXRT_FLEXSPI2.offset094)
#define FLEXSPI2_IPCR0 (IMXRT_FLEXSPI2.offset0A0)
#define FLEXSPI2_IPCR1 (IMXRT_FLEXSPI2.offset0A4)
#define FLEXSPI2_IPCMD (IMXRT_FLEXSPI2.offset0B0)
#define FLEXSPI2_IPRXFCR (IMXRT_FLEXSPI2.offset0B8)
#define FLEXSPI2_IPTXFCR (IMXRT_FLEXSPI2.offset0BC)
#define FLEXSPI2_DLLACR (IMXRT_FLEXSPI2.offset0C0)
#define FLEXSPI2_DLLBCR (IMXRT_FLEXSPI2.offset0C4)
#define FLEXSPI2_STS0 (IMXRT_FLEXSPI2.offset0E0)
#define FLEXSPI2_STS1 (IMXRT_FLEXSPI2.offset0E4)
#define FLEXSPI2_STS2 (IMXRT_FLEXSPI2.offset0E8)
#define FLEXSPI2_AHBSPNDSTS (IMXRT_FLEXSPI2.offset0EC)
#define FLEXSPI2_IPRXFSTS (IMXRT_FLEXSPI2.offset0F0)
#define FLEXSPI2_IPTXFSTS (IMXRT_FLEXSPI2.offset0F4)
#define FLEXSPI2_RFDR0 (IMXRT_FLEXSPI2.offset100)
#define FLEXSPI2_RFDR1 (IMXRT_FLEXSPI2.offset104)
#define FLEXSPI2_RFDR2 (IMXRT_FLEXSPI2.offset108)
#define FLEXSPI2_RFDR3 (IMXRT_FLEXSPI2.offset10C)
#define FLEXSPI2_RFDR4 (IMXRT_FLEXSPI2.offset110)
#define FLEXSPI2_RFDR5 (IMXRT_FLEXSPI2.offset114)
#define FLEXSPI2_RFDR6 (IMXRT_FLEXSPI2.offset118)
#define FLEXSPI2_RFDR7 (IMXRT_FLEXSPI2.offset11C)
#define FLEXSPI2_RFDR8 (IMXRT_FLEXSPI2.offset120)
#define FLEXSPI2_RFDR9 (IMXRT_FLEXSPI2.offset124)
#define FLEXSPI2_RFDR10 (IMXRT_FLEXSPI2.offset128)
#define FLEXSPI2_RFDR11 (IMXRT_FLEXSPI2.offset12C)
#define FLEXSPI2_RFDR12 (IMXRT_FLEXSPI2.offset130)
#define FLEXSPI2_RFDR13 (IMXRT_FLEXSPI2.offset134)
#define FLEXSPI2_RFDR14 (IMXRT_FLEXSPI2.offset138)
#define FLEXSPI2_RFDR15 (IMXRT_FLEXSPI2.offset13C)
#define FLEXSPI2_RFDR16 (IMXRT_FLEXSPI2.offset140)
#define FLEXSPI2_RFDR17 (IMXRT_FLEXSPI2.offset144)
#define FLEXSPI2_RFDR18 (IMXRT_FLEXSPI2.offset148)
#define FLEXSPI2_RFDR19 (IMXRT_FLEXSPI2.offset14C)
#define FLEXSPI2_RFDR20 (IMXRT_FLEXSPI2.offset150)
#define FLEXSPI2_RFDR21 (IMXRT_FLEXSPI2.offset154)
#define FLEXSPI2_RFDR22 (IMXRT_FLEXSPI2.offset158)
#define FLEXSPI2_RFDR23 (IMXRT_FLEXSPI2.offset15C)
#define FLEXSPI2_RFDR24 (IMXRT_FLEXSPI2.offset160)
#define FLEXSPI2_RFDR25 (IMXRT_FLEXSPI2.offset164)
#define FLEXSPI2_RFDR26 (IMXRT_FLEXSPI2.offset168)
#define FLEXSPI2_RFDR27 (IMXRT_FLEXSPI2.offset16C)
#define FLEXSPI2_RFDR28 (IMXRT_FLEXSPI2.offset170)
#define FLEXSPI2_RFDR29 (IMXRT_FLEXSPI2.offset174)
#define FLEXSPI2_RFDR30 (IMXRT_FLEXSPI2.offset178)
#define FLEXSPI2_RFDR31 (IMXRT_FLEXSPI2.offset17C)
#define FLEXSPI2_TFDR0 (IMXRT_FLEXSPI2.offset180)
#define FLEXSPI2_TFDR1 (IMXRT_FLEXSPI2.offset184)
#define FLEXSPI2_TFDR2 (IMXRT_FLEXSPI2.offset188)
#define FLEXSPI2_TFDR3 (IMXRT_FLEXSPI2.offset18C)
#define FLEXSPI2_TFDR4 (IMXRT_FLEXSPI2.offset190)
#define FLEXSPI2_TFDR5 (IMXRT_FLEXSPI2.offset194)
#define FLEXSPI2_TFDR6 (IMXRT_FLEXSPI2.offset198)
#define FLEXSPI2_TFDR7 (IMXRT_FLEXSPI2.offset19C)
#define FLEXSPI2_TFDR8 (IMXRT_FLEXSPI2.offset1A0)
#define FLEXSPI2_TFDR9 (IMXRT_FLEXSPI2.offset1A4)
#define FLEXSPI2_TFDR10 (IMXRT_FLEXSPI2.offset1A8)
#define FLEXSPI2_TFDR11 (IMXRT_FLEXSPI2.offset1AC)
#define FLEXSPI2_TFDR12 (IMXRT_FLEXSPI2.offset1B0)
#define FLEXSPI2_TFDR13 (IMXRT_FLEXSPI2.offset1B4)
#define FLEXSPI2_TFDR14 (IMXRT_FLEXSPI2.offset1B8)
#define FLEXSPI2_TFDR15 (IMXRT_FLEXSPI2.offset1BC)
#define FLEXSPI2_TFDR16 (IMXRT_FLEXSPI2.offset1C0)
#define FLEXSPI2_TFDR17 (IMXRT_FLEXSPI2.offset1C4)
#define FLEXSPI2_TFDR18 (IMXRT_FLEXSPI2.offset1C8)
#define FLEXSPI2_TFDR19 (IMXRT_FLEXSPI2.offset1CC)
#define FLEXSPI2_TFDR20 (IMXRT_FLEXSPI2.offset1D0)
#define FLEXSPI2_TFDR21 (IMXRT_FLEXSPI2.offset1D4)
#define FLEXSPI2_TFDR22 (IMXRT_FLEXSPI2.offset1D8)
#define FLEXSPI2_TFDR23 (IMXRT_FLEXSPI2.offset1DC)
#define FLEXSPI2_TFDR24 (IMXRT_FLEXSPI2.offset1E0)
#define FLEXSPI2_TFDR25 (IMXRT_FLEXSPI2.offset1E4)
#define FLEXSPI2_TFDR26 (IMXRT_FLEXSPI2.offset1E8)
#define FLEXSPI2_TFDR27 (IMXRT_FLEXSPI2.offset1EC)
#define FLEXSPI2_TFDR28 (IMXRT_FLEXSPI2.offset1F0)
#define FLEXSPI2_TFDR29 (IMXRT_FLEXSPI2.offset1F4)
#define FLEXSPI2_TFDR30 (IMXRT_FLEXSPI2.offset1F8)
#define FLEXSPI2_TFDR31 (IMXRT_FLEXSPI2.offset1FC)
#define FLEXSPI2_LUT0 (IMXRT_FLEXSPI2.offset200)
#define FLEXSPI2_LUT1 (IMXRT_FLEXSPI2.offset204)
#define FLEXSPI2_LUT2 (IMXRT_FLEXSPI2.offset208)
#define FLEXSPI2_LUT3 (IMXRT_FLEXSPI2.offset20C)
#define FLEXSPI2_LUT4 (IMXRT_FLEXSPI2.offset210)
#define FLEXSPI2_LUT5 (IMXRT_FLEXSPI2.offset214)
#define FLEXSPI2_LUT6 (IMXRT_FLEXSPI2.offset218)
#define FLEXSPI2_LUT7 (IMXRT_FLEXSPI2.offset21C)
#define FLEXSPI2_LUT8 (IMXRT_FLEXSPI2.offset220)
#define FLEXSPI2_LUT9 (IMXRT_FLEXSPI2.offset224)
#define FLEXSPI2_LUT10 (IMXRT_FLEXSPI2.offset228)
#define FLEXSPI2_LUT11 (IMXRT_FLEXSPI2.offset22C)
#define FLEXSPI2_LUT12 (IMXRT_FLEXSPI2.offset230)
#define FLEXSPI2_LUT13 (IMXRT_FLEXSPI2.offset234)
#define FLEXSPI2_LUT14 (IMXRT_FLEXSPI2.offset238)
#define FLEXSPI2_LUT15 (IMXRT_FLEXSPI2.offset23C)
#define FLEXSPI2_LUT16 (IMXRT_FLEXSPI2.offset240)
#define FLEXSPI2_LUT17 (IMXRT_FLEXSPI2.offset244)
#define FLEXSPI2_LUT18 (IMXRT_FLEXSPI2.offset248)
#define FLEXSPI2_LUT19 (IMXRT_FLEXSPI2.offset24C)
#define FLEXSPI2_LUT20 (IMXRT_FLEXSPI2.offset250)
#define FLEXSPI2_LUT21 (IMXRT_FLEXSPI2.offset254)
#define FLEXSPI2_LUT22 (IMXRT_FLEXSPI2.offset258)
#define FLEXSPI2_LUT23 (IMXRT_FLEXSPI2.offset25C)
#define FLEXSPI2_LUT24 (IMXRT_FLEXSPI2.offset260)
#define FLEXSPI2_LUT25 (IMXRT_FLEXSPI2.offset264)
#define FLEXSPI2_LUT26 (IMXRT_FLEXSPI2.offset268)
#define FLEXSPI2_LUT27 (IMXRT_FLEXSPI2.offset26C)
#define FLEXSPI2_LUT28 (IMXRT_FLEXSPI2.offset270)
#define FLEXSPI2_LUT29 (IMXRT_FLEXSPI2.offset274)
#define FLEXSPI2_LUT30 (IMXRT_FLEXSPI2.offset278)
#define FLEXSPI2_LUT31 (IMXRT_FLEXSPI2.offset27C)
#define FLEXSPI2_LUT32 (IMXRT_FLEXSPI2.offset280)
#define FLEXSPI2_LUT33 (IMXRT_FLEXSPI2.offset284)
#define FLEXSPI2_LUT34 (IMXRT_FLEXSPI2.offset288)
#define FLEXSPI2_LUT35 (IMXRT_FLEXSPI2.offset28C)
#define FLEXSPI2_LUT36 (IMXRT_FLEXSPI2.offset290)
#define FLEXSPI2_LUT37 (IMXRT_FLEXSPI2.offset294)
#define FLEXSPI2_LUT38 (IMXRT_FLEXSPI2.offset298)
#define FLEXSPI2_LUT39 (IMXRT_FLEXSPI2.offset29C)
#define FLEXSPI2_LUT40 (IMXRT_FLEXSPI2.offset2A0)
#define FLEXSPI2_LUT41 (IMXRT_FLEXSPI2.offset2A4)
#define FLEXSPI2_LUT42 (IMXRT_FLEXSPI2.offset2A8)
#define FLEXSPI2_LUT43 (IMXRT_FLEXSPI2.offset2AC)
#define FLEXSPI2_LUT44 (IMXRT_FLEXSPI2.offset2B0)
#define FLEXSPI2_LUT45 (IMXRT_FLEXSPI2.offset2B4)
#define FLEXSPI2_LUT46 (IMXRT_FLEXSPI2.offset2B8)
#define FLEXSPI2_LUT47 (IMXRT_FLEXSPI2.offset2BC)
#define FLEXSPI2_LUT48 (IMXRT_FLEXSPI2.offset2C0)
#define FLEXSPI2_LUT49 (IMXRT_FLEXSPI2.offset2C4)
#define FLEXSPI2_LUT50 (IMXRT_FLEXSPI2.offset2C8)
#define FLEXSPI2_LUT51 (IMXRT_FLEXSPI2.offset2CC)
#define FLEXSPI2_LUT52 (IMXRT_FLEXSPI2.offset2D0)
#define FLEXSPI2_LUT53 (IMXRT_FLEXSPI2.offset2D4)
#define FLEXSPI2_LUT54 (IMXRT_FLEXSPI2.offset2D8)
#define FLEXSPI2_LUT55 (IMXRT_FLEXSPI2.offset2DC)
#define FLEXSPI2_LUT56 (IMXRT_FLEXSPI2.offset2E0)
#define FLEXSPI2_LUT57 (IMXRT_FLEXSPI2.offset2E4)
#define FLEXSPI2_LUT58 (IMXRT_FLEXSPI2.offset2E8)
#define FLEXSPI2_LUT59 (IMXRT_FLEXSPI2.offset2EC)
#define FLEXSPI2_LUT60 (IMXRT_FLEXSPI2.offset2F0)
#define FLEXSPI2_LUT61 (IMXRT_FLEXSPI2.offset2F4)
#define FLEXSPI2_LUT62 (IMXRT_FLEXSPI2.offset2F8)
#define FLEXSPI2_LUT63 (IMXRT_FLEXSPI2.offset2FC)

