gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
// 31.5: page 1595
#define IMXRT_GPC (*(IMXRT_REGISTER32_t *)0x400F4000)
#define GPC_CNTR (IMXRT_GPC.offset000)
#define GPC_IMR1 (IMXRT_GPC.offset008)
#define GPC_IMR2 (IMXRT_GPC.offset00C)
#define GPC_IMR3 (IMXRT_GPC.offset010)
#define GPC_IMR4 (IMXRT_GPC.offset014)
#define GPC_ISR1 (IMXRT_GPC.offset018)
#define GPC_ISR2 (IMXRT_GPC.offset01C)
#define GPC_ISR3 (IMXRT_GPC.offset020)
#define GPC_ISR4 (IMXRT_GPC.offset024)
#define GPC_IMR5 (IMXRT_GPC.offset034)
#define GPC_ISR5 (IMXRT_GPC.offset038)
#define GPC_CNTR_PDRAM0_PGE ((uint32_t)(1 << 22))
#define GPC_CNTR_MEGA_PUP_REQ ((uint32_t)(1 << 3))
#define GPC_CNTR_MEGA_PDN_REQ ((uint32_t)(1 << 2))
// page 1602
#define PGC_MEGA_CTRL (IMXRT_GPC.offset220)
#define PGC_MEGA_PUPSCR (IMXRT_GPC.offset224)
#define PGC_MEGA_PDNSCR (IMXRT_GPC.offset228)
#define PGC_MEGA_SR (IMXRT_GPC.offset22C)
#define PGC_CPU_CTRL (IMXRT_GPC.offset2A0)
#define PGC_CPU_PUPSCR (IMXRT_GPC.offset2A4)
#define PGC_CPU_PDNSCR (IMXRT_GPC.offset2A8)
#define PGC_CPU_SR (IMXRT_GPC.offset2AC)
#define PGC_MEGA_CTRL_PCR ((uint32_t)(1 << 0))
#define PGC_MEGA_PUPSCR_SW2ISO(n) ((uint32_t)(((n)&0x3F) << 8))
#define PGC_MEGA_PUPSCR_SW(n) ((uint32_t)(((n)&0x3F) << 0))
#define PGC_MEGA_PDNSCR_ISO2SW(n) ((uint32_t)(((n)&0x3F) << 8))
#define PGC_MEGA_PDNSCR_ISO(n) ((uint32_t)(((n)&0x3F) << 0))
#define PGC_MEGA_SR_PSR ((uint32_t)(1 << 0))
#define PGC_CPU_CTRL_PCR ((uint32_t)(1 << 0))
#define PGC_CPU_PUPSCR_SW2ISO(n) ((uint32_t)(((n)&0x3F) << 8))
#define PGC_CPU_PUPSCR_SW(n) ((uint32_t)(((n)&0x3F) << 0))
#define PGC_CPU_PDNSCR_ISO2SW(n) ((uint32_t)(((n)&0x3F) << 8))
#define PGC_CPU_PDNSCR_ISO(n) ((uint32_t)(((n)&0x3F) << 0))
#define PGC_CPU_SR_PSR ((uint32_t)(1 << 0))

// 32.4.1: page 1620
#define IMXRT_GPIO1 (*(IMXRT_REGISTER32_t *)0x401B8000)
#define GPIO1_DR (IMXRT_GPIO1.offset000)
#define GPIO1_GDIR (IMXRT_GPIO1.offset004)
#define GPIO1_PSR (IMXRT_GPIO1.offset008)
#define GPIO1_ICR1 (IMXRT_GPIO1.offset00C)
#define GPIO1_ICR2 (IMXRT_GPIO1.offset010)
#define GPIO1_IMR (IMXRT_GPIO1.offset014)
#define GPIO1_ISR (IMXRT_GPIO1.offset018)
#define GPIO1_EDGE_SEL (IMXRT_GPIO1.offset01C)
#define GPIO1_DR_SET (IMXRT_GPIO1.offset084)
#define GPIO1_DR_CLEAR (IMXRT_GPIO1.offset088)
#define GPIO1_DR_TOGGLE (IMXRT_GPIO1.offset08C)
#define IMXRT_GPIO2 (*(IMXRT_REGISTER32_t *)0x401BC000)
#define GPIO2_DR (IMXRT_GPIO2.offset000)
#define GPIO2_GDIR (IMXRT_GPIO2.offset004)
#define GPIO2_PSR (IMXRT_GPIO2.offset008)
#define GPIO2_ICR1 (IMXRT_GPIO2.offset00C)
#define GPIO2_ICR2 (IMXRT_GPIO2.offset010)
#define GPIO2_IMR (IMXRT_GPIO2.offset014)
#define GPIO2_ISR (IMXRT_GPIO2.offset018)
#define GPIO2_EDGE_SEL (IMXRT_GPIO2.offset01C)
#define GPIO2_DR_SET (IMXRT_GPIO2.offset084)
#define GPIO2_DR_CLEAR (IMXRT_GPIO2.offset088)
#define GPIO2_DR_TOGGLE (IMXRT_GPIO2.offset08C)
#define IMXRT_GPIO3 (*(IMXRT_REGISTER32_t *)0x401C0000)
#define GPIO3_DR (IMXRT_GPIO3.offset000)
#define GPIO3_GDIR (IMXRT_GPIO3.offset004)
#define GPIO3_PSR (IMXRT_GPIO3.offset008)
#define GPIO3_ICR1 (IMXRT_GPIO3.offset00C)
#define GPIO3_ICR2 (IMXRT_GPIO3.offset010)
#define GPIO3_IMR (IMXRT_GPIO3.offset014)
#define GPIO3_ISR (IMXRT_GPIO3.offset018)
#define GPIO3_EDGE_SEL (IMXRT_GPIO3.offset01C)
#define GPIO3_DR_SET (IMXRT_GPIO3.offset084)
#define GPIO3_DR_CLEAR (IMXRT_GPIO3.offset088)
#define GPIO3_DR_TOGGLE (IMXRT_GPIO3.offset08C)
#define IMXRT_GPIO4 (*(IMXRT_REGISTER32_t *)0x401C4000)
#define GPIO4_DR (IMXRT_GPIO4.offset000)
#define GPIO4_GDIR (IMXRT_GPIO4.offset004)
#define GPIO4_PSR (IMXRT_GPIO4.offset008)
#define GPIO4_ICR1 (IMXRT_GPIO4.offset00C)
#define GPIO4_ICR2 (IMXRT_GPIO4.offset010)
#define GPIO4_IMR (IMXRT_GPIO4.offset014)
#define GPIO4_ISR (IMXRT_GPIO4.offset018)
#define GPIO4_EDGE_SEL (IMXRT_GPIO4.offset01C)
#define GPIO4_DR_SET (IMXRT_GPIO4.offset084)
#define GPIO4_DR_CLEAR (IMXRT_GPIO4.offset088)
#define GPIO4_DR_TOGGLE (IMXRT_GPIO4.offset08C)
#define IMXRT_GPIO5 (*(IMXRT_REGISTER32_t *)0x400C0000)
#define GPIO5_DR (IMXRT_GPIO5.offset000)
#define GPIO5_GDIR (IMXRT_GPIO5.offset004)
#define GPIO5_PSR (IMXRT_GPIO5.offset008)
#define GPIO5_ICR1 (IMXRT_GPIO5.offset00C)
#define GPIO5_ICR2 (IMXRT_GPIO5.offset010)
#define GPIO5_IMR (IMXRT_GPIO5.offset014)
#define GPIO5_ISR (IMXRT_GPIO5.offset018)
#define GPIO5_EDGE_SEL (IMXRT_GPIO5.offset01C)
#define GPIO5_DR_SET (IMXRT_GPIO5.offset084)
#define GPIO5_DR_CLEAR (IMXRT_GPIO5.offset088)
#define GPIO5_DR_TOGGLE (IMXRT_GPIO5.offset08C)
#define IMXRT_GPIO6 (*(IMXRT_REGISTER32_t *)0x42000000)
#define GPIO6_DR (IMXRT_GPIO6.offset000)
#define GPIO6_GDIR (IMXRT_GPIO6.offset004)
#define GPIO6_PSR (IMXRT_GPIO6.offset008)
#define GPIO6_ICR1 (IMXRT_GPIO6.offset00C)
#define GPIO6_ICR2 (IMXRT_GPIO6.offset010)
#define GPIO6_IMR (IMXRT_GPIO6.offset014)
#define GPIO6_ISR (IMXRT_GPIO6.offset018)
#define GPIO6_EDGE_SEL (IMXRT_GPIO6.offset01C)
#define GPIO6_DR_SET (IMXRT_GPIO6.offset084)
#define GPIO6_DR_CLEAR (IMXRT_GPIO6.offset088)
#define GPIO6_DR_TOGGLE (IMXRT_GPIO6.offset08C)
#define IMXRT_GPIO7 (*(IMXRT_REGISTER32_t *)0x42004000)
#define GPIO7_DR (IMXRT_GPIO7.offset000)
#define GPIO7_GDIR (IMXRT_GPIO7.offset004)
#define GPIO7_PSR (IMXRT_GPIO7.offset008)
#define GPIO7_ICR1 (IMXRT_GPIO7.offset00C)
#define GPIO7_ICR2 (IMXRT_GPIO7.offset010)
#define GPIO7_IMR (IMXRT_GPIO7.offset014)
#define GPIO7_ISR (IMXRT_GPIO7.offset018)
#define GPIO7_EDGE_SEL (IMXRT_GPIO7.offset01C)
#define GPIO7_DR_SET (IMXRT_GPIO7.offset084)
#define GPIO7_DR_CLEAR (IMXRT_GPIO7.offset088)
#define GPIO7_DR_TOGGLE (IMXRT_GPIO7.offset08C)
#define IMXRT_GPIO8 (*(IMXRT_REGISTER32_t *)0x42008000)
#define GPIO8_DR (IMXRT_GPIO8.offset000)
#define GPIO8_GDIR (IMXRT_GPIO8.offset004)
#define GPIO8_PSR (IMXRT_GPIO8.offset008)
#define GPIO8_ICR1 (IMXRT_GPIO8.offset00C)
#define GPIO8_ICR2 (IMXRT_GPIO8.offset010)
#define GPIO8_IMR (IMXRT_GPIO8.offset014)
#define GPIO8_ISR (IMXRT_GPIO8.offset018)
#define GPIO8_EDGE_SEL (IMXRT_GPIO8.offset01C)
#define GPIO8_DR_SET (IMXRT_GPIO8.offset084)
#define GPIO8_DR_CLEAR (IMXRT_GPIO8.offset088)
#define GPIO8_DR_TOGGLE (IMXRT_GPIO8.offset08C)
#define IMXRT_GPIO9 (*(IMXRT_REGISTER32_t *)0x4200C000)
#define GPIO9_DR (IMXRT_GPIO9.offset000)
#define GPIO9_GDIR (IMXRT_GPIO9.offset004)
#define GPIO9_PSR (IMXRT_GPIO9.offset008)
#define GPIO9_ICR1 (IMXRT_GPIO9.offset00C)
#define GPIO9_ICR2 (IMXRT_GPIO9.offset010)
#define GPIO9_IMR (IMXRT_GPIO9.offset014)
#define GPIO9_ISR (IMXRT_GPIO9.offset018)
#define GPIO9_EDGE_SEL (IMXRT_GPIO9.offset01C)
#define GPIO9_DR_SET (IMXRT_GPIO9.offset084)
#define GPIO9_DR_CLEAR (IMXRT_GPIO9.offset088)
#define GPIO9_DR_TOGGLE (IMXRT_GPIO9.offset08C)

// 33.6: page 1651
#define IMXRT_GPT1 (*(IMXRT_REGISTER32_t *)0x401EC000)
#define GPT1_CR (IMXRT_GPT1.offset000)
#define GPT1_PR (IMXRT_GPT1.offset004)
#define GPT1_SR (IMXRT_GPT1.offset008)
#define GPT1_IR (IMXRT_GPT1.offset00C)
#define GPT1_OCR1 (IMXRT_GPT1.offset010)
#define GPT1_OCR2 (IMXRT_GPT1.offset014)
#define GPT1_OCR3 (IMXRT_GPT1.offset018)
#define GPT1_ICR1 (IMXRT_GPT1.offset01C)
#define GPT1_ICR2 (IMXRT_GPT1.offset020)
#define GPT1_CNT (IMXRT_GPT1.offset024)
#define IMXRT_GPT2 (*(IMXRT_REGISTER32_t *)0x401F0000)
#define GPT2_CR (IMXRT_GPT2.offset000)
#define GPT2_PR (IMXRT_GPT2.offset004)
#define GPT2_SR (IMXRT_GPT2.offset008)
#define GPT2_IR (IMXRT_GPT2.offset00C)
#define GPT2_OCR1 (IMXRT_GPT2.offset010)
#define GPT2_OCR2 (IMXRT_GPT2.offset014)
#define GPT2_OCR3 (IMXRT_GPT2.offset018)
#define GPT2_ICR1 (IMXRT_GPT2.offset01C)
#define GPT2_ICR2 (IMXRT_GPT2.offset020)
#define GPT2_CNT (IMXRT_GPT2.offset024)
#define GPT_CR_FO3 ((uint32_t)(1 << 31))
#define GPT_CR_FO2 ((uint32_t)(1 << 30))
#define GPT_CR_FO1 ((uint32_t)(1 << 29))
#define GPT_CR_OM3(n) ((uint32_t)(((n)&0x07) << 26))
#define GPT_CR_OM2(n) ((uint32_t)(((n)&0x07) << 23))
#define GPT_CR_OM1(n) ((uint32_t)(((n)&0x07) << 20))
#define GPT_CR_IM2(n) ((uint32_t)(((n)&0x03) << 18))
#define GPT_CR_IM1(n) ((uint32_t)(((n)&0x03) << 16))
#define GPT_CR_SWR ((uint32_t)(1 << 15))
#define GPT_CR_EN_24M ((uint32_t)(1 << 10))
#define GPT_CR_FRR ((uint32_t)(1 << 9))
#define GPT_CR_CLKSRC(n) ((uint32_t)(((n)&0x07) << 6))
#define GPT_CR_STOPEN ((uint32_t)(1 << 5))
#define GPT_CR_DOZEEN ((uint32_t)(1 << 4))
#define GPT_CR_WAITEN ((uint32_t)(1 << 3))
#define GPT_CR_DBGEN ((uint32_t)(1 << 2))
#define GPT_CR_ENMOD ((uint32_t)(1 << 1))
#define GPT_CR_EN ((uint32_t)(1 << 0))
#define GPT_PR_PRESCALER24M(n) ((uint32_t)(((n)&0x0F) << 12))
#define GPT_PR_PRESCALER(n) ((uint32_t)(((n)&0xFFF) << 0))
#define GPT_SR_ROV ((uint32_t)(1 << 5))
#define GPT_SR_IF2 ((uint32_t)(1 << 4))
#define GPT_SR_IF1 ((uint32_t)(1 << 3))
#define GPT_SR_OF3 ((uint32_t)(1 << 2))
#define GPT_SR_OF2 ((uint32_t)(1 << 1))
#define GPT_SR_OF1 ((uint32_t)(1 << 0))
#define GPT_IR_ROVIE ((uint32_t)(1 << 5))
#define GPT_IR_IF2IE ((uint32_t)(1 << 4))
#define GPT_IR_IF1IE ((uint32_t)(1 << 3))
#define GPT_IR_OF3IE ((uint32_t)(1 << 2))
#define GPT_IR_OF2IE ((uint32_t)(1 << 1))
#define GPT_IR_OF1IE ((uint32_t)(1 << 0))

