gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
// 34.4: page 1671
#define IMXRT_IOMUXC_GPR (*(IMXRT_REGISTER32_t *)0x400AC000)
#define IOMUXC_GPR_GPR0 (IMXRT_IOMUXC_GPR.offset000)
#define IOMUXC_GPR_GPR1 (IMXRT_IOMUXC_GPR.offset004)
#define IOMUXC_GPR_GPR2 (IMXRT_IOMUXC_GPR.offset008)
#define IOMUXC_GPR_GPR3 (IMXRT_IOMUXC_GPR.offset00C)
#define IOMUXC_GPR_GPR4 (IMXRT_IOMUXC_GPR.offset010)
#define IOMUXC_GPR_GPR5 (IMXRT_IOMUXC_GPR.offset014)
#define IOMUXC_GPR_GPR6 (IMXRT_IOMUXC_GPR.offset018)
#define IOMUXC_GPR_GPR7 (IMXRT_IOMUXC_GPR.offset01C)
#define IOMUXC_GPR_GPR8 (IMXRT_IOMUXC_GPR.offset020)
#define IOMUXC_GPR_GPR9 (IMXRT_IOMUXC_GPR.offset024)
#define IOMUXC_GPR_GPR10 (IMXRT_IOMUXC_GPR.offset028)
#define IOMUXC_GPR_GPR11 (IMXRT_IOMUXC_GPR.offset02C)
#define IOMUXC_GPR_GPR12 (IMXRT_IOMUXC_GPR.offset030)
#define IOMUXC_GPR_GPR13 (IMXRT_IOMUXC_GPR.offset034)
#define IOMUXC_GPR_GPR14 (IMXRT_IOMUXC_GPR.offset038)
#define IOMUXC_GPR_GPR15 (IMXRT_IOMUXC_GPR.offset03C)
#define IOMUXC_GPR_GPR16 (IMXRT_IOMUXC_GPR.offset040)
#define IOMUXC_GPR_GPR17 (IMXRT_IOMUXC_GPR.offset044)
#define IOMUXC_GPR_GPR18 (IMXRT_IOMUXC_GPR.offset048)
#define IOMUXC_GPR_GPR19 (IMXRT_IOMUXC_GPR.offset04C)
#define IOMUXC_GPR_GPR20 (IMXRT_IOMUXC_GPR.offset050)
#define IOMUXC_GPR_GPR21 (IMXRT_IOMUXC_GPR.offset054)
#define IOMUXC_GPR_GPR22 (IMXRT_IOMUXC_GPR.offset058)
#define IOMUXC_GPR_GPR23 (IMXRT_IOMUXC_GPR.offset05C)
#define IOMUXC_GPR_GPR24 (IMXRT_IOMUXC_GPR.offset060)
#define IOMUXC_GPR_GPR25 (IMXRT_IOMUXC_GPR.offset064)
#define IOMUXC_GPR_GPR26 (IMXRT_IOMUXC_GPR.offset068)
#define IOMUXC_GPR_GPR27 (IMXRT_IOMUXC_GPR.offset06C)
#define IOMUXC_GPR_GPR28 (IMXRT_IOMUXC_GPR.offset070)
#define IOMUXC_GPR_GPR29 (IMXRT_IOMUXC_GPR.offset074)
#define IOMUXC_GPR_GPR30 (IMXRT_IOMUXC_GPR.offset078)
#define IOMUXC_GPR_GPR31 (IMXRT_IOMUXC_GPR.offset07C)
#define IOMUXC_GPR_GPR32 (IMXRT_IOMUXC_GPR.offset080)
#define IOMUXC_GPR_GPR33 (IMXRT_IOMUXC_GPR.offset084)
#define IOMUXC_GPR_GPR34 (IMXRT_IOMUXC_GPR.offset088)
#define IOMUXC_GPR_GPR1_CM7_FORCE_HCLK_EN ((uint32_t)(1 << 31))
#define IOMUXC_GPR_GPR1_ENET_IPG_CLK_S_EN ((uint32_t)(1 << 23))
#define IOMUXC_GPR_GPR1_EXC_MON ((uint32_t)(1 << 22))
#define IOMUXC_GPR_GPR1_SAI3_MCLK_DIR ((uint32_t)(1 << 21))
#define IOMUXC_GPR_GPR1_SAI2_MCLK_DIR ((uint32_t)(1 << 20))
#define IOMUXC_GPR_GPR1_SAI1_MCLK_DIR ((uint32_t)(1 << 19))
#define IOMUXC_GPR_GPR1_ENET2_TX_CLK_DIR ((uint32_t)(1 << 18))
#define IOMUXC_GPR_GPR1_ENET1_TX_CLK_DIR ((uint32_t)(1 << 17))
#define IOMUXC_GPR_GPR1_USB_EXP_MODE ((uint32_t)(1 << 15))
#define IOMUXC_GPR_GPR1_ENET2_CLK_SEL ((uint32_t)(1 << 14))
#define IOMUXC_GPR_GPR1_ENET1_CLK_SEL ((uint32_t)(1 << 13))
#define IOMUXC_GPR_GPR1_GINT ((uint32_t)(1 << 12))
#define IOMUXC_GPR_GPR1_SAI3_MCLK3_SEL(n) ((uint32_t)(((n)&0x03) << 10))
#define IOMUXC_GPR_GPR1_SAI2_MCLK3_SEL(n) ((uint32_t)(((n)&0x03) << 8))
#define IOMUXC_GPR_GPR1_SAI1_MCLK3_SEL(n) ((uint32_t)(((n)&0x03) << 6))
#define IOMUXC_GPR_GPR1_SAI1_MCLK2_SEL(n) ((uint32_t)(((n)&0x07) << 3))
#define IOMUXC_GPR_GPR1_SAI1_MCLK1_SEL(n) ((uint32_t)(((n)&0x07) << 0))
#define IOMUXC_GPR_GPR1_SAI3_MCLK3_SEL_MASK IOMUXC_GPR_GPR1_SAI3_MCLK3_SEL(3)
#define IOMUXC_GPR_GPR1_SAI2_MCLK3_SEL_MASK IOMUXC_GPR_GPR1_SAI2_MCLK3_SEL(3)
#define IOMUXC_GPR_GPR1_SAI1_MCLK3_SEL_MASK IOMUXC_GPR_GPR1_SAI1_MCLK3_SEL(3)
#define IOMUXC_GPR_GPR1_SAI1_MCLK2_SEL_MASK IOMUXC_GPR_GPR1_SAI1_MCLK2_SEL(7)
#define IOMUXC_GPR_GPR1_SAI1_MCLK1_SEL_MASK IOMUXC_GPR_GPR1_SAI1_MCLK1_SEL(7)
#define IOMUXC_GPR_GPR2_QTIMER4_TMR_CNTS_FREEZE ((uint32_t)(1 << 31))
#define IOMUXC_GPR_GPR2_QTIMER3_TMR_CNTS_FREEZE ((uint32_t)(1 << 30))
#define IOMUXC_GPR_GPR2_QTIMER2_TMR_CNTS_FREEZE ((uint32_t)(1 << 29))
#define IOMUXC_GPR_GPR2_QTIMER1_TMR_CNTS_FREEZE ((uint32_t)(1 << 28))
#define IOMUXC_GPR_GPR2_MQS_OVERSAMPLE ((uint32_t)(1 << 26))
#define IOMUXC_GPR_GPR2_MQS_EN ((uint32_t)(1 << 25))
#define IOMUXC_GPR_GPR2_MQS_SW_RST ((uint32_t)(1 << 24))
#define IOMUXC_GPR_GPR2_MQS_CLK_DIV(n) ((uint32_t)(((n)&0xFF) << 16))
#define IOMUXC_GPR_GPR2_L2_MEM_DEEPSLEEP ((uint32_t)(1 << 14))
#define IOMUXC_GPR_GPR2_RAM_AUTO_CLK_GATING_EN ((uint32_t)(1 << 13))
#define IOMUXC_GPR_GPR2_L2_MEM_EN_POWERSAVING ((uint32_t)(1 << 12))
#define IOMUXC_GPR_GPR2_CANFD_FILTER_BYPASS ((uint32_t)(1 << 6))
#define IOMUXC_GPR_GPR2_AXBS_P_FORCE_ROUND_ROBIN ((uint32_t)(1 << 5))
#define IOMUXC_GPR_GPR2_AXBS_P_M1_HIGH_PRIORITY ((uint32_t)(1 << 4))
#define IOMUXC_GPR_GPR2_AXBS_P_M0_HIGH_PRIORITY ((uint32_t)(1 << 3))
#define IOMUXC_GPR_GPR2_AXBS_L_FORCE_ROUND_ROBIN ((uint32_t)(1 << 2))
#define IOMUXC_GPR_GPR2_AXBS_L_DMA_HIGH_PRIORITY ((uint32_t)(1 << 1))
#define IOMUXC_GPR_GPR2_AXBS_L_AHBXL_HIGH_PRIORITY ((uint32_t)(1 << 0))
#define IOMUXC_GPR_GPR2_MQS_CLK_DIV_MASK IOMUXC_GPR_GPR2_MQS_CLK_DIV(255)
#define IOMUXC_GPR_GPR3_AXBS_L_HALTED ((uint32_t)(1 << 31))
#define IOMUXC_GPR_GPR3_OCRAM2_STATUS(n) ((uint32_t)(((n)&0x0F) << 24))
#define IOMUXC_GPR_GPR3_OCRAM_STATUS(n) ((uint32_t)(((n)&0x0F) << 16))
#define IOMUXC_GPR_GPR3_AXBS_L_HALT_REQ ((uint32_t)(1 << 15))
#define IOMUXC_GPR_GPR3_OCRAM2_CTL(n) ((uint32_t)(((n)&0x0F) << 8))
#define IOMUXC_GPR_GPR3_DCP_KEY_SEL ((uint32_t)(1 << 4))
#define IOMUXC_GPR_GPR3_OCRAM_CTL(n) ((uint32_t)(((n)&0x0F) << 0))
#define IOMUXC_GPR_GPR4_FLEXSPI2_STOP_ACK ((uint32_t)(1 << 31))
#define IOMUXC_GPR_GPR4_FLEXIO3_STOP_ACK ((uint32_t)(1 << 30))
#define IOMUXC_GPR_GPR4_FLEXIO2_STOP_ACK ((uint32_t)(1 << 29))
#define IOMUXC_GPR_GPR4_FLEXIO1_STOP_ACK ((uint32_t)(1 << 28))
#define IOMUXC_GPR_GPR4_FLEXSPI_STOP_ACK ((uint32_t)(1 << 27))
#define IOMUXC_GPR_GPR4_PIT_STOP_ACK ((uint32_t)(1 << 26))
#define IOMUXC_GPR_GPR4_SEMC_STOP_ACK ((uint32_t)(1 << 25))
#define IOMUXC_GPR_GPR4_SAI3_STOP_ACK ((uint32_t)(1 << 23))
#define IOMUXC_GPR_GPR4_SAI2_STOP_ACK ((uint32_t)(1 << 22))
#define IOMUXC_GPR_GPR4_SAI1_STOP_ACK ((uint32_t)(1 << 21))
#define IOMUXC_GPR_GPR4_ENET_STOP_ACK ((uint32_t)(1 << 20))
#define IOMUXC_GPR_GPR4_TRNG_STOP_ACK ((uint32_t)(1 << 19))
#define IOMUXC_GPR_GPR4_CAN2_STOP_ACK ((uint32_t)(1 << 18))
#define IOMUXC_GPR_GPR4_CAN1_STOP_ACK ((uint32_t)(1 << 17))
#define IOMUXC_GPR_GPR4_EDMA_STOP_ACK ((uint32_t)(1 << 16))
#define IOMUXC_GPR_GPR4_FLEXSPI2_STOP_REQ ((uint32_t)(1 << 15))
#define IOMUXC_GPR_GPR4_FLEXIO3_STOP_REQ ((uint32_t)(1 << 14))
#define IOMUXC_GPR_GPR4_FLEXIO2_STOP_REQ ((uint32_t)(1 << 13))
#define IOMUXC_GPR_GPR4_FLEXIO1_STOP_REQ ((uint32_t)(1 << 12))
#define IOMUXC_GPR_GPR4_FLEXSPI_STOP_REQ ((uint32_t)(1 << 11))
#define IOMUXC_GPR_GPR4_PIT_STOP_REQ ((uint32_t)(1 << 10))
#define IOMUXC_GPR_GPR4_SEMC_STOP_REQ ((uint32_t)(1 << 9))
#define IOMUXC_GPR_GPR4_SAI3_STOP_REQ ((uint32_t)(1 << 7))
#define IOMUXC_GPR_GPR4_SAI2_STOP_REQ ((uint32_t)(1 << 6))
#define IOMUXC_GPR_GPR4_SAI1_STOP_REQ ((uint32_t)(1 << 5))
#define IOMUXC_GPR_GPR4_ENET_STOP_REQ ((uint32_t)(1 << 4))
#define IOMUXC_GPR_GPR4_TRNG_STOP_REQ ((uint32_t)(1 << 3))
#define IOMUXC_GPR_GPR4_CAN2_STOP_REQ ((uint32_t)(1 << 2))
#define IOMUXC_GPR_GPR4_CAN1_STOP_REQ ((uint32_t)(1 << 1))
#define IOMUXC_GPR_GPR4_EDMA_STOP_REQ ((uint32_t)(1 << 0))
#define IOMUXC_GPR_GPR5_VREF_1M_CLK_GPT2 ((uint32_t)(1 << 29))
#define IOMUXC_GPR_GPR5_VREF_1M_CLK_GPT1 ((uint32_t)(1 << 28))
#define IOMUXC_GPR_GPR5_ENET2_EVENT3IN_SEL ((uint32_t)(1 << 26))
#define IOMUXC_GPR_GPR5_ENET_EVENT3IN_SEL ((uint32_t)(1 << 25))
#define IOMUXC_GPR_GPR5_GPT2_CAPIN2_SEL ((uint32_t)(1 << 24))
#define IOMUXC_GPR_GPR5_GPT2_CAPIN1_SEL ((uint32_t)(1 << 23))
#define IOMUXC_GPR_GPR5_WDOG2_MASK ((uint32_t)(1 << 7))
#define IOMUXC_GPR_GPR5_WDOG1_MASK ((uint32_t)(1 << 6))
#define IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_19 ((uint32_t)(1 << 31))
#define IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_18 ((uint32_t)(1 << 30))
#define IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_17 ((uint32_t)(1 << 29))
#define IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_16 ((uint32_t)(1 << 28))
#define IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_15 ((uint32_t)(1 << 27))
#define IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_14 ((uint32_t)(1 << 26))
#define IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_13 ((uint32_t)(1 << 25))
#define IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_12 ((uint32_t)(1 << 24))
#define IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_11 ((uint32_t)(1 << 23))
#define IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_10 ((uint32_t)(1 << 22))
#define IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_9 ((uint32_t)(1 << 21))
#define IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_8 ((uint32_t)(1 << 20))
#define IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_7 ((uint32_t)(1 << 19))
#define IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_6 ((uint32_t)(1 << 18))
#define IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_5 ((uint32_t)(1 << 17))
#define IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_4 ((uint32_t)(1 << 16))
#define IOMUXC_GPR_GPR6_QTIMER4_TRM3_INPUT_SEL ((uint32_t)(1 << 15))
#define IOMUXC_GPR_GPR6_QTIMER4_TRM2_INPUT_SEL ((uint32_t)(1 << 14))
#define IOMUXC_GPR_GPR6_QTIMER4_TRM1_INPUT_SEL ((uint32_t)(1 << 13))
#define IOMUXC_GPR_GPR6_QTIMER4_TRM0_INPUT_SEL ((uint32_t)(1 << 12))
#define IOMUXC_GPR_GPR6_QTIMER3_TRM3_INPUT_SEL ((uint32_t)(1 << 11))
#define IOMUXC_GPR_GPR6_QTIMER3_TRM2_INPUT_SEL ((uint32_t)(1 << 10))
#define IOMUXC_GPR_GPR6_QTIMER3_TRM1_INPUT_SEL ((uint32_t)(1 << 9))
#define IOMUXC_GPR_GPR6_QTIMER3_TRM0_INPUT_SEL ((uint32_t)(1 << 8))
#define IOMUXC_GPR_GPR6_QTIMER2_TRM3_INPUT_SEL ((uint32_t)(1 << 7))
#define IOMUXC_GPR_GPR6_QTIMER2_TRM2_INPUT_SEL ((uint32_t)(1 << 6))
#define IOMUXC_GPR_GPR6_QTIMER2_TRM1_INPUT_SEL ((uint32_t)(1 << 5))
#define IOMUXC_GPR_GPR6_QTIMER2_TRM0_INPUT_SEL ((uint32_t)(1 << 4))
#define IOMUXC_GPR_GPR6_QTIMER1_TRM3_INPUT_SEL ((uint32_t)(1 << 3))
#define IOMUXC_GPR_GPR6_QTIMER1_TRM2_INPUT_SEL ((uint32_t)(1 << 2))
#define IOMUXC_GPR_GPR6_QTIMER1_TRM1_INPUT_SEL ((uint32_t)(1 << 1))
#define IOMUXC_GPR_GPR6_QTIMER1_TRM0_INPUT_SEL ((uint32_t)(1 << 0))
#define IOMUXC_GPR_GPR7_LPUART8_STOP_ACK ((uint32_t)(1 << 31))
#define IOMUXC_GPR_GPR7_LPUART7_STOP_ACK ((uint32_t)(1 << 30))
#define IOMUXC_GPR_GPR7_LPUART6_STOP_ACK ((uint32_t)(1 << 29))
#define IOMUXC_GPR_GPR7_LPUART5_STOP_ACK ((uint32_t)(1 << 28))
#define IOMUXC_GPR_GPR7_LPUART4_STOP_ACK ((uint32_t)(1 << 27))
#define IOMUXC_GPR_GPR7_LPUART3_STOP_ACK ((uint32_t)(1 << 26))
#define IOMUXC_GPR_GPR7_LPUART2_STOP_ACK ((uint32_t)(1 << 25))
#define IOMUXC_GPR_GPR7_LPUART1_STOP_ACK ((uint32_t)(1 << 24))
#define IOMUXC_GPR_GPR7_LPSPI4_STOP_ACK ((uint32_t)(1 << 23))
#define IOMUXC_GPR_GPR7_LPSPI3_STOP_ACK ((uint32_t)(1 << 22))
#define IOMUXC_GPR_GPR7_LPSPI2_STOP_ACK ((uint32_t)(1 << 21))
#define IOMUXC_GPR_GPR7_LPSPI1_STOP_ACK ((uint32_t)(1 << 20))
#define IOMUXC_GPR_GPR7_LPI2C4_STOP_ACK ((uint32_t)(1 << 19))
#define IOMUXC_GPR_GPR7_LPI2C3_STOP_ACK ((uint32_t)(1 << 18))
#define IOMUXC_GPR_GPR7_LPI2C2_STOP_ACK ((uint32_t)(1 << 17))
#define IOMUXC_GPR_GPR7_LPI2C1_STOP_ACK ((uint32_t)(1 << 16))
#define IOMUXC_GPR_GPR7_LPUART8_STOP_REQ ((uint32_t)(1 << 15))
#define IOMUXC_GPR_GPR7_LPUART7_STOP_REQ ((uint32_t)(1 << 14))
#define IOMUXC_GPR_GPR7_LPUART6_STOP_REQ ((uint32_t)(1 << 13))
#define IOMUXC_GPR_GPR7_LPUART5_STOP_REQ ((uint32_t)(1 << 12))
#define IOMUXC_GPR_GPR7_LPUART4_STOP_REQ ((uint32_t)(1 << 11))
#define IOMUXC_GPR_GPR7_LPUART3_STOP_REQ ((uint32_t)(1 << 10))
#define IOMUXC_GPR_GPR7_LPUART2_STOP_REQ ((uint32_t)(1 << 9))
#define IOMUXC_GPR_GPR7_LPUART1_STOP_REQ ((uint32_t)(1 << 8))
#define IOMUXC_GPR_GPR7_LPSPI4_STOP_REQ ((uint32_t)(1 << 7))
#define IOMUXC_GPR_GPR7_LPSPI3_STOP_REQ ((uint32_t)(1 << 6))
#define IOMUXC_GPR_GPR7_LPSPI2_STOP_REQ ((uint32_t)(1 << 5))
#define IOMUXC_GPR_GPR7_LPSPI1_STOP_REQ ((uint32_t)(1 << 4))
#define IOMUXC_GPR_GPR7_LPI2C4_STOP_REQ ((uint32_t)(1 << 3))
#define IOMUXC_GPR_GPR7_LPI2C3_STOP_REQ ((uint32_t)(1 << 2))
#define IOMUXC_GPR_GPR7_LPI2C2_STOP_REQ ((uint32_t)(1 << 1))
#define IOMUXC_GPR_GPR7_LPI2C1_STOP_REQ ((uint32_t)(1 << 0))
#define IOMUXC_GPR_GPR8_LPUART8_IPG_DOZE ((uint32_t)(1 << 31))
#define IOMUXC_GPR_GPR8_LPUART8_IPG_STOP_MODE ((uint32_t)(1 << 30))
#define IOMUXC_GPR_GPR8_LPUART7_IPG_DOZE ((uint32_t)(1 << 29))
#define IOMUXC_GPR_GPR8_LPUART7_IPG_STOP_MODE ((uint32_t)(1 << 28))
#define IOMUXC_GPR_GPR8_LPUART6_IPG_DOZE ((uint32_t)(1 << 27))
#define IOMUXC_GPR_GPR8_LPUART6_IPG_STOP_MODE ((uint32_t)(1 << 26))
#define IOMUXC_GPR_GPR8_LPUART5_IPG_DOZE ((uint32_t)(1 << 25))
#define IOMUXC_GPR_GPR8_LPUART5_IPG_STOP_MODE ((uint32_t)(1 << 24))
#define IOMUXC_GPR_GPR8_LPUART4_IPG_DOZE ((uint32_t)(1 << 23))
#define IOMUXC_GPR_GPR8_LPUART4_IPG_STOP_MODE ((uint32_t)(1 << 22))
#define IOMUXC_GPR_GPR8_LPUART3_IPG_DOZE ((uint32_t)(1 << 21))
#define IOMUXC_GPR_GPR8_LPUART3_IPG_STOP_MODE ((uint32_t)(1 << 20))
#define IOMUXC_GPR_GPR8_LPUART2_IPG_DOZE ((uint32_t)(1 << 19))
#define IOMUXC_GPR_GPR8_LPUART2_IPG_STOP_MODE ((uint32_t)(1 << 18))
#define IOMUXC_GPR_GPR8_LPUART1_IPG_DOZE ((uint32_t)(1 << 17))
#define IOMUXC_GPR_GPR8_LPUART1_IPG_STOP_MODE ((uint32_t)(1 << 16))
#define IOMUXC_GPR_GPR8_LPSPI4_IPG_DOZE ((uint32_t)(1 << 15))
#define IOMUXC_GPR_GPR8_LPSPI4_IPG_STOP_MODE ((uint32_t)(1 << 14))
#define IOMUXC_GPR_GPR8_LPSPI3_IPG_DOZE ((uint32_t)(1 << 13))
#define IOMUXC_GPR_GPR8_LPSPI3_IPG_STOP_MODE ((uint32_t)(1 << 12))
#define IOMUXC_GPR_GPR8_LPSPI2_IPG_DOZE ((uint32_t)(1 << 11))
#define IOMUXC_GPR_GPR8_LPSPI2_IPG_STOP_MODE ((uint32_t)(1 << 10))
#define IOMUXC_GPR_GPR8_LPSPI1_IPG_DOZE ((uint32_t)(1 << 9))
#define IOMUXC_GPR_GPR8_LPSPI1_IPG_STOP_MODE ((uint32_t)(1 << 8))
#define IOMUXC_GPR_GPR8_LPI2C4_IPG_DOZE ((uint32_t)(1 << 7))
#define IOMUXC_GPR_GPR8_LPI2C4_IPG_STOP_MODE ((uint32_t)(1 << 6))
#define IOMUXC_GPR_GPR8_LPI2C3_IPG_DOZE ((uint32_t)(1 << 5))
#define IOMUXC_GPR_GPR8_LPI2C3_IPG_STOP_MODE ((uint32_t)(1 << 4))
#define IOMUXC_GPR_GPR8_LPI2C2_IPG_DOZE ((uint32_t)(1 << 3))
#define IOMUXC_GPR_GPR8_LPI2C2_IPG_STOP_MODE ((uint32_t)(1 << 2))
#define IOMUXC_GPR_GPR8_LPI2C1_IPG_DOZE ((uint32_t)(1 << 1))
#define IOMUXC_GPR_GPR8_LPI2C1_IPG_STOP_MODE ((uint32_t)(1 << 0))
#define IOMUXC_GPR_GPR10_LOCK_OCRAM_TZ_ADDR(n) ((uint32_t)(((n)&0x7F) << 25))
#define IOMUXC_GPR_GPR10_LOCK_OCRAM_TZ_EN ((uint32_t)(1 << 24))
#define IOMUXC_GPR_GPR10_LOCK_DCPKEY_OCOTP_OR_KEYMUX ((uint32_t)(1 << 20))
#define IOMUXC_GPR_GPR10_LOCK_SEC_ERR_RESP ((uint32_t)(1 << 18))
#define IOMUXC_GPR_GPR10_LOCK_DBG_EN ((uint32_t)(1 << 17))
#define IOMUXC_GPR_GPR10_LOCK_NIDEN ((uint32_t)(1 << 16))
#define IOMUXC_GPR_GPR10_OCRAM_TZ_ADDR(n) ((uint32_t)(((n)&0x7F) << 9))
#define IOMUXC_GPR_GPR10_OCRAM_TZ_EN ((uint32_t)(1 << 8))
#define IOMUXC_GPR_GPR10_DCPKEY_OCOTP_OR_KEYMUX ((uint32_t)(1 << 4))
#define IOMUXC_GPR_GPR10_SEC_ERR_RESP ((uint32_t)(1 << 2))
#define IOMUXC_GPR_GPR10_DBG_EN ((uint32_t)(1 << 1))
#define IOMUXC_GPR_GPR10_NIDEN ((uint32_t)(1 << 0))
#define IOMUXC_GPR_GPR11_LOCK_BEE_DE_RX_EN(n) ((uint32_t)(((n)&0x0F) << 24))
#define IOMUXC_GPR_GPR11_LOCK_M7_APC_AC_R3_CTRL(n) ((uint32_t)(((n)&0x03) << 22))
#define IOMUXC_GPR_GPR11_LOCK_M7_APC_AC_R2_CTRL(n) ((uint32_t)(((n)&0x03) << 20))
#define IOMUXC_GPR_GPR11_LOCK_M7_APC_AC_R1_CTRL(n) ((uint32_t)(((n)&0x03) << 18))
#define IOMUXC_GPR_GPR11_LOCK_M7_APC_AC_R0_CTRL(n) ((uint32_t)(((n)&0x03) << 16))
#define IOMUXC_GPR_GPR11_BEE_DE_RX_EN(n) ((uint32_t)(((n)&0x0F) << 8))
#define IOMUXC_GPR_GPR11_M7_APC_AC_R3_CTRL(n) ((uint32_t)(((n)&0x03) << 6))
#define IOMUXC_GPR_GPR11_M7_APC_AC_R2_CTRL(n) ((uint32_t)(((n)&0x03) << 4))
#define IOMUXC_GPR_GPR11_M7_APC_AC_R1_CTRL(n) ((uint32_t)(((n)&0x03) << 2))
#define IOMUXC_GPR_GPR11_M7_APC_AC_R0_CTRL(n) ((uint32_t)(((n)&0x03) << 0))
#define IOMUXC_GPR_GPR12_FLEXIO3_IPG_DOZE ((uint32_t)(1 << 6))
#define IOMUXC_GPR_GPR12_FLEXIO3_IPG_STOP_MODE ((uint32_t)(1 << 5))
#define IOMUXC_GPR_GPR12_ACMP_IPG_STOP_MODE ((uint32_t)(1 << 4))
#define IOMUXC_GPR_GPR12_FLEXIO2_IPG_DOZE ((uint32_t)(1 << 3))
#define IOMUXC_GPR_GPR12_FLEXIO2_IPG_STOP_MODE ((uint32_t)(1 << 2))
#define IOMUXC_GPR_GPR12_FLEXIO1_IPG_DOZE ((uint32_t)(1 << 1))
#define IOMUXC_GPR_GPR12_FLEXIO1_IPG_STOP_MODE ((uint32_t)(1 << 0))
#define IOMUXC_GPR_GPR13_CANFD_STOP_ACK ((uint32_t)(1 << 20))
#define IOMUXC_GPR_GPR13_CACHE_USB ((uint32_t)(1 << 13))
#define IOMUXC_GPR_GPR13_CACHE_ENET ((uint32_t)(1 << 7))
#define IOMUXC_GPR_GPR13_CANFD_STOP_REQ ((uint32_t)(1 << 4))
#define IOMUXC_GPR_GPR13_AWCACHE_USDHC ((uint32_t)(1 << 1))
#define IOMUXC_GPR_GPR13_ARCACHE_USDHC ((uint32_t)(1 << 0))
#define IOMUXC_GPR_GPR14_CM7_MX6RT_CFGDTCMSZ(n) ((uint32_t)(((n)&0x0F) << 20))
#define IOMUXC_GPR_GPR14_CM7_MX6RT_CFGITCMSZ(n) ((uint32_t)(((n)&0x0F) << 16))
#define IOMUXC_GPR_GPR14_ACMP4_SAMPLE_SYNC_EN ((uint32_t)(1 << 11))
#define IOMUXC_GPR_GPR14_ACMP3_SAMPLE_SYNC_EN ((uint32_t)(1 << 10))
#define IOMUXC_GPR_GPR14_ACMP2_SAMPLE_SYNC_EN ((uint32_t)(1 << 9))
#define IOMUXC_GPR_GPR14_ACMP1_SAMPLE_SYNC_EN ((uint32_t)(1 << 8))
#define IOMUXC_GPR_GPR14_ACMP4_CMP_IGEN_TRIM_UP ((uint32_t)(1 << 7))
#define IOMUXC_GPR_GPR14_ACMP3_CMP_IGEN_TRIM_UP ((uint32_t)(1 << 6))
#define IOMUXC_GPR_GPR14_ACMP2_CMP_IGEN_TRIM_UP ((uint32_t)(1 << 5))
#define IOMUXC_GPR_GPR14_ACMP1_CMP_IGEN_TRIM_UP ((uint32_t)(1 << 4))
#define IOMUXC_GPR_GPR14_ACMP4_CMP_IGEN_TRIM_DN ((uint32_t)(1 << 3))
#define IOMUXC_GPR_GPR14_ACMP3_CMP_IGEN_TRIM_DN ((uint32_t)(1 << 2))
#define IOMUXC_GPR_GPR14_ACMP2_CMP_IGEN_TRIM_DN ((uint32_t)(1 << 1))
#define IOMUXC_GPR_GPR14_ACMP1_CMP_IGEN_TRIM_DN ((uint32_t)(1 << 0))
#define IOMUXC_GPR_GPR16_CM7_INIT_VTOR(n) ((uint32_t)(((n)&0x1FFFFFF) << 7))
#define IOMUXC_GPR_GPR16_FLEXRAM_BANK_CFG_SEL ((uint32_t)(1 << 2))
#define IOMUXC_GPR_GPR16_INIT_DTCM_EN ((uint32_t)(1 << 1))
#define IOMUXC_GPR_GPR16_INIT_ITCM_EN ((uint32_t)(1 << 0))
#define IOMUXC_GPR_GPR18_M7_APC_AC_R0_BOT(n) ((uint32_t)(((n)&0x1FFFFFFF) << 3))
#define IOMUXC_GPR_GPR18_LOCK_M7_APC_AC_R0_BOT ((uint32_t)(1 << 0))
#define IOMUXC_GPR_GPR19_M7_APC_AC_R0_TOP(n) ((uint32_t)(((n)&0x1FFFFFFF) << 3))
#define IOMUXC_GPR_GPR19_LOCK_M7_APC_AC_R0_TOP ((uint32_t)(1 << 0))
#define IOMUXC_GPR_GPR20_M7_APC_AC_R1_BOT(n) ((uint32_t)(((n)&0x1FFFFFFF) << 3))
#define IOMUXC_GPR_GPR20_LOCK_M7_APC_AC_R1_BOT ((uint32_t)(1 << 0))
#define IOMUXC_GPR_GPR21_M7_APC_AC_R1_TOP(n) ((uint32_t)(((n)&0x1FFFFFFF) << 3))
#define IOMUXC_GPR_GPR21_LOCK_M7_APC_AC_R1_TOP ((uint32_t)(1 << 0))
#define IOMUXC_GPR_GPR22_M7_APC_AC_R2_BOT(n) ((uint32_t)(((n)&0x1FFFFFFF) << 3))
#define IOMUXC_GPR_GPR22_LOCK_M7_APC_AC_R2_BOT ((uint32_t)(1 << 0))
#define IOMUXC_GPR_GPR23_M7_APC_AC_R2_TOP(n) ((uint32_t)(((n)&0x1FFFFFFF) << 3))
#define IOMUXC_GPR_GPR23_LOCK_M7_APC_AC_R2_TOP ((uint32_t)(1 << 0))
#define IOMUXC_GPR_GPR24_M7_APC_AC_R3_BOT(n) ((uint32_t)(((n)&0x1FFFFFFF) << 3))
#define IOMUXC_GPR_GPR24_LOCK_M7_APC_AC_R3_BOT ((uint32_t)(1 << 0))
#define IOMUXC_GPR_GPR25_M7_APC_AC_R3_TOP(n) ((uint32_t)(((n)&0x1FFFFFFF) << 3))
#define IOMUXC_GPR_GPR25_LOCK_M7_APC_AC_R3_TOP ((uint32_t)(1 << 0))
#define IOMUXC_GPR_GPR33_LOCK_OCRAM2_TZ_ADDR(n) ((uint32_t)(((n)&0x7F) << 17))
#define IOMUXC_GPR_GPR33_LOCK_OCRAM2_TZ_EN ((uint32_t)(1 << 16))
#define IOMUXC_GPR_GPR33_OCRAM2_TZ_ADDR(n) ((uint32_t)(((n)&0x7F) << 1))
#define IOMUXC_GPR_GPR33_OCRAM2_TZ_EN ((uint32_t)(1 << 0))
#define IOMUXC_GPR_GPR34_SIP_TEST_MUX_QSPI_SIP_EN ((uint32_t)(1 << 8))
#define IOMUXC_GPR_GPR34_SIP_TEST_MUX_BOOT_PIN_SEL(n) ((uint32_t)(((n)&0xFF) << 0))

// 34.5: page 1717
#define IMXRT_IOMUXC_SNVS (*(IMXRT_REGISTER32_t *)0x400A8000)
#define IOMUXC_SNVS_SW_MUX_CTL_PAD_WAKEUP (IMXRT_IOMUXC_SNVS.offset000)
#define IOMUXC_SNVS_SW_MUX_CTL_PAD_PMIC_ON_REQ (IMXRT_IOMUXC_SNVS.offset004)
#define IOMUXC_SNVS_SW_MUX_CTL_PAD_PMIC_STBY_REQ (IMXRT_IOMUXC_SNVS.offset008)
#define IOMUXC_SNVS_SW_PAD_CTL_PAD_TEST_MODE (IMXRT_IOMUXC_SNVS.offset00C)
#define IOMUXC_SNVS_SW_PAD_CTL_PAD_POR_B (IMXRT_IOMUXC_SNVS.offset010)
#define IOMUXC_SNVS_SW_PAD_CTL_PAD_ONOFF (IMXRT_IOMUXC_SNVS.offset014)
#define IOMUXC_SNVS_SW_PAD_CTL_PAD_WAKEUP (IMXRT_IOMUXC_SNVS.offset018)
#define IOMUXC_SNVS_SW_PAD_CTL_PAD_PMIC_ON_REQ (IMXRT_IOMUXC_SNVS.offset01C)
#define IOMUXC_SNVS_SW_PAD_CTL_PAD_PMIC_STBY_REQ (IMXRT_IOMUXC_SNVS.offset020)

// 34.6: page 1732
#define IMXRT_IOMUXC_SNVS_GPR (*(IMXRT_REGISTER32_t *)0x400A4000)
#define IOMUXC_SNVS_GPR_GPR0 (IMXRT_IOMUXC_SNVS_GPR.offset000)
#define IOMUXC_SNVS_GPR_GPR1 (IMXRT_IOMUXC_SNVS_GPR.offset004)
#define IOMUXC_SNVS_GPR_GPR2 (IMXRT_IOMUXC_SNVS_GPR.offset008)
#define IOMUXC_SNVS_GPR_GPR3 (IMXRT_IOMUXC_SNVS_GPR.offset00C)

