gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
// 36.4: page 2325
#define IMXRT_LCDIF (*(IMXRT_REGISTER32_t *)0x402B8000)
#define LCDIF_CTRL (IMXRT_LCDIF.offset000)
#define LCDIF_CTRL_SET (IMXRT_LCDIF.offset004)
#define LCDIF_CTRL_CLR (IMXRT_LCDIF.offset008)
#define LCDIF_CTRL_TOG (IMXRT_LCDIF.offset00C)
#define LCDIF_CTRL1 (IMXRT_LCDIF.offset010)
#define LCDIF_CTRL1_SET (IMXRT_LCDIF.offset014)
#define LCDIF_CTRL1_CLR (IMXRT_LCDIF.offset018)
#define LCDIF_CTRL1_TOG (IMXRT_LCDIF.offset01C)
#define LCDIF_CTRL2 (IMXRT_LCDIF.offset020)
#define LCDIF_CTRL2_SET (IMXRT_LCDIF.offset024)
#define LCDIF_CTRL2_CLR (IMXRT_LCDIF.offset028)
#define LCDIF_CTRL2_TOG (IMXRT_LCDIF.offset02C)
#define LCDIF_TRANSFER_COUNT (IMXRT_LCDIF.offset030)
#define LCDIF_CUR_BUF (IMXRT_LCDIF.offset040)
#define LCDIF_NEXT_BUF (IMXRT_LCDIF.offset050)
#define LCDIF_VDCTRL0 (IMXRT_LCDIF.offset070)
#define LCDIF_VDCTRL0_SET (IMXRT_LCDIF.offset074)
#define LCDIF_VDCTRL0_CLR (IMXRT_LCDIF.offset078)
#define LCDIF_VDCTRL0_TOG (IMXRT_LCDIF.offset07C)
#define LCDIF_VDCTRL1 (IMXRT_LCDIF.offset080)
#define LCDIF_VDCTRL2 (IMXRT_LCDIF.offset090)
#define LCDIF_VDCTRL3 (IMXRT_LCDIF.offset0A0)
#define LCDIF_VDCTRL4 (IMXRT_LCDIF.offset0B0)
#define LCDIF_BM_ERROR_STAT (IMXRT_LCDIF.offset190)
#define LCDIF_CRC_STAT (IMXRT_LCDIF.offset1A0)
#define LCDIF_STAT (IMXRT_LCDIF.offset1B0)
#define LCDIF_THRES (IMXRT_LCDIF.offset200)
#define LCDIF_AS_CTRL (IMXRT_LCDIF.offset210)
#define LCDIF_AS_BUF (IMXRT_LCDIF.offset220)
#define LCDIF_AS_NEXT_BUF (IMXRT_LCDIF.offset230)
#define LCDIF_AS_CLRKEYLOW (IMXRT_LCDIF.offset240)
#define LCDIF_AS_CLRKEYHIGH (IMXRT_LCDIF.offset250)
#define LCDIF_PIGEONCTRL0 (IMXRT_LCDIF.offset380)
#define LCDIF_PIGEONCTRL0_SET (IMXRT_LCDIF.offset384)
#define LCDIF_PIGEONCTRL0_CLR (IMXRT_LCDIF.offset388)
#define LCDIF_PIGEONCTRL0_TOG (IMXRT_LCDIF.offset38C)
#define LCDIF_PIGEONCTRL1 (IMXRT_LCDIF.offset390)
#define LCDIF_PIGEONCTRL1_SET (IMXRT_LCDIF.offset394)
#define LCDIF_PIGEONCTRL1_CLR (IMXRT_LCDIF.offset398)
#define LCDIF_PIGEONCTRL1_TOG (IMXRT_LCDIF.offset39C)
#define LCDIF_PIGEONCTRL2 (IMXRT_LCDIF.offset3A0)
#define LCDIF_PIGEONCTRL2_SET (IMXRT_LCDIF.offset3A4)
#define LCDIF_PIGEONCTRL2_CLR (IMXRT_LCDIF.offset3A8)
#define LCDIF_PIGEONCTRL2_TOG (IMXRT_LCDIF.offset3AC)
#define IMXRT_LCDIF_b (*(IMXRT_REGISTER32_t *)0x402B8800)
#define LCDIF_PIGEON_0_0 (IMXRT_LCDIF_b.offset000)
#define LCDIF_PIGEON_0_1 (IMXRT_LCDIF_b.offset010)
#define LCDIF_PIGEON_0_2 (IMXRT_LCDIF_b.offset020)
#define LCDIF_PIGEON_1_0 (IMXRT_LCDIF_b.offset040)
#define LCDIF_PIGEON_1_1 (IMXRT_LCDIF_b.offset050)
#define LCDIF_PIGEON_1_2 (IMXRT_LCDIF_b.offset060)
#define LCDIF_PIGEON_2_0 (IMXRT_LCDIF_b.offset080)
#define LCDIF_PIGEON_2_1 (IMXRT_LCDIF_b.offset090)
#define LCDIF_PIGEON_2_2 (IMXRT_LCDIF_b.offset0A0)
#define LCDIF_PIGEON_3_0 (IMXRT_LCDIF_b.offset0C0)
#define LCDIF_PIGEON_3_1 (IMXRT_LCDIF_b.offset0D0)
#define LCDIF_PIGEON_3_2 (IMXRT_LCDIF_b.offset0E0)
#define LCDIF_PIGEON_4_0 (IMXRT_LCDIF_b.offset100)
#define LCDIF_PIGEON_4_1 (IMXRT_LCDIF_b.offset110)
#define LCDIF_PIGEON_4_2 (IMXRT_LCDIF_b.offset120)
#define LCDIF_PIGEON_5_0 (IMXRT_LCDIF_b.offset140)
#define LCDIF_PIGEON_5_1 (IMXRT_LCDIF_b.offset150)
#define LCDIF_PIGEON_5_2 (IMXRT_LCDIF_b.offset160)
#define LCDIF_PIGEON_6_0 (IMXRT_LCDIF_b.offset180)
#define LCDIF_PIGEON_6_1 (IMXRT_LCDIF_b.offset190)
#define LCDIF_PIGEON_6_2 (IMXRT_LCDIF_b.offset1A0)
#define LCDIF_PIGEON_7_0 (IMXRT_LCDIF_b.offset1C0)
#define LCDIF_PIGEON_7_1 (IMXRT_LCDIF_b.offset1D0)
#define LCDIF_PIGEON_7_2 (IMXRT_LCDIF_b.offset1E0)
#define LCDIF_PIGEON_8_0 (IMXRT_LCDIF_b.offset200)
#define LCDIF_PIGEON_8_1 (IMXRT_LCDIF_b.offset210)
#define LCDIF_PIGEON_8_2 (IMXRT_LCDIF_b.offset220)
#define LCDIF_PIGEON_9_0 (IMXRT_LCDIF_b.offset240)
#define LCDIF_PIGEON_9_1 (IMXRT_LCDIF_b.offset250)
#define LCDIF_PIGEON_9_2 (IMXRT_LCDIF_b.offset260)
#define LCDIF_PIGEON_10_0 (IMXRT_LCDIF_b.offset280)
#define LCDIF_PIGEON_10_1 (IMXRT_LCDIF_b.offset290)
#define LCDIF_PIGEON_10_2 (IMXRT_LCDIF_b.offset2A0)
#define LCDIF_PIGEON_11_0 (IMXRT_LCDIF_b.offset2C0)
#define LCDIF_PIGEON_11_1 (IMXRT_LCDIF_b.offset2D0)
#define LCDIF_PIGEON_11_2 (IMXRT_LCDIF_b.offset2E0)

// 37.4: page 2371
typedef struct
{
    const uint32_t VERID;
    const uint32_t PARAM;
    const uint32_t unused1;
    const uint32_t unused2;
    volatile uint32_t MCR;    // 010
    volatile uint32_t MSR;    // 014
    volatile uint32_t MIER;   // 018
    volatile uint32_t MDER;   // 01C
    volatile uint32_t MCFGR0; // 020
    volatile uint32_t MCFGR1; // 024
    volatile uint32_t MCFGR2; // 028
    volatile uint32_t MCFGR3; // 02C
    volatile uint32_t unused3[4];
    volatile uint32_t MDMR; // 040
    volatile uint32_t unused4;
    volatile uint32_t MCCR0; // 048
    volatile uint32_t unused5;
    volatile uint32_t MCCR1; // 050
    volatile uint32_t unused6;
    volatile uint32_t MFCR; // 058
    volatile uint32_t MFSR; // 05C
    volatile uint32_t MTDR; // 060
    volatile uint32_t unused7[3];
    volatile uint32_t MRDR; // 070
    volatile uint32_t unused8[39];
    volatile uint32_t SCR;  // 110
    volatile uint32_t SSR;  // 114
    volatile uint32_t SIER; // 118
    volatile uint32_t SDER; // 11C
    volatile uint32_t unused9;
    volatile uint32_t SCFGR1; // 124
    volatile uint32_t SCFGR2; // 128
    volatile uint32_t unused10[5];
    volatile uint32_t SAMR; // 140
    volatile uint32_t unused11[3];
    volatile uint32_t SASR; // 150
    volatile uint32_t unused12[3];
    volatile uint32_t STAR; // 154
    volatile uint32_t unused13[3];
    volatile uint32_t STDR; // 160
    volatile uint32_t unused14[3];
    volatile uint32_t SRDR; // 170
} IMXRT_LPI2C_t;
#define IMXRT_LPI2C1 (*(IMXRT_LPI2C_t *)0x403F0000)
#define LPI2C1_VERID (IMXRT_LPI2C1.VERID)
#define LPI2C1_PARAM (IMXRT_LPI2C1.PARAM)
#define LPI2C1_MCR (IMXRT_LPI2C1.MCR)
#define LPI2C1_MSR (IMXRT_LPI2C1.MSR)
#define LPI2C1_MIER (IMXRT_LPI2C1.MIER)
#define LPI2C1_MDER (IMXRT_LPI2C1.MDER)
#define LPI2C1_MCFGR0 (IMXRT_LPI2C1.MCFGR0)
#define LPI2C1_MCFGR1 (IMXRT_LPI2C1.MCFGR1)
#define LPI2C1_MCFGR2 (IMXRT_LPI2C1.MCFGR2)
#define LPI2C1_MCFGR3 (IMXRT_LPI2C1.MCFGR3)
#define LPI2C1_MDMR (IMXRT_LPI2C1.MDMR)
#define LPI2C1_MCCR0 (IMXRT_LPI2C1.MCCR0)
#define LPI2C1_MCCR1 (IMXRT_LPI2C1.MCCR1)
#define LPI2C1_MFCR (IMXRT_LPI2C1.MFCR)
#define LPI2C1_MFSR (IMXRT_LPI2C1.MFSR)
#define LPI2C1_MTDR (IMXRT_LPI2C1.MTDR)
#define LPI2C1_MRDR (IMXRT_LPI2C1.MRDR)
#define LPI2C1_SCR (IMXRT_LPI2C1.SCR)
#define LPI2C1_SSR (IMXRT_LPI2C1.SSR)
#define LPI2C1_SIER (IMXRT_LPI2C1.SIER)
#define LPI2C1_SDER (IMXRT_LPI2C1.SDER)
#define LPI2C1_SCFGR1 (IMXRT_LPI2C1.SCFGR1)
#define LPI2C1_SCFGR2 (IMXRT_LPI2C1.SCFGR2)
#define LPI2C1_SAMR (IMXRT_LPI2C1.SAMR)
#define LPI2C1_SASR (IMXRT_LPI2C1.SASR)
#define LPI2C1_STAR (IMXRT_LPI2C1.STAR)
#define LPI2C1_STDR (IMXRT_LPI2C1.STDR)
#define LPI2C1_SRDR (IMXRT_LPI2C1.SRDR)
#define IMXRT_LPI2C2 (*(IMXRT_LPI2C_t *)0x403F4000)
#define LPI2C2_VERID (IMXRT_LPI2C2.VERID)
#define LPI2C2_PARAM (IMXRT_LPI2C2.PARAM)
#define LPI2C2_MCR (IMXRT_LPI2C2.MCR)
#define LPI2C2_MSR (IMXRT_LPI2C2.MSR)
#define LPI2C2_MIER (IMXRT_LPI2C2.MIER)
#define LPI2C2_MDER (IMXRT_LPI2C2.MDER)
#define LPI2C2_MCFGR0 (IMXRT_LPI2C2.MCFGR0)
#define LPI2C2_MCFGR1 (IMXRT_LPI2C2.MCFGR1)
#define LPI2C2_MCFGR2 (IMXRT_LPI2C2.MCFGR2)
#define LPI2C2_MCFGR3 (IMXRT_LPI2C2.MCFGR3)
#define LPI2C2_MDMR (IMXRT_LPI2C2.MDMR)
#define LPI2C2_MCCR0 (IMXRT_LPI2C2.MCCR0)
#define LPI2C2_MCCR1 (IMXRT_LPI2C2.MCCR1)
#define LPI2C2_MFCR (IMXRT_LPI2C2.MFCR)
#define LPI2C2_MFSR (IMXRT_LPI2C2.MFSR)
#define LPI2C2_MTDR (IMXRT_LPI2C2.MTDR)
#define LPI2C2_MRDR (IMXRT_LPI2C2.MRDR)
#define LPI2C2_SCR (IMXRT_LPI2C2.SCR)
#define LPI2C2_SSR (IMXRT_LPI2C2.SSR)
#define LPI2C2_SIER (IMXRT_LPI2C2.SIER)
#define LPI2C2_SDER (IMXRT_LPI2C2.SDER)
#define LPI2C2_SCFGR1 (IMXRT_LPI2C2.SCFGR1)
#define LPI2C2_SCFGR2 (IMXRT_LPI2C2.SCFGR2)
#define LPI2C2_SAMR (IMXRT_LPI2C2.SAMR)
#define LPI2C2_SASR (IMXRT_LPI2C2.SASR)
#define LPI2C2_STAR (IMXRT_LPI2C2.STAR)
#define LPI2C2_STDR (IMXRT_LPI2C2.STDR)
#define LPI2C2_SRDR (IMXRT_LPI2C2.SRDR)
#define IMXRT_LPI2C3 (*(IMXRT_LPI2C_t *)0x403F8000)
#define LPI2C3_VERID (IMXRT_LPI2C3.VERID)
#define LPI2C3_PARAM (IMXRT_LPI2C3.PARAM)
#define LPI2C3_MCR (IMXRT_LPI2C3.MCR)
#define LPI2C3_MSR (IMXRT_LPI2C3.MSR)
#define LPI2C3_MIER (IMXRT_LPI2C3.MIER)
#define LPI2C3_MDER (IMXRT_LPI2C3.MDER)
#define LPI2C3_MCFGR0 (IMXRT_LPI2C3.MCFGR0)
#define LPI2C3_MCFGR1 (IMXRT_LPI2C3.MCFGR1)
#define LPI2C3_MCFGR2 (IMXRT_LPI2C3.MCFGR2)
#define LPI2C3_MCFGR3 (IMXRT_LPI2C3.MCFGR3)
#define LPI2C3_MDMR (IMXRT_LPI2C3.MDMR)
#define LPI2C3_MCCR0 (IMXRT_LPI2C3.MCCR0)
#define LPI2C3_MCCR1 (IMXRT_LPI2C3.MCCR1)
#define LPI2C3_MFCR (IMXRT_LPI2C3.MFCR)
#define LPI2C3_MFSR (IMXRT_LPI2C3.MFSR)
#define LPI2C3_MTDR (IMXRT_LPI2C3.MTDR)
#define LPI2C3_MRDR (IMXRT_LPI2C3.MRDR)
#define LPI2C3_SCR (IMXRT_LPI2C3.SCR)
#define LPI2C3_SSR (IMXRT_LPI2C3.SSR)
#define LPI2C3_SIER (IMXRT_LPI2C3.SIER)
#define LPI2C3_SDER (IMXRT_LPI2C3.SDER)
#define LPI2C3_SCFGR1 (IMXRT_LPI2C3.SCFGR1)
#define LPI2C3_SCFGR2 (IMXRT_LPI2C3.SCFGR2)
#define LPI2C3_SAMR (IMXRT_LPI2C3.SAMR)
#define LPI2C3_SASR (IMXRT_LPI2C3.SASR)
#define LPI2C3_STAR (IMXRT_LPI2C3.STAR)
#define LPI2C3_STDR (IMXRT_LPI2C3.STDR)
#define LPI2C3_SRDR (IMXRT_LPI2C3.SRDR)
#define IMXRT_LPI2C4 (*(IMXRT_LPI2C_t *)0x403FC000)
#define LPI2C4_VERID (IMXRT_LPI2C4.VERID)
#define LPI2C4_PARAM (IMXRT_LPI2C4.PARAM)
#define LPI2C4_MCR (IMXRT_LPI2C4.MCR)
#define LPI2C4_MSR (IMXRT_LPI2C4.MSR)
#define LPI2C4_MIER (IMXRT_LPI2C4.MIER)
#define LPI2C4_MDER (IMXRT_LPI2C4.MDER)
#define LPI2C4_MCFGR0 (IMXRT_LPI2C4.MCFGR0)
#define LPI2C4_MCFGR1 (IMXRT_LPI2C4.MCFGR1)
#define LPI2C4_MCFGR2 (IMXRT_LPI2C4.MCFGR2)
#define LPI2C4_MCFGR3 (IMXRT_LPI2C4.MCFGR3)
#define LPI2C4_MDMR (IMXRT_LPI2C4.MDMR)
#define LPI2C4_MCCR0 (IMXRT_LPI2C4.MCCR0)
#define LPI2C4_MCCR1 (IMXRT_LPI2C4.MCCR1)
#define LPI2C4_MFCR (IMXRT_LPI2C4.MFCR)
#define LPI2C4_MFSR (IMXRT_LPI2C4.MFSR)
#define LPI2C4_MTDR (IMXRT_LPI2C4.MTDR)
#define LPI2C4_MRDR (IMXRT_LPI2C4.MRDR)
#define LPI2C4_SCR (IMXRT_LPI2C4.SCR)
#define LPI2C4_SSR (IMXRT_LPI2C4.SSR)
#define LPI2C4_SIER (IMXRT_LPI2C4.SIER)
#define LPI2C4_SDER (IMXRT_LPI2C4.SDER)
#define LPI2C4_SCFGR1 (IMXRT_LPI2C4.SCFGR1)
#define LPI2C4_SCFGR2 (IMXRT_LPI2C4.SCFGR2)
#define LPI2C4_SAMR (IMXRT_LPI2C4.SAMR)
#define LPI2C4_SASR (IMXRT_LPI2C4.SASR)
#define LPI2C4_STAR (IMXRT_LPI2C4.STAR)
#define LPI2C4_STDR (IMXRT_LPI2C4.STDR)
#define LPI2C4_SRDR (IMXRT_LPI2C4.SRDR)
#define LPI2C_MCR_RRF ((uint32_t)(1 << 9))
#define LPI2C_MCR_RTF ((uint32_t)(1 << 8))
#define LPI2C_MCR_DBGEN ((uint32_t)(1 << 3))
#define LPI2C_MCR_DOZEN ((uint32_t)(1 << 2))
#define LPI2C_MCR_RST ((uint32_t)(1 << 1))
#define LPI2C_MCR_MEN ((uint32_t)(1 << 0))
#define LPI2C_MSR_BBF ((uint32_t)(1 << 25))
#define LPI2C_MSR_MBF ((uint32_t)(1 << 24))
#define LPI2C_MSR_DMF ((uint32_t)(1 << 14))
#define LPI2C_MSR_PLTF ((uint32_t)(1 << 13))
#define LPI2C_MSR_FEF ((uint32_t)(1 << 12))
#define LPI2C_MSR_ALF ((uint32_t)(1 << 11))
#define LPI2C_MSR_NDF ((uint32_t)(1 << 10))
#define LPI2C_MSR_SDF ((uint32_t)(1 << 9))
#define LPI2C_MSR_EPF ((uint32_t)(1 << 8))
#define LPI2C_MSR_RDF ((uint32_t)(1 << 1))
#define LPI2C_MSR_TDF ((uint32_t)(1 << 0))
#define LPI2C_MIER_DMIE ((uint32_t)(1 << 14))
#define LPI2C_MIER_PLTIE ((uint32_t)(1 << 13))
#define LPI2C_MIER_FEIE ((uint32_t)(1 << 12))
#define LPI2C_MIER_ALIE ((uint32_t)(1 << 11))
#define LPI2C_MIER_NDIE ((uint32_t)(1 << 10))
#define LPI2C_MIER_SDIE ((uint32_t)(1 << 9))
#define LPI2C_MIER_EPIE ((uint32_t)(1 << 8))
#define LPI2C_MIER_RDIE ((uint32_t)(1 << 1))
#define LPI2C_MIER_TDIE ((uint32_t)(1 << 0))
#define LPI2C_MDER_RDDE ((uint32_t)(1 << 1))
#define LPI2C_MDER_TDDE ((uint32_t)(1 << 0))
#define LPI2C_MCFGR0_RDMO ((uint32_t)(1 << 9))
#define LPI2C_MCFGR0_CIRFIFO ((uint32_t)(1 << 8))
#define LPI2C_MCFGR0_HRSEL ((uint32_t)(1 << 2))
#define LPI2C_MCFGR0_HRPOL ((uint32_t)(1 << 1))
#define LPI2C_MCFGR0_HREN ((uint32_t)(1 << 0))
#define LPI2C_MCFGR1_PINCFG(n) ((uint32_t)(((n)&0x07) << 24))
#define LPI2C_MCFGR1_MATCFG(n) ((uint32_t)(((n)&0x07) << 16))
#define LPI2C_MCFGR1_TIMECFG ((uint32_t)(1 << 10))
#define LPI2C_MCFGR1_IGNACK ((uint32_t)(1 << 9))
#define LPI2C_MCFGR1_AUTOSTOP ((uint32_t)(1 << 8))
#define LPI2C_MCFGR1_PRESCALE(n) ((uint32_t)(((n)&0x07) << 0))
#define LPI2C_MCFGR2_FILTSDA(n) ((uint32_t)(((n)&0x0F) << 24))
#define LPI2C_MCFGR2_FILTSCL(n) ((uint32_t)(((n)&0x0F) << 16))
#define LPI2C_MCFGR2_BUSIDLE(n) ((uint32_t)(((n)&0xFFF) << 0))
#define LPI2C_MCFGR3_PINLOW(n) ((uint32_t)(((n)&0xFFF) << 8))
#define LPI2C_MDMR_MATCH1(n) ((uint32_t)(((n)&0xFF) << 16))
#define LPI2C_MDMR_MATCH0(n) ((uint32_t)(((n)&0xFF) << 0))
#define LPI2C_MCCR0_DATAVD(n) ((uint32_t)(((n)&0x3F) << 24))
#define LPI2C_MCCR0_SETHOLD(n) ((uint32_t)(((n)&0x3F) << 16))
#define LPI2C_MCCR0_CLKHI(n) ((uint32_t)(((n)&0x3F) << 8))
#define LPI2C_MCCR0_CLKLO(n) ((uint32_t)(((n)&0x3F) << 0))
#define LPI2C_MCCR1_DATAVD(n) ((uint32_t)(((n)&0x3F) << 24))
#define LPI2C_MCCR1_SETHOLD(n) ((uint32_t)(((n)&0x3F) << 16))
#define LPI2C_MCCR1_CLKHI(n) ((uint32_t)(((n)&0x3F) << 8))
#define LPI2C_MCCR1_CLKLO(n) ((uint32_t)(((n)&0x3F) << 0))
#define LPI2C_MFCR_RXWATER(n) ((uint32_t)(((n)&0x03) << 16))
#define LPI2C_MFCR_TXWATER(n) ((uint32_t)(((n)&0x03) << 0))
#define LPI2C_MFSR_RXCOUNT(n) ((uint32_t)(((n)&0x07) << 16))
#define LPI2C_MFSR_TXCOUNT(n) ((uint32_t)(((n)&0x07) << 16))
#define LPI2C_MTDR_CMD(n) ((uint32_t)(((n)&0x07) << 8))
#define LPI2C_MTDR_CMD_TRANSMIT ((uint32_t)(0 << 8))
#define LPI2C_MTDR_CMD_RECEIVE ((uint32_t)(1 << 8))
#define LPI2C_MTDR_CMD_STOP ((uint32_t)(2 << 8))
#define LPI2C_MTDR_CMD_DISCARD ((uint32_t)(3 << 8))
#define LPI2C_MTDR_CMD_START ((uint32_t)(4 << 8))
#define LPI2C_MTDR_CMD_START_NACK ((uint32_t)(5 << 8))
#define LPI2C_MTDR_CMD_HS_START ((uint32_t)(6 << 8))
#define LPI2C_MTDR_CMD_HS_START_NAcK ((uint32_t)(7 << 8))
#define LPI2C_MTDR_DATA(n) ((uint32_t)(((n)&0xFF) << 0))
#define LPI2C_MRDR_RXEMPTY ((uint32_t)(1 << 14))
#define LPI2C_MRDR_DATA(n) ((uint32_t)(((n)&0xFF) << 0))
#define LPI2C_SCR_RRF ((uint32_t)(1 << 9))
#define LPI2C_SCR_RTF ((uint32_t)(1 << 8))
#define LPI2C_SCR_FILTDZ ((uint32_t)(1 << 5))
#define LPI2C_SCR_FILTEN ((uint32_t)(1 << 4))
#define LPI2C_SCR_RST ((uint32_t)(1 << 1))
#define LPI2C_SCR_SEN ((uint32_t)(1 << 0))
#define LPI2C_SSR_BBF ((uint32_t)(1 << 25))
#define LPI2C_SSR_SBF ((uint32_t)(1 << 24))
#define LPI2C_SSR_SARF ((uint32_t)(1 << 15))
#define LPI2C_SSR_GCF ((uint32_t)(1 << 14))
#define LPI2C_SSR_AM1F ((uint32_t)(1 << 13))
#define LPI2C_SSR_AM0F ((uint32_t)(1 << 12))
#define LPI2C_SSR_FEF ((uint32_t)(1 << 11))
#define LPI2C_SSR_BEF ((uint32_t)(1 << 10))
#define LPI2C_SSR_SDF ((uint32_t)(1 << 9))
#define LPI2C_SSR_RSF ((uint32_t)(1 << 8))
#define LPI2C_SSR_TAF ((uint32_t)(1 << 3))
#define LPI2C_SSR_AVF ((uint32_t)(1 << 2))
#define LPI2C_SSR_RDF ((uint32_t)(1 << 1))
#define LPI2C_SSR_TDF ((uint32_t)(1 << 0))
#define LPI2C_SIER_SARIE ((uint32_t)(1 << 25))
#define LPI2C_SIER_GCIE ((uint32_t)(1 << 24))
#define LPI2C_SIER_AM1F ((uint32_t)(1 << 13))
#define LPI2C_SIER_AM0IE ((uint32_t)(1 << 12))
#define LPI2C_SIER_FEIE ((uint32_t)(1 << 11))
#define LPI2C_SIER_BEIE ((uint32_t)(1 << 10))
#define LPI2C_SIER_SDIE ((uint32_t)(1 << 9))
#define LPI2C_SIER_RSIE ((uint32_t)(1 << 8))
#define LPI2C_SIER_TAIE ((uint32_t)(1 << 3))
#define LPI2C_SIER_AVIE ((uint32_t)(1 << 2))
#define LPI2C_SIER_RDIE ((uint32_t)(1 << 1))
#define LPI2C_SIER_TDIE ((uint32_t)(1 << 0))
#define LPI2C_SDER_AVDE ((uint32_t)(1 << 2))
#define LPI2C_SDER_RDDE ((uint32_t)(1 << 1))
#define LPI2C_SDER_TDDE ((uint32_t)(1 << 0))
#define LPI2C_SCFGR1_ADDRCFG(n) ((uint32_t)(((n)&0x07) << 16))
#define LPI2C_SCFGR1_HSMEN ((uint32_t)(1 << 13))
#define LPI2C_SCFGR1_IGNACK ((uint32_t)(1 << 12))
#define LPI2C_SCFGR1_RXCFG ((uint32_t)(1 << 11))
#define LPI2C_SCFGR1_TXCFG ((uint32_t)(1 << 10))
#define LPI2C_SCFGR1_SAEN ((uint32_t)(1 << 9))
#define LPI2C_SCFGR1_GCEN ((uint32_t)(1 << 8))
#define LPI2C_SCFGR1_ACKSTALL ((uint32_t)(1 << 3))
#define LPI2C_SCFGR1_TXDSTALL ((uint32_t)(1 << 2))
#define LPI2C_SCFGR1_RXSTALL ((uint32_t)(1 << 1))
#define LPI2C_SCFGR1_ADRSTALL ((uint32_t)(1 << 0))
#define LPI2C_SCFGR2_FILTSDA(n) ((uint32_t)(((n)&0x0F) << 24))
#define LPI2C_SCFGR2_FILTSCL(n) ((uint32_t)(((n)&0x0F) << 16))
#define LPI2C_SCFGR2_DATAVD(n) ((uint32_t)(((n)&0x3F) << 8))
#define LPI2C_SCFGR2_CLKHOLD(n) ((uint32_t)(((n)&0x0F) << 0))
#define LPI2C_SAMR_ADDR1(n) ((uint32_t)(((n)&0x7F) << 17))
#define LPI2C_SAMR_ADDR0(n) ((uint32_t)(((n)&0x7F) << 1))
#define LPI2C_SASR_ANV ((uint32_t)(1 << 14))
#define LPI2C_SASR_RADDR(n) ((uint32_t)(((n)&0x7FF) << 0))
#define LPI2C_STAR_TXNACK ((uint32_t)(1 << 0))
#define LPI2C_STDR_DATA(n) ((uint32_t)(((n)&0xFF) << 0))
#define LPI2C_SRDR_SOF ((uint32_t)(1 << 15))
#define LPI2C_SRDR_RXEMPTY ((uint32_t)(1 << 14))
#define LPI2C_SRDR_DATA(n) ((uint32_t)(((n)&0xFF) << 0))

// 38.3.5.2: page 2422
typedef struct
{
    const uint32_t VERID;    // 0
    const uint32_t PARAM;    // 0x04
    const uint32_t UNUSED0;  // 0x08
    const uint32_t UNUSED1;  // 0x0c
    volatile uint32_t CR;    // 0x10
    volatile uint32_t SR;    // 0x14
    volatile uint32_t IER;   // 0x18
    volatile uint32_t DER;   // 0x1c
    volatile uint32_t CFGR0; // 0x20
    volatile uint32_t CFGR1; // 0x24
    const uint32_t UNUSED3;  // 0x28
    const uint32_t UNUSED4;  // 0x2c
    volatile uint32_t DMR0;  // 0x30
    volatile uint32_t DMR1;  // 0x34
    const uint32_t UNUSED5;  // 0x38
    const uint32_t UNUSED6;  // 0x3c
    volatile uint32_t CCR;   // 0x40
    const uint32_t UNUSED7;  // 0x44
    const uint32_t UNUSED8;  // 0x48
    const uint32_t UNUSED9;  // 0x4c
    const uint32_t UNUSED10; // 0x50
    const uint32_t UNUSED11; // 0x54
    volatile uint32_t FCR;   // 0x58
    volatile uint32_t FSR;   // 0x5C
    volatile uint32_t TCR;   // 0x60
    volatile uint32_t TDR;   // 0x64
    const uint32_t UNUSED12; // 0x68
    const uint32_t UNUSED13; // 0x6c
    volatile uint32_t RSR;   // 0x70
    volatile uint32_t RDR;   // 0x74
} IMXRT_LPSPI_t;

