gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
#define IMXRT_LPSPI1 (*(IMXRT_REGISTER32_t *)0x40394000)
#define IMXRT_LPSPI1_S (*(IMXRT_LPSPI_t *)0x40394000)
#define LPSPI1_VERID (IMXRT_LPSPI1.offset000)
#define LPSPI1_PARAM (IMXRT_LPSPI1.offset004)
#define LPSPI1_CR (IMXRT_LPSPI1.offset010)
#define LPSPI1_SR (IMXRT_LPSPI1.offset014)
#define LPSPI1_IER (IMXRT_LPSPI1.offset018)
#define LPSPI1_DER (IMXRT_LPSPI1.offset01C)
#define LPSPI1_CFGR0 (IMXRT_LPSPI1.offset020)
#define LPSPI1_CFGR1 (IMXRT_LPSPI1.offset024)
#define LPSPI1_DMR0 (IMXRT_LPSPI1.offset030)
#define LPSPI1_DMR1 (IMXRT_LPSPI1.offset034)
#define LPSPI1_CCR (IMXRT_LPSPI1.offset040)
#define LPSPI1_FCR (IMXRT_LPSPI1.offset058)
#define LPSPI1_FSR (IMXRT_LPSPI1.offset05C)
#define LPSPI1_TCR (IMXRT_LPSPI1.offset060)
#define LPSPI1_TDR (IMXRT_LPSPI1.offset064)
#define LPSPI1_RSR (IMXRT_LPSPI1.offset070)
#define LPSPI1_RDR (IMXRT_LPSPI1.offset074)
#define IMXRT_LPSPI2 (*(IMXRT_REGISTER32_t *)0x40398000)
#define IMXRT_LPSPI2_S (*(IMXRT_LPSPI_t *)0x40398000)
#define LPSPI2_VERID (IMXRT_LPSPI2.offset000)
#define LPSPI2_PARAM (IMXRT_LPSPI2.offset004)
#define LPSPI2_CR (IMXRT_LPSPI2.offset010)
#define LPSPI2_SR (IMXRT_LPSPI2.offset014)
#define LPSPI2_IER (IMXRT_LPSPI2.offset018)
#define LPSPI2_DER (IMXRT_LPSPI2.offset01C)
#define LPSPI2_CFGR0 (IMXRT_LPSPI2.offset020)
#define LPSPI2_CFGR1 (IMXRT_LPSPI2.offset024)
#define LPSPI2_DMR0 (IMXRT_LPSPI2.offset030)
#define LPSPI2_DMR1 (IMXRT_LPSPI2.offset034)
#define LPSPI2_CCR (IMXRT_LPSPI2.offset040)
#define LPSPI2_FCR (IMXRT_LPSPI2.offset058)
#define LPSPI2_FSR (IMXRT_LPSPI2.offset05C)
#define LPSPI2_TCR (IMXRT_LPSPI2.offset060)
#define LPSPI2_TDR (IMXRT_LPSPI2.offset064)
#define LPSPI2_RSR (IMXRT_LPSPI2.offset070)
#define LPSPI2_RDR (IMXRT_LPSPI2.offset074)
#define IMXRT_LPSPI3 (*(IMXRT_REGISTER32_t *)0x4039C000)
#define IMXRT_LPSPI3_S (*(IMXRT_LPSPI_t *)0x4039C000)
#define LPSPI3_VERID (IMXRT_LPSPI3.offset000)
#define LPSPI3_PARAM (IMXRT_LPSPI3.offset004)
#define LPSPI3_CR (IMXRT_LPSPI3.offset010)
#define LPSPI3_SR (IMXRT_LPSPI3.offset014)
#define LPSPI3_IER (IMXRT_LPSPI3.offset018)
#define LPSPI3_DER (IMXRT_LPSPI3.offset01C)
#define LPSPI3_CFGR0 (IMXRT_LPSPI3.offset020)
#define LPSPI3_CFGR1 (IMXRT_LPSPI3.offset024)
#define LPSPI3_DMR0 (IMXRT_LPSPI3.offset030)
#define LPSPI3_DMR1 (IMXRT_LPSPI3.offset034)
#define LPSPI3_CCR (IMXRT_LPSPI3.offset040)
#define LPSPI3_FCR (IMXRT_LPSPI3.offset058)
#define LPSPI3_FSR (IMXRT_LPSPI3.offset05C)
#define LPSPI3_TCR (IMXRT_LPSPI3.offset060)
#define LPSPI3_TDR (IMXRT_LPSPI3.offset064)
#define LPSPI3_RSR (IMXRT_LPSPI3.offset070)
#define LPSPI3_RDR (IMXRT_LPSPI3.offset074)
#define IMXRT_LPSPI4 (*(IMXRT_REGISTER32_t *)0x403A0000)
#define IMXRT_LPSPI4_S (*(IMXRT_LPSPI_t *)0x403A0000)
#define LPSPI4_VERID (IMXRT_LPSPI4.offset000)
#define LPSPI4_PARAM (IMXRT_LPSPI4.offset004)
#define LPSPI4_CR (IMXRT_LPSPI4.offset010)
#define LPSPI4_SR (IMXRT_LPSPI4.offset014)
#define LPSPI4_IER (IMXRT_LPSPI4.offset018)
#define LPSPI4_DER (IMXRT_LPSPI4.offset01C)
#define LPSPI4_CFGR0 (IMXRT_LPSPI4.offset020)
#define LPSPI4_CFGR1 (IMXRT_LPSPI4.offset024)
#define LPSPI4_DMR0 (IMXRT_LPSPI4.offset030)
#define LPSPI4_DMR1 (IMXRT_LPSPI4.offset034)
#define LPSPI4_CCR (IMXRT_LPSPI4.offset040)
#define LPSPI4_FCR (IMXRT_LPSPI4.offset058)
#define LPSPI4_FSR (IMXRT_LPSPI4.offset05C)
#define LPSPI4_TCR (IMXRT_LPSPI4.offset060)
#define LPSPI4_TDR (IMXRT_LPSPI4.offset064)
#define LPSPI4_RSR (IMXRT_LPSPI4.offset070)
#define LPSPI4_RDR (IMXRT_LPSPI4.offset074)
#define LPSPI_CR_RRF ((uint32_t)(1 << 9))
#define LPSPI_CR_RTF ((uint32_t)(1 << 8))
#define LPSPI_CR_DBGEN ((uint32_t)(1 << 3))
#define LPSPI_CR_DOZEN ((uint32_t)(1 << 2))
#define LPSPI_CR_RST ((uint32_t)(1 << 1))
#define LPSPI_CR_MEN ((uint32_t)(1 << 0))
#define LPSPI_SR_MBF ((uint32_t)(1 << 24))
#define LPSPI_SR_DMF ((uint32_t)(1 << 13))
#define LPSPI_SR_REF ((uint32_t)(1 << 12))
#define LPSPI_SR_TEF ((uint32_t)(1 << 11))
#define LPSPI_SR_TCF ((uint32_t)(1 << 10))
#define LPSPI_SR_FCF ((uint32_t)(1 << 9))
#define LPSPI_SR_WCF ((uint32_t)(1 << 8))
#define LPSPI_SR_RDF ((uint32_t)(1 << 1))
#define LPSPI_SR_TDF ((uint32_t)(1 << 0))
#define LPSPI_IER_DMIE ((uint32_t)(1 << 13))
#define LPSPI_IER_REIE ((uint32_t)(1 << 12))
#define LPSPI_IER_TEIE ((uint32_t)(1 << 11))
#define LPSPI_IER_TCIE ((uint32_t)(1 << 10))
#define LPSPI_IER_FCIE ((uint32_t)(1 << 9))
#define LPSPI_IER_WCIE ((uint32_t)(1 << 8))
#define LPSPI_IER_RDIE ((uint32_t)(1 << 1))
#define LPSPI_IER_TDIE ((uint32_t)(1 << 0))
#define LPSPI_DER_RDDE ((uint32_t)(1 << 1))
#define LPSPI_DER_TDDE ((uint32_t)(1 << 0))
#define LPSPI_CFGR0_RDMO ((uint32_t)(1 << 9))
#define LPSPI_CFGR0_CIRFIFO ((uint32_t)(1 << 8))
#define LPSPI_CFGR0_HRSEL ((uint32_t)(1 << 2))
#define LPSPI_CFGR0_HRPOL ((uint32_t)(1 << 1))
#define LPSPI_CFGR0_HREN ((uint32_t)(1 << 0))
#define LPSPI_CFGR1_PCSCFG ((uint32_t)(1 << 27))
#define LPSPI_CFGR1_OUTCFG ((uint32_t)(1 << 26))
#define LPSPI_CFGR1_PINCFG(n) ((uint32_t)(((n)&0x03) << 24))
#define LPSPI_CFGR1_MATCFG(n) ((uint32_t)(((n)&0x07) << 16))
#define LPSPI_CFGR1_PCSPOL(n) ((uint32_t)(((n)&0x0F) << 8))
#define LPSPI_CFGR1_NOSTALL ((uint32_t)(1 << 3))
#define LPSPI_CFGR1_AUTOPCS ((uint32_t)(1 << 2))
#define LPSPI_CFGR1_SAMPLE ((uint32_t)(1 << 1))
#define LPSPI_CFGR1_MASTER ((uint32_t)(1 << 0))
#define LPSPI_CCR_SCKPCS(n) ((uint32_t)(((n)&0xFF) << 24))
#define LPSPI_CCR_PCSSCK(n) ((uint32_t)(((n)&0xFF) << 16))
#define LPSPI_CCR_DBT(n) ((uint32_t)(((n)&0xFF) << 8))
#define LPSPI_CCR_SCKDIV(n) ((uint32_t)(((n)&0xFF) << 0))
#define LPSPI_FCR_RXWATER(n) ((uint32_t)(((n)&0x0F) << 16))
#define LPSPI_FCR_TXWATER(n) ((uint32_t)(((n)&0x0F) << 0))
#define LPSPI_FSR_RXCOUNT(n) ((uint32_t)(((n)&0x1F) << 16))
#define LPSPI_FSR_TXCOUNT(n) ((uint32_t)(((n)&0x1F) << 0))
#define LPSPI_TCR_CPOL ((uint32_t)(1 << 31))
#define LPSPI_TCR_CPHA ((uint32_t)(1 << 30))
#define LPSPI_TCR_PRESCALE(n) ((uint32_t)(((n)&0x07) << 27))
#define LPSPI_TCR_PCS(n) ((uint32_t)(((n)&0x03) << 24))
#define LPSPI_TCR_LSBF ((uint32_t)(1 << 23))
#define LPSPI_TCR_BYSW ((uint32_t)(1 << 22))
#define LPSPI_TCR_CONT ((uint32_t)(1 << 21))
#define LPSPI_TCR_CONTC ((uint32_t)(1 << 20))
#define LPSPI_TCR_RXMSK ((uint32_t)(1 << 19))
#define LPSPI_TCR_TXMSK ((uint32_t)(1 << 18))
#define LPSPI_TCR_WIDTH(n) ((uint32_t)(((n)&0x03) << 16))
#define LPSPI_TCR_FRAMESZ(n) ((uint32_t)(((n)&0xFFF) << 0))
#define LPSPI_RSR_RXEMPTY ((uint32_t)(1 << 1))
#define LPSPI_RSR_SOF ((uint32_t)(1 << 0))

// 39.3.1.1: page 2466
typedef struct
{
    const uint32_t VERID;
    const uint32_t PARAM;
    volatile uint32_t GLOBAL;
    volatile uint32_t PINCFG;
    volatile uint32_t BAUD;
    volatile uint32_t STAT;
    volatile uint32_t CTRL;
    volatile uint32_t DATA;
    volatile uint32_t MATCH;
    volatile uint32_t MODIR;
    volatile uint32_t FIFO;
    volatile uint32_t WATER;
} IMXRT_LPUART_t;
#define IMXRT_LPUART1 (*(IMXRT_LPUART_t *)0x40184000)
#define LPUART1_VERID (IMXRT_LPUART1.VERID)
#define LPUART1_PARAM (IMXRT_LPUART1.PARAM)
#define LPUART1_GLOBAL (IMXRT_LPUART1.GLOBAL)
#define LPUART1_PINCFG (IMXRT_LPUART1.PINCFG)
#define LPUART1_BAUD (IMXRT_LPUART1.BAUD)
#define LPUART1_STAT (IMXRT_LPUART1.STAT)
#define LPUART1_CTRL (IMXRT_LPUART1.CTRL)
#define LPUART1_DATA (IMXRT_LPUART1.DATA)
#define LPUART1_MATCH (IMXRT_LPUART1.MATCH)
#define LPUART1_MODIR (IMXRT_LPUART1.MODIR)
#define LPUART1_FIFO (IMXRT_LPUART1.FIFO)
#define LPUART1_WATER (IMXRT_LPUART1.WATER)
#define IMXRT_LPUART2 (*(IMXRT_LPUART_t *)0x40188000)
#define LPUART2_VERID (IMXRT_LPUART2.VERID)
#define LPUART2_PARAM (IMXRT_LPUART2.PARAM)
#define LPUART2_GLOBAL (IMXRT_LPUART2.GLOBAL)
#define LPUART2_PINCFG (IMXRT_LPUART2.PINCFG)
#define LPUART2_BAUD (IMXRT_LPUART2.BAUD)
#define LPUART2_STAT (IMXRT_LPUART2.STAT)
#define LPUART2_CTRL (IMXRT_LPUART2.CTRL)
#define LPUART2_DATA (IMXRT_LPUART2.DATA)
#define LPUART2_MATCH (IMXRT_LPUART2.MATCH)
#define LPUART2_MODIR (IMXRT_LPUART2.MODIR)
#define LPUART2_FIFO (IMXRT_LPUART2.FIFO)
#define LPUART2_WATER (IMXRT_LPUART2.WATER)
#define IMXRT_LPUART3 (*(IMXRT_LPUART_t *)0x4018C000)
#define LPUART3_VERID (IMXRT_LPUART3.VERID)
#define LPUART3_PARAM (IMXRT_LPUART3.PARAM)
#define LPUART3_GLOBAL (IMXRT_LPUART3.GLOBAL)
#define LPUART3_PINCFG (IMXRT_LPUART3.PINCFG)
#define LPUART3_BAUD (IMXRT_LPUART3.BAUD)
#define LPUART3_STAT (IMXRT_LPUART3.STAT)
#define LPUART3_CTRL (IMXRT_LPUART3.CTRL)
#define LPUART3_DATA (IMXRT_LPUART3.DATA)
#define LPUART3_MATCH (IMXRT_LPUART3.MATCH)
#define LPUART3_MODIR (IMXRT_LPUART3.MODIR)
#define LPUART3_FIFO (IMXRT_LPUART3.FIFO)
#define LPUART3_WATER (IMXRT_LPUART3.WATER)
#define IMXRT_LPUART4 (*(IMXRT_LPUART_t *)0x40190000)
#define LPUART4_VERID (IMXRT_LPUART4.VERID)
#define LPUART4_PARAM (IMXRT_LPUART4.PARAM)
#define LPUART4_GLOBAL (IMXRT_LPUART4.GLOBAL)
#define LPUART4_PINCFG (IMXRT_LPUART4.PINCFG)
#define LPUART4_BAUD (IMXRT_LPUART4.BAUD)
#define LPUART4_STAT (IMXRT_LPUART4.STAT)
#define LPUART4_CTRL (IMXRT_LPUART4.CTRL)
#define LPUART4_DATA (IMXRT_LPUART4.DATA)
#define LPUART4_MATCH (IMXRT_LPUART4.MATCH)
#define LPUART4_MODIR (IMXRT_LPUART4.MODIR)
#define LPUART4_FIFO (IMXRT_LPUART4.FIFO)
#define LPUART4_WATER (IMXRT_LPUART4.WATER)
#define IMXRT_LPUART5 (*(IMXRT_LPUART_t *)0x40194000)
#define LPUART5_VERID (IMXRT_LPUART5.VERID)
#define LPUART5_PARAM (IMXRT_LPUART5.PARAM)
#define LPUART5_GLOBAL (IMXRT_LPUART5.GLOBAL)
#define LPUART5_PINCFG (IMXRT_LPUART5.PINCFG)
#define LPUART5_BAUD (IMXRT_LPUART5.BAUD)
#define LPUART5_STAT (IMXRT_LPUART5.STAT)
#define LPUART5_CTRL (IMXRT_LPUART5.CTRL)
#define LPUART5_DATA (IMXRT_LPUART5.DATA)
#define LPUART5_MATCH (IMXRT_LPUART5.MATCH)
#define LPUART5_MODIR (IMXRT_LPUART5.MODIR)
#define LPUART5_FIFO (IMXRT_LPUART5.FIFO)
#define LPUART5_WATER (IMXRT_LPUART5.WATER)
#define IMXRT_LPUART6 (*(IMXRT_LPUART_t *)0x40198000)
#define LPUART6_VERID (IMXRT_LPUART6.VERID)
#define LPUART6_PARAM (IMXRT_LPUART6.PARAM)
#define LPUART6_GLOBAL (IMXRT_LPUART6.GLOBAL)
#define LPUART6_PINCFG (IMXRT_LPUART6.PINCFG)
#define LPUART6_BAUD (IMXRT_LPUART6.BAUD)
#define LPUART6_STAT (IMXRT_LPUART6.STAT)
#define LPUART6_CTRL (IMXRT_LPUART6.CTRL)
#define LPUART6_DATA (IMXRT_LPUART6.DATA)
#define LPUART6_MATCH (IMXRT_LPUART6.MATCH)
#define LPUART6_MODIR (IMXRT_LPUART6.MODIR)
#define LPUART6_FIFO (IMXRT_LPUART6.FIFO)
#define LPUART6_WATER (IMXRT_LPUART6.WATER)
#define IMXRT_LPUART7 (*(IMXRT_LPUART_t *)0x4019C000)
#define LPUART7_VERID (IMXRT_LPUART7.VERID)
#define LPUART7_PARAM (IMXRT_LPUART7.PARAM)
#define LPUART7_GLOBAL (IMXRT_LPUART7.GLOBAL)
#define LPUART7_PINCFG (IMXRT_LPUART7.PINCFG)
#define LPUART7_BAUD (IMXRT_LPUART7.BAUD)
#define LPUART7_STAT (IMXRT_LPUART7.STAT)
#define LPUART7_CTRL (IMXRT_LPUART7.CTRL)
#define LPUART7_DATA (IMXRT_LPUART7.DATA)
#define LPUART7_MATCH (IMXRT_LPUART7.MATCH)
#define LPUART7_MODIR (IMXRT_LPUART7.MODIR)
#define LPUART7_FIFO (IMXRT_LPUART7.FIFO)
#define LPUART7_WATER (IMXRT_LPUART7.WATER)
#define IMXRT_LPUART8 (*(IMXRT_LPUART_t *)0x401A0000)
#define LPUART8_VERID (IMXRT_LPUART8.VERID)
#define LPUART8_PARAM (IMXRT_LPUART8.PARAM)
#define LPUART8_GLOBAL (IMXRT_LPUART8.GLOBAL)
#define LPUART8_PINCFG (IMXRT_LPUART8.PINCFG)
#define LPUART8_BAUD (IMXRT_LPUART8.BAUD)
#define LPUART8_STAT (IMXRT_LPUART8.STAT)
#define LPUART8_CTRL (IMXRT_LPUART8.CTRL)
#define LPUART8_DATA (IMXRT_LPUART8.DATA)
#define LPUART8_MATCH (IMXRT_LPUART8.MATCH)
#define LPUART8_MODIR (IMXRT_LPUART8.MODIR)
#define LPUART8_FIFO (IMXRT_LPUART8.FIFO)
#define LPUART8_WATER (IMXRT_LPUART8.WATER)
#define LPUART_VERID_MAJOR(n) ((uint32_t)(((n)&0xFF) << 24))
#define LPUART_VERID_MINOR(n) ((uint32_t)(((n)&0xFF) << 16))
#define LPUART_VERID_FEATURE(n) ((uint32_t)(((n)&0xFFFF) << 0))
#define LPUART_PARAM_RXFIFO(n) ((uint32_t)(((n)&0xFF) << 8))
#define LPUART_PARAM_TXFIFO(n) ((uint32_t)(((n)&0xFF) << 0))
#define LPUART_GLOBAL_RST ((uint32_t)(1 << 1))
#define LPUART_PINCFG_TRGSEL(n) ((uint32_t)(((n)&0x03) << 0))
#define LPUART_BAUD_MAEN1 ((uint32_t)(1 << 31))
#define LPUART_BAUD_MAEN2 ((uint32_t)(1 << 30))
#define LPUART_BAUD_M10 ((uint32_t)(1 << 29))
#define LPUART_BAUD_OSR(n) ((uint32_t)(((n)&0x1F) << 24))
#define LPUART_BAUD_TDMAE ((uint32_t)(1 << 23))
#define LPUART_BAUD_RDMAE ((uint32_t)(1 << 21))
#define LPUART_BAUD_MATCFG(n) ((uint32_t)(((n)&0x03) << 18))
#define LPUART_BAUD_BOTHEDGE ((uint32_t)(1 << 17))
#define LPUART_BAUD_RESYNCDIS ((uint32_t)(1 << 16))
#define LPUART_BAUD_LBKDIE ((uint32_t)(1 << 15))
#define LPUART_BAUD_RXEDGIE ((uint32_t)(1 << 14))
#define LPUART_BAUD_SBNS ((uint32_t)(1 << 13))
#define LPUART_BAUD_SBR(n) ((uint32_t)(((n)&0x01FFF) << 0))
#define LPUART_STAT_LBKDIF ((uint32_t)(1 << 31))
#define LPUART_STAT_RXEDGIF ((uint32_t)(1 << 30))
#define LPUART_STAT_MSBF ((uint32_t)(1 << 29))
#define LPUART_STAT_RXINV ((uint32_t)(1 << 28))
#define LPUART_STAT_RWUID ((uint32_t)(1 << 27))
#define LPUART_STAT_BRK13 ((uint32_t)(1 << 26))
#define LPUART_STAT_LBKDE ((uint32_t)(1 << 25))
#define LPUART_STAT_RAF ((uint32_t)(1 << 24))
#define LPUART_STAT_TDRE ((uint32_t)(1 << 23))
#define LPUART_STAT_TC ((uint32_t)(1 << 22))
#define LPUART_STAT_RDRF ((uint32_t)(1 << 21))
#define LPUART_STAT_IDLE ((uint32_t)(1 << 20))
#define LPUART_STAT_OR ((uint32_t)(1 << 19))
#define LPUART_STAT_NF ((uint32_t)(1 << 18))
#define LPUART_STAT_FE ((uint32_t)(1 << 17))
#define LPUART_STAT_PF ((uint32_t)(1 << 16))
#define LPUART_STAT_MA1F ((uint32_t)(1 << 15))
#define LPUART_STAT_MA2F ((uint32_t)(1 << 14))
#define LPUART_CTRL_R8T9 ((uint32_t)(1 << 31))
#define LPUART_CTRL_R9T8 ((uint32_t)(1 << 30))
#define LPUART_CTRL_TXDIR ((uint32_t)(1 << 29))
#define LPUART_CTRL_TXINV ((uint32_t)(1 << 28))
#define LPUART_CTRL_ORIE ((uint32_t)(1 << 27))
#define LPUART_CTRL_NEIE ((uint32_t)(1 << 26))
#define LPUART_CTRL_FEIE ((uint32_t)(1 << 25))
#define LPUART_CTRL_PEIE ((uint32_t)(1 << 24))
#define LPUART_CTRL_TIE ((uint32_t)(1 << 23))
#define LPUART_CTRL_TCIE ((uint32_t)(1 << 22))
#define LPUART_CTRL_RIE ((uint32_t)(1 << 21))
#define LPUART_CTRL_ILIE ((uint32_t)(1 << 20))
#define LPUART_CTRL_TE ((uint32_t)(1 << 19))
#define LPUART_CTRL_RE ((uint32_t)(1 << 18))
#define LPUART_CTRL_RWU ((uint32_t)(1 << 17))
#define LPUART_CTRL_SBK ((uint32_t)(1 << 16))
#define LPUART_CTRL_MA1IE ((uint32_t)(1 << 15))
#define LPUART_CTRL_MA2IE ((uint32_t)(1 << 14))
#define LPUART_CTRL_M7 ((uint32_t)(1 << 11))
#define LPUART_CTRL_IDLECFG(n) ((uint32_t)(((n)&0x07) << 8))
#define LPUART_CTRL_LOOPS ((uint32_t)(1 << 7))
#define LPUART_CTRL_DOZEEN ((uint32_t)(1 << 6))
#define LPUART_CTRL_RSRC ((uint32_t)(1 << 5))
#define LPUART_CTRL_M ((uint32_t)(1 << 4))
#define LPUART_CTRL_WAKE ((uint32_t)(1 << 3))
#define LPUART_CTRL_ILT ((uint32_t)(1 << 2))
#define LPUART_CTRL_PE ((uint32_t)(1 << 1))
#define LPUART_CTRL_PT ((uint32_t)(1 << 0))
#define LPUART_DATA_NOISY ((uint32_t)(1 << 15))
#define LPUART_DATA_PARITYE ((uint32_t)(1 << 14))
#define LPUART_DATA_FRETSC ((uint32_t)(1 << 13))
#define LPUART_DATA_RXEMPT ((uint32_t)(1 << 12))
#define LPUART_DATA_IDLINE ((uint32_t)(1 << 11))
#define LPUART_MATCH_MA2(n) ((uint32_t)(((n)&0x3FF) << 16))
#define LPUART_MATCH_MA1(n) ((uint32_t)(((n)&0x3FF) << 0))
#define LPUART_MODIR_IREN ((uint32_t)(1 << 18))
#define LPUART_MODIR_TNP(n) ((uint32_t)(((n)&0x03) << 16))
#define LPUART_MODIR_RTSWATER(n) ((uint32_t)(((n)&0x03) << 8))
#define LPUART_MODIR_TXCTSSRC ((uint32_t)(1 << 5))
#define LPUART_MODIR_TXCTSC ((uint32_t)(1 << 4))
#define LPUART_MODIR_RXRTSE ((uint32_t)(1 << 3))
#define LPUART_MODIR_TXRTSPOL ((uint32_t)(1 << 2))
#define LPUART_MODIR_TXRTSE ((uint32_t)(1 << 1))
#define LPUART_MODIR_TXCTSE ((uint32_t)(1 << 0))
#define LPUART_FIFO_TXEMPT ((uint32_t)(1 << 23))
#define LPUART_FIFO_RXEMPT ((uint32_t)(1 << 22))
#define LPUART_FIFO_TXOF ((uint32_t)(1 << 17))
#define LPUART_FIFO_RXUF ((uint32_t)(1 << 16))
#define LPUART_FIFO_TXFLUSH ((uint32_t)(1 << 15))
#define LPUART_FIFO_RXFLUSH ((uint32_t)(1 << 14))
#define LPUART_FIFO_RXIDEN(n) ((uint32_t)(((n)&0x07) << 10))
#define LPUART_FIFO_TXOFE ((uint32_t)(1 << 9))
#define LPUART_FIFO_RXUFE ((uint32_t)(1 << 8))
#define LPUART_FIFO_TXFE ((uint32_t)(1 << 7))
#define LPUART_FIFO_TXFIFOSIZE(n) ((uint32_t)(((n)&0x07) << 4))
#define LPUART_FIFO_RXFE ((uint32_t)(1 << 3))
#define LPUART_FIFO_RXFIFOSIZE(n) ((uint32_t)(((n)&0x07) << 0))
#define LPUART_WATER_RXCOUNT(n) ((uint32_t)(((n)&0x07) << 24))
#define LPUART_WATER_RXWATER(n) ((uint32_t)(((n)&0x03) << 16))
#define LPUART_WATER_TXCOUNT(n) ((uint32_t)(((n)&0x07) << 8))
#define LPUART_WATER_TXWATER(n) ((uint32_t)(((n)&0x03) << 0))

// 40.4: page 2495

