gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
// 41.3: page 2498  TODO...

// 42.5.1.1: page 2509
#define IMXRT_OCOTP (*(IMXRT_REGISTER32_t *)0x401F4000)
#define HW_OCOTP_CTRL (IMXRT_OCOTP.offset000)
#define HW_OCOTP_CTRL_SET (IMXRT_OCOTP.offset004)
#define HW_OCOTP_CTRL_CLR (IMXRT_OCOTP.offset008)
#define HW_OCOTP_CTRL_TOG (IMXRT_OCOTP.offset00C)
#define HW_OCOTP_TIMING (IMXRT_OCOTP.offset010)
#define HW_OCOTP_DATA (IMXRT_OCOTP.offset020)
#define HW_OCOTP_READ_CTRL (IMXRT_OCOTP.offset030)
#define HW_OCOTP_READ_FUSE_DATA (IMXRT_OCOTP.offset040)
#define HW_OCOTP_SW_STICKY (IMXRT_OCOTP.offset050)
#define HW_OCOTP_SCS (IMXRT_OCOTP.offset060)
#define HW_OCOTP_SCS_SET (IMXRT_OCOTP.offset064)
#define HW_OCOTP_SCS_CLR (IMXRT_OCOTP.offset068)
#define HW_OCOTP_SCS_TOG (IMXRT_OCOTP.offset06C)
#define HW_OCOTP_VERSION (IMXRT_OCOTP.offset090)
#define HW_OCOTP_TIMING2 (IMXRT_OCOTP.offset100)
#define HW_OCOTP_CTRL_WR_UNLOCK(n) ((uint32_t)(((n)&0xFFFF) << 16))
#define HW_OCOTP_CTRL_RELOAD_SHADOWS ((uint32_t)(1 << 10))
#define HW_OCOTP_CTRL_ERROR ((uint32_t)(1 << 9))
#define HW_OCOTP_CTRL_BUSY ((uint32_t)(1 << 8))
#define HW_OCOTP_CTRL_ADDR(n) ((uint32_t)(((n)&0x3F) << 0))
#define HW_OCOTP_TIMING_WAIT(n) ((uint32_t)(((n)&0x3F) << 22))
#define HW_OCOTP_TIMING_STROBE_READ(n) ((uint32_t)(((n)&0x3F) << 16))
#define HW_OCOTP_TIMING_RELAX(n) ((uint32_t)(((n)&0x0F) << 12))
#define HW_OCOTP_TIMING_STROBE_PROG(n) ((uint32_t)(((n)&0xFFF) << 0))
#define HW_OCOTP_READ_CTRL_READ_FUSE ((uint32_t)(1 << 0))
#define HW_OCOTP_SW_STICKY_JTAG_BLOCK_RELEASE ((uint32_t)(1 << 4))
#define HW_OCOTP_SW_STICKY_BLOCK_ROM_PART ((uint32_t)(1 << 3))
#define HW_OCOTP_SW_STICKY_FIELD_RETURN_LOCK ((uint32_t)(1 << 2))
#define HW_OCOTP_SW_STICKY_SRK_REVOKE_LOCK ((uint32_t)(1 << 1))
#define HW_OCOTP_SW_STICKY_BLOCK_DTCP_KEY ((uint32_t)(1 << 0))
#define HW_OCOTP_SCS_LOCK ((uint32_t)(1 << 31))
#define HW_OCOTP_SCS_HAB_JDE ((uint32_t)(1 << 0))
#define HW_OCOTP_TIMING2_RELAX1(n) ((uint32_t)(((n)&0x7F) << 24))
#define HW_OCOTP_TIMING2_RELAX_READ(n) ((uint32_t)(((n)&0x3F) << 16))
#define HW_OCOTP_TIMING2_RELAX_PROG(n) ((uint32_t)(((n)&0xFFF) << 0))
#define IMXRT_OCOTP_VALUE (*(IMXRT_REGISTER32_t *)0x401F4400)
#define HW_OCOTP_LOCK (IMXRT_OCOTP_VALUE.offset000)
#define HW_OCOTP_CFG0 (IMXRT_OCOTP_VALUE.offset010)
#define HW_OCOTP_CFG1 (IMXRT_OCOTP_VALUE.offset020)
#define HW_OCOTP_CFG2 (IMXRT_OCOTP_VALUE.offset030)
#define HW_OCOTP_CFG3 (IMXRT_OCOTP_VALUE.offset040)
#define HW_OCOTP_CFG4 (IMXRT_OCOTP_VALUE.offset050)
#define HW_OCOTP_CFG5 (IMXRT_OCOTP_VALUE.offset060)
#define HW_OCOTP_CFG6 (IMXRT_OCOTP_VALUE.offset070)
#define HW_OCOTP_MEM0 (IMXRT_OCOTP_VALUE.offset080)
#define HW_OCOTP MEM1(IMXRT_OCOTP_VALUE.offset090)
#define HW_OCOTP_MEM2 (IMXRT_OCOTP_VALUE.offset0A0)
#define HW_OCOTP_MEM3 (IMXRT_OCOTP_VALUE.offset0B0)
#define HW_OCOTP_MEM4 (IMXRT_OCOTP_VALUE.offset0C0)
#define HW_OCOTP_ANA0 (IMXRT_OCOTP_VALUE.offset0D0)
#define HW_OCOTP_ANA1 (IMXRT_OCOTP_VALUE.offset0E0)
#define HW_OCOTP_ANA2 (IMXRT_OCOTP_VALUE.offset0F0)
#define HW_OCOTP_OTPMK0 (IMXRT_OCOTP_VALUE.offset100)
#define HW_OCOTP_OTPMK1 (IMXRT_OCOTP_VALUE.offset110)
#define HW_OCOTP_OTPMK2 (IMXRT_OCOTP_VALUE.offset120)
#define HW_OCOTP_OTPMK3 (IMXRT_OCOTP_VALUE.offset130)
#define HW_OCOTP_OTPMK4 (IMXRT_OCOTP_VALUE.offset140)
#define HW_OCOTP_OTPMK5 (IMXRT_OCOTP_VALUE.offset150)
#define HW_OCOTP_OTPMK6 (IMXRT_OCOTP_VALUE.offset160)
#define HW_OCOTP_OTPMK7 (IMXRT_OCOTP_VALUE.offset170)
#define HW_OCOTP_SRK0 (IMXRT_OCOTP_VALUE.offset180)
#define HW_OCOTP_SRK1 (IMXRT_OCOTP_VALUE.offset190)
#define HW_OCOTP_SRK2 (IMXRT_OCOTP_VALUE.offset1A0)
#define HW_OCOTP_SRK3 (IMXRT_OCOTP_VALUE.offset1B0)
#define HW_OCOTP_SRK4 (IMXRT_OCOTP_VALUE.offset1C0)
#define HW_OCOTP_SRK5 (IMXRT_OCOTP_VALUE.offset1D0)
#define HW_OCOTP_SRK6 (IMXRT_OCOTP_VALUE.offset1E0)
#define HW_OCOTP_SRK7 (IMXRT_OCOTP_VALUE.offset1F0)
#define HW_OCOTP_SJC_RESP0 (IMXRT_OCOTP_VALUE.offset200)
#define HW_OCOTP_SJC_RESP1 (IMXRT_OCOTP_VALUE.offset210)
#define HW_OCOTP_MAC0 (IMXRT_OCOTP_VALUE.offset220)
#define HW_OCOTP_MAC1 (IMXRT_OCOTP_VALUE.offset230)
#define HW_OCOTP_MAC2 (IMXRT_OCOTP_VALUE.offset240)
#define HW_OCOTP_GP3 (IMXRT_OCOTP_VALUE.offset250)         /* IMXRT1052 */
#define HW_OCOTP_OTPMK_CRC32 (IMXRT_OCOTP_VALUE.offset250) /* IMXRT1062 */
#define HW_OCOTP_GP1 (IMXRT_OCOTP_VALUE.offset260)
#define HW_OCOTP_GP2 (IMXRT_OCOTP_VALUE.offset270)
#define HW_OCOTP_SW_GP1 (IMXRT_OCOTP_VALUE.offset280)
#define HW_OCOTP_SW_GP20 (IMXRT_OCOTP_VALUE.offset290)
#define HW_OCOTP_SW_GP21 (IMXRT_OCOTP_VALUE.offset2A0)
#define HW_OCOTP_SW_GP22 (IMXRT_OCOTP_VALUE.offset2B0)
#define HW_OCOTP_SW_GP23 (IMXRT_OCOTP_VALUE.offset2C0)
#define HW_OCOTP_MISC_CONF0 (IMXRT_OCOTP_VALUE.offset2D0)
#define HW_OCOTP_MISC_CONF1 (IMXRT_OCOTP_VALUE.offset2E0)
#define HW_OCOTP_SRK_REVOKE (IMXRT_OCOTP_VALUE.offset2F0)
#define IMXRT_OCOTP_VALUE2 (*(IMXRT_REGISTER32_t *)0x401F4800)
#define HW_OCOTP_ROM_PATCH0 (IMXRT_OCOTP_VALUE2.offset000)
#define HW_OCOTP_ROM_PATCH1 (IMXRT_OCOTP_VALUE2.offset010)
#define HW_OCOTP_ROM_PATCH2 (IMXRT_OCOTP_VALUE2.offset020)
#define HW_OCOTP_ROM_PATCH3 (IMXRT_OCOTP_VALUE2.offset030)
#define HW_OCOTP_ROM_PATCH4 (IMXRT_OCOTP_VALUE2.offset040)
#define HW_OCOTP_ROM_PATCH5 (IMXRT_OCOTP_VALUE2.offset050)
#define HW_OCOTP_ROM_PATCH6 (IMXRT_OCOTP_VALUE2.offset060)
#define HW_OCOTP_ROM_PATCH7 (IMXRT_OCOTP_VALUE2.offset070)
#define HW_OCOTP_GP30 (IMXRT_OCOTP_VALUE2.offset080)
#define HW_OCOTP_GP31 (IMXRT_OCOTP_VALUE2.offset090)
#define HW_OCOTP_GP32 (IMXRT_OCOTP_VALUE2.offset0A0)
#define HW_OCOTP_GP33 (IMXRT_OCOTP_VALUE2.offset0B0)
#define HW_OCOTP_GP40 (IMXRT_OCOTP_VALUE2.offset0C0)
#define HW_OCOTP_GP41 (IMXRT_OCOTP_VALUE2.offset0D0)
#define HW_OCOTP_GP42 (IMXRT_OCOTP_VALUE2.offset0E0)
#define HW_OCOTP_GP43 (IMXRT_OCOTP_VALUE2.offset0F0)

// 44.8.1: page 2583
#define IMXRT_PIT (*(IMXRT_REGISTER32_t *)0x40084000)
#define PIT_MCR (IMXRT_PIT.offset000)
#define PIT_LTMR64H (IMXRT_PIT.offset0E0)
#define PIT_LTMR64L (IMXRT_PIT.offset0E4)
typedef struct
{
    volatile uint32_t LDVAL;
    volatile uint32_t CVAL;
    volatile uint32_t TCTRL;
    volatile uint32_t TFLG;
} IMXRT_PIT_CHANNEL_t;
#define IMXRT_PIT_CHANNELS ((IMXRT_PIT_CHANNEL_t *)(&(IMXRT_PIT.offset100)))
#define PIT_LDVAL0 (IMXRT_PIT.offset100)
#define PIT_CVAL0 (IMXRT_PIT.offset104)
#define PIT_TCTRL0 (IMXRT_PIT.offset108)
#define PIT_TFLG0 (IMXRT_PIT.offset10C)
#define PIT_LDVAL1 (IMXRT_PIT.offset110)
#define PIT_CVAL1 (IMXRT_PIT.offset114)
#define PIT_TCTRL1 (IMXRT_PIT.offset118)
#define PIT_TFLG1 (IMXRT_PIT.offset11C)
#define PIT_LDVAL2 (IMXRT_PIT.offset120)
#define PIT_CVAL2 (IMXRT_PIT.offset124)
#define PIT_TCTRL2 (IMXRT_PIT.offset128)
#define PIT_TFLG2 (IMXRT_PIT.offset12C)
#define PIT_LDVAL3 (IMXRT_PIT.offset130)
#define PIT_CVAL3 (IMXRT_PIT.offset134)
#define PIT_TCTRL3 (IMXRT_PIT.offset138)
#define PIT_TFLG3 (IMXRT_PIT.offset13C)
#define PIT_MCR_MDIS ((uint32_t)(1 << 1))
#define PIT_MCR_FRZ ((uint32_t)(1 << 0))
#define PIT_TCTRL_CHN ((uint32_t)(1 << 2))
#define PIT_TCTRL_TIE ((uint32_t)(1 << 1))
#define PIT_TCTRL_TEN ((uint32_t)(1 << 0))
#define PIT_TFLG_TIF ((uint32_t)(1 << 0))

// 45.7: page 2598
#define IMXRT_PMU (*(IMXRT_REGISTER32_t *)0x400D8000)
#define PMU_REG_1P1 (IMXRT_PMU.offset110)
#define PMU_REG_1P1_SET (IMXRT_PMU.offset114)
#define PMU_REG_1P1_CLR (IMXRT_PMU.offset118)
#define PMU_REG_1P1_TOG (IMXRT_PMU.offset11C)
#define PMU_REG_3P0 (IMXRT_PMU.offset120)
#define PMU_REG_3P0_SET (IMXRT_PMU.offset124)
#define PMU_REG_3P0_CLR (IMXRT_PMU.offset128)
#define PMU_REG_3P0_TOG (IMXRT_PMU.offset12C)
#define PMU_REG_2P5 (IMXRT_PMU.offset130)
#define PMU_REG_2P5_SET (IMXRT_PMU.offset134)
#define PMU_REG_2P5_CLR (IMXRT_PMU.offset138)
#define PMU_REG_2P5_TOG (IMXRT_PMU.offset13C)
#define PMU_REG_CORE (IMXRT_PMU.offset140)
#define PMU_REG_CORE_SET (IMXRT_PMU.offset144)
#define PMU_REG_CORE_CLR (IMXRT_PMU.offset148)
#define PMU_REG_CORE_TOG (IMXRT_PMU.offset14C)
#define PMU_MISC0 (IMXRT_PMU.offset150)
#define PMU_MISC0_SET (IMXRT_PMU.offset154)
#define PMU_MISC0_CLR (IMXRT_PMU.offset158)
#define PMU_MISC0_TOG (IMXRT_PMU.offset15C)
#define PMU_MISC1 (IMXRT_PMU.offset160)
#define PMU_MISC1_SET (IMXRT_PMU.offset164)
#define PMU_MISC1_CLR (IMXRT_PMU.offset168)
#define PMU_MISC1_TOG (IMXRT_PMU.offset16C)
#define PMU_MISC2 (IMXRT_PMU.offset170)
#define PMU_MISC2_SET (IMXRT_PMU.offset174)
#define PMU_MISC2_CLR (IMXRT_PMU.offset178)
#define PMU_MISC2_TOG (IMXRT_PMU.offset17C)
#define PMU_REG_1P1_SELREF_WEAK_LINREG ((uint32_t)(1 << 19))
#define PMU_REG_1P1_ENABLE_WEAK_LINREG ((uint32_t)(1 << 18))
#define PMU_REG_1P1_OK_VDD1P1 ((uint32_t)(1 << 17))
#define PMU_REG_1P1_BO_VDD1P1 ((uint32_t)(1 << 16))
#define PMU_REG_1P1_OUTPUT_TRG(n) ((uint32_t)(((n)&0x0F) << 8))
#define PMU_REG_1P1_BO_OFFSET(n) ((uint32_t)(((n)&0x07) << 4))
#define PMU_REG_1P1_ENABLE_PULLDOWN ((uint32_t)(1 << 3))
#define PMU_REG_1P1_ENABLE_ILIMIT ((uint32_t)(1 << 2))
#define PMU_REG_1P1_ENABLE_BO ((uint32_t)(1 << 1))
#define PMU_REG_1P1_ENABLE_LINREG ((uint32_t)(1 << 0))
#define PMU_REG_3P0_OK_VDD3P0 ((uint32_t)(1 << 17))
#define PMU_REG_3P0_BO_VDD3P0 ((uint32_t)(1 << 16))
#define PMU_REG_3P0_OUTPUT_TRG(n) ((uint32_t)(((n)&0x1F) << 8))
#define PMU_REG_3P0_VBUS_SEL ((uint32_t)(1 << 7))
#define PMU_REG_3P0_BO_OFFSET(n) ((uint32_t)(((n)&0x07) << 4))
#define PMU_REG_3P0_ENABLE_ILIMIT ((uint32_t)(1 << 2))
#define PMU_REG_3P0_ENABLE_BO ((uint32_t)(1 << 1))
#define PMU_REG_3P0_ENABLE_LINREG ((uint32_t)(1 << 0))
#define PMU_REG_2P5_ENABLE_WEAK_LINREG ((uint32_t)(1 << 18))
#define PMU_REG_2P5_OK_VDD2P5 ((uint32_t)(1 << 17))
#define PMU_REG_2P5_BO_VDD2P5 ((uint32_t)(1 << 16))
#define PMU_REG_2P5_OUTPUT_TRG(n) ((uint32_t)(((n)&0x0F) << 8))
#define PMU_REG_2P5_BO_OFFSET(n) ((uint32_t)(((n)&0x07) << 4))
#define PMU_REG_2P5_ENABLE_PULLDOWN ((uint32_t)(1 << 3))
#define PMU_REG_2P5_ENABLE_ILIMIT ((uint32_t)(1 << 2))
#define PMU_REG_2P5_ENABLE_BO ((uint32_t)(1 << 1))
#define PMU_REG_2P5_ENABLE_LINREG ((uint32_t)(1 << 0))
#define PMU_REG_CORE_FET_ODRIVE ((uint32_t)(1 << 29))
#define PMU_REG_CORE_RAMP_RATE(n) ((uint32_t)(((n)&0x03) << 27))
#define PMU_REG_CORE_REG2_ADJ(n) ((uint32_t)(((n)&0x0F) << 23))
#define PMU_REG_CORE_REG2_TARG(n) ((uint32_t)(((n)&0x1F) << 18))
#define PMU_REG_CORE_REG1_ADJ(n) ((uint32_t)(((n)&0x0F) << 14))
#define PMU_REG_CORE_REG1_TARG(n) ((uint32_t)(((n)&0x1F) << 9))
#define PMU_REG_CORE_REG0_ADJ(n) ((uint32_t)(((n)&0x0F) << 5))
#define PMU_REG_CORE_REG0_TARG(n) ((uint32_t)(((n)&0x1F) << 0))
#define PMU_MISC0_VID_PLL_PREDIV ((uint32_t)(1 << 31))
#define PMU_MISC0_XTAL_24M_PWD ((uint32_t)(1 << 30))
#define PMU_MISC0_RTC_XTAL_SOURCE ((uint32_t)(1 << 29))
#define PMU_MISC0_CLKGATE_DELAY(n) ((uint32_t)(((n)&0x07) << 26))
#define PMU_MISC0_CLKGATE_CTRL ((uint32_t)(1 << 25))
#define PMU_MISC0_OSC_XTALOK_EN ((uint32_t)(1 << 16))
#define PMU_MISC0_OSC_XTALOK ((uint32_t)(1 << 15))
#define PMU_MISC0_OSC_I(n) ((uint32_t)(((n)&0x03) << 13))
#define PMU_MISC0_DISCON_HIGH_SNVS ((uint32_t)(1 << 12))
#define PMU_MISC0_STOP_MODE_CONFIG(n) ((uint32_t)(((n)&0x03) << 10))
#define PMU_MISC0_REFTOP_VBGUP ((uint32_t)(1 << 7))
#define PMU_MISC0_REFTOP_VBGADJ(n) ((uint32_t)(((n)&0x07) << 4))
#define PMU_MISC0_REFTOP_SELFBIASOFF ((uint32_t)(1 << 3))
#define PMU_MISC0_REFTOP_PWD ((uint32_t)(1 << 0))
#define PMU_MISC1_IRQ_DIG_BO ((uint32_t)(1 << 31))
#define PMU_MISC1_IRQ_ANA_BO ((uint32_t)(1 << 30))
#define PMU_MISC1_IRQ_TEMPHIGH ((uint32_t)(1 << 29))
#define PMU_MISC1_IRQ_TEMPLOW ((uint32_t)(1 << 28))
#define PMU_MISC1_IRQ_TEMPPANIC ((uint32_t)(1 << 27))
#define PMU_MISC1_PFD_528_AUTOGATE_EN ((uint32_t)(1 << 17))
#define PMU_MISC1_PFD_480_AUTOGATE_EN ((uint32_t)(1 << 16))
#define PMU_MISC1_LVDSCLK2_IBEN ((uint32_t)(1 << 13))
#define PMU_MISC1_LVDSCLK1_IBEN ((uint32_t)(1 << 12))
#define PMU_MISC1_LVDSCLK2_OBEN ((uint32_t)(1 << 11))
#define PMU_MISC1_LVDSCLK1_OBEN ((uint32_t)(1 << 10))
#define PMU_MISC1_LVDS2_CLK_SEL(n) ((uint32_t)(((n)&0x1F) << 5))
#define PMU_MISC1_LVDS1_CLK_SEL(n) ((uint32_t)(((n)&0x1F) << 0))
#define PMU_MISC2_VIDEO_DIV(n) ((uint32_t)(((n)&0x03) << 30))
#define PMU_MISC2_REG2_STEP_TIME(n) ((uint32_t)(((n)&0x03) << 28))
#define PMU_MISC2_REG1_STEP_TIME(n) ((uint32_t)(((n)&0x03) << 26))
#define PMU_MISC2_REG0_STEP_TIME(n) ((uint32_t)(((n)&0x03) << 24))
#define PMU_MISC2_AUDIO_DIV_MSB ((uint32_t)(1 << 23))
#define PMU_MISC2_REG2_OK ((uint32_t)(1 << 22))
#define PMU_MISC2_REG2_ENABLE_BO ((uint32_t)(1 << 21))
#define PMU_MISC2_REG2_BO_STATUS ((uint32_t)(1 << 19))
#define PMU_MISC2_REG2_BO_OFFSET(n) ((uint32_t)(((n)&0x07) << 16))
#define PMU_MISC2_AUDIO_DIV_LSB ((uint32_t)(1 << 15))
#define PMU_MISC2_REG1_ENABLE_BO ((uint32_t)(1 << 13))
#define PMU_MISC2_REG1_BO_STATUS ((uint32_t)(1 << 11))
#define PMU_MISC2_REG1_BO_OFFSET(n) ((uint32_t)(((n)&0x07) << 8))
#define PMU_MISC2_PLL3_DISABLE ((uint32_t)(1 << 7))
#define PMU_MISC2_REG0_ENABLE_BO ((uint32_t)(1 << 5))
#define PMU_MISC2_REG0_BO_STATUS ((uint32_t)(1 << 3))
#define PMU_MISC2_REG0_BO_OFFSET(n) ((uint32_t)(((n)&0x07) << 0))

