gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
// 46.7: page 2656
#define IMXRT_PXP (*(IMXRT_REGISTER32_t *)0x402B4000)
#define IMXRT_PXP_b (*(IMXRT_REGISTER32_t *)0x402B4400)
#define PXP_CTRL (IMXRT_PXP.offset000)
#define PXP_CTRL_SET (IMXRT_PXP.offset004)
#define PXP_CTRL_CLR (IMXRT_PXP.offset008)
#define PXP_CTRL_TOG (IMXRT_PXP.offset00C)
#define PXP_STAT (IMXRT_PXP.offset010)
#define PXP_STAT_SET (IMXRT_PXP.offset014)
#define PXP_STAT_CLR (IMXRT_PXP.offset018)
#define PXP_STAT_TOG (IMXRT_PXP.offset01C)
#define PXP_OUT_CTRL (IMXRT_PXP.offset020)
#define PXP_OUT_CTRL_SET (IMXRT_PXP.offset024)
#define PXP_OUT_CTRL_CLR (IMXRT_PXP.offset028)
#define PXP_OUT_CTRL_TOG (IMXRT_PXP.offset02C)
#define PXP_OUT_BUF (IMXRT_PXP.offset030)
#define PXP_OUT_BUF2 (IMXRT_PXP.offset040)
#define PXP_OUT_PITCH (IMXRT_PXP.offset050)
#define PXP_OUT_LRC (IMXRT_PXP.offset060)
#define PXP_OUT_PS_ULC (IMXRT_PXP.offset070)
#define PXP_OUT_PS_LRC (IMXRT_PXP.offset080)
#define PXP_OUT_AS_ULC (IMXRT_PXP.offset090)
#define PXP_OUT_AS_LRC (IMXRT_PXP.offset0A0)
#define PXP_PS_CTRL (IMXRT_PXP.offset0B0)
#define PXP_PS_CTRL_SET (IMXRT_PXP.offset0B4)
#define PXP_PS_CTRL_CLR (IMXRT_PXP.offset0B8)
#define PXP_PS_CTRL_TOG (IMXRT_PXP.offset0BC)
#define PXP_PS_BUF (IMXRT_PXP.offset0C0)
#define PXP_PS_UBUF (IMXRT_PXP.offset0D0)
#define PXP_PS_VBUF (IMXRT_PXP.offset0E0)
#define PXP_PS_PITCH (IMXRT_PXP.offset0F0)
#define PXP_PS_BACKGROUND_0 (IMXRT_PXP.offset100)
#define PXP_PS_SCALE (IMXRT_PXP.offset110)
#define PXP_PS_OFFSET (IMXRT_PXP.offset120)
#define PXP_PS_CLRKEYLOW_0 (IMXRT_PXP.offset130)
#define PXP_PS_CLRKEYHIGH_0 (IMXRT_PXP.offset140)
#define PXP_AS_CTRL (IMXRT_PXP.offset150)
#define PXP_AS_BUF (IMXRT_PXP.offset160)
#define PXP_AS_PITCH (IMXRT_PXP.offset170)
#define PXP_AS_CLRKEYLOW_0 (IMXRT_PXP.offset180)
#define PXP_AS_CLRKEYHIGH_0 (IMXRT_PXP.offset190)
#define PXP_CSC1_COEF0 (IMXRT_PXP.offset1A0)
#define PXP_CSC1_COEF1 (IMXRT_PXP.offset1B0)
#define PXP_CSC1_COEF2 (IMXRT_PXP.offset1C0)
#define PXP_POWER (IMXRT_PXP_b.offset000)
#define PXP_PORTER_DUFF_CTRL (IMXRT_PXP_b.offset040)

// 47.5: page 2695
typedef struct
{
    union {
        struct
        {
            volatile uint16_t COMP1;
            volatile uint16_t COMP2;
            volatile uint16_t CAPT;
            volatile uint16_t LOAD;
            volatile uint16_t HOLD;
            volatile uint16_t CNTR;
            volatile uint16_t CTRL;
            volatile uint16_t SCTRL;
            volatile uint16_t CMPLD1;
            volatile uint16_t CMPLD2;
            volatile uint16_t CSCTRL;
            volatile uint16_t FILT;
            volatile uint16_t DMA;
            volatile uint16_t unused1[3];
        } CH[4];
        struct
        {
            volatile uint16_t unused2[15];
            volatile uint16_t ENBL;
        };
    };
} IMXRT_TMR_t;
#define IMXRT_TMR1 (*(IMXRT_TMR_t *)0x401DC000)
#define TMR1_COMP10 (IMXRT_TMR1.CH[0].COMP1)
#define TMR1_COMP20 (IMXRT_TMR1.CH[0].COMP2)
#define TMR1_CAPT0 (IMXRT_TMR1.CH[0].CAPT)
#define TMR1_LOAD0 (IMXRT_TMR1.CH[0].LOAD)
#define TMR1_HOLD0 (IMXRT_TMR1.CH[0].HOLD)
#define TMR1_CNTR0 (IMXRT_TMR1.CH[0].CNTR)
#define TMR1_CTRL0 (IMXRT_TMR1.CH[0].CTRL)
#define TMR1_SCTRL0 (IMXRT_TMR1.CH[0].SCTRL)
#define TMR1_CMPLD10 (IMXRT_TMR1.CH[0].CMPLD1)
#define TMR1_CMPLD20 (IMXRT_TMR1.CH[0].CMPLD2)
#define TMR1_CSCTRL0 (IMXRT_TMR1.CH[0].CSCTRL)
#define TMR1_FILT0 (IMXRT_TMR1.CH[0].FILT)
#define TMR1_DMA0 (IMXRT_TMR1.CH[0].DMA)
#define TMR1_ENBL (IMXRT_TMR1.ENBL)
#define TMR1_COMP11 (IMXRT_TMR1.CH[1].COMP1)
#define TMR1_COMP21 (IMXRT_TMR1.CH[1].COMP2)
#define TMR1_CAPT1 (IMXRT_TMR1.CH[1].CAPT)
#define TMR1_LOAD1 (IMXRT_TMR1.CH[1].LOAD)
#define TMR1_HOLD1 (IMXRT_TMR1.CH[1].HOLD)
#define TMR1_CNTR1 (IMXRT_TMR1.CH[1].CNTR)
#define TMR1_CTRL1 (IMXRT_TMR1.CH[1].CTRL)
#define TMR1_SCTRL1 (IMXRT_TMR1.CH[1].SCTRL)
#define TMR1_CMPLD11 (IMXRT_TMR1.CH[1].CMPLD1)
#define TMR1_CMPLD21 (IMXRT_TMR1.CH[1].CMPLD2)
#define TMR1_CSCTRL1 (IMXRT_TMR1.CH[1].CSCTRL)
#define TMR1_FILT1 (IMXRT_TMR1.CH[1].FILT)
#define TMR1_DMA1 (IMXRT_TMR1.CH[1].DMA)
#define TMR1_COMP12 (IMXRT_TMR1.CH[2].COMP1)
#define TMR1_COMP22 (IMXRT_TMR1.CH[2].COMP2)
#define TMR1_CAPT2 (IMXRT_TMR1.CH[2].CAPT)
#define TMR1_LOAD2 (IMXRT_TMR1.CH[2].LOAD)
#define TMR1_HOLD2 (IMXRT_TMR1.CH[2].HOLD)
#define TMR1_CNTR2 (IMXRT_TMR1.CH[2].CNTR)
#define TMR1_CTRL2 (IMXRT_TMR1.CH[2].CTRL)
#define TMR1_SCTRL2 (IMXRT_TMR1.CH[2].SCTRL)
#define TMR1_CMPLD12 (IMXRT_TMR1.CH[2].CMPLD1)
#define TMR1_CMPLD22 (IMXRT_TMR1.CH[2].CMPLD2)
#define TMR1_CSCTRL2 (IMXRT_TMR1.CH[2].CSCTRL)
#define TMR1_FILT2 (IMXRT_TMR1.CH[2].FILT)
#define TMR1_DMA2 (IMXRT_TMR1.CH[2].DMA)
#define TMR1_COMP13 (IMXRT_TMR1.CH[3].COMP1)
#define TMR1_COMP23 (IMXRT_TMR1.CH[3].COMP2)
#define TMR1_CAPT3 (IMXRT_TMR1.CH[3].CAPT)
#define TMR1_LOAD3 (IMXRT_TMR1.CH[3].LOAD)
#define TMR1_HOLD3 (IMXRT_TMR1.CH[3].HOLD)
#define TMR1_CNTR3 (IMXRT_TMR1.CH[3].CNTR)
#define TMR1_CTRL3 (IMXRT_TMR1.CH[3].CTRL)
#define TMR1_SCTRL3 (IMXRT_TMR1.CH[3].SCTRL)
#define TMR1_CMPLD13 (IMXRT_TMR1.CH[3].CMPLD1)
#define TMR1_CMPLD23 (IMXRT_TMR1.CH[3].CMPLD2)
#define TMR1_CSCTRL3 (IMXRT_TMR1.CH[3].CSCTRL)
#define TMR1_FILT3 (IMXRT_TMR1.CH[3].FILT)
#define TMR1_DMA3 (IMXRT_TMR1.CH[3].DMA)
#define IMXRT_TMR2 (*(IMXRT_TMR_t *)0x401E0000)
#define TMR2_COMP10 (IMXRT_TMR2.CH[0].COMP1)
#define TMR2_COMP20 (IMXRT_TMR2.CH[0].COMP2)
#define TMR2_CAPT0 (IMXRT_TMR2.CH[0].CAPT)
#define TMR2_LOAD0 (IMXRT_TMR2.CH[0].LOAD)
#define TMR2_HOLD0 (IMXRT_TMR2.CH[0].HOLD)
#define TMR2_CNTR0 (IMXRT_TMR2.CH[0].CNTR)
#define TMR2_CTRL0 (IMXRT_TMR2.CH[0].CTRL)
#define TMR2_SCTRL0 (IMXRT_TMR2.CH[0].SCTRL)
#define TMR2_CMPLD10 (IMXRT_TMR2.CH[0].CMPLD1)
#define TMR2_CMPLD20 (IMXRT_TMR2.CH[0].CMPLD2)
#define TMR2_CSCTRL0 (IMXRT_TMR2.CH[0].CSCTRL)
#define TMR2_FILT0 (IMXRT_TMR2.CH[0].FILT)
#define TMR2_DMA0 (IMXRT_TMR2.CH[0].DMA)
#define TMR2_ENBL (IMXRT_TMR2.ENBL)
#define TMR2_COMP11 (IMXRT_TMR2.CH[1].COMP1)
#define TMR2_COMP21 (IMXRT_TMR2.CH[1].COMP2)
#define TMR2_CAPT1 (IMXRT_TMR2.CH[1].CAPT)
#define TMR2_LOAD1 (IMXRT_TMR2.CH[1].LOAD)
#define TMR2_HOLD1 (IMXRT_TMR2.CH[1].HOLD)
#define TMR2_CNTR1 (IMXRT_TMR2.CH[1].CNTR)
#define TMR2_CTRL1 (IMXRT_TMR2.CH[1].CTRL)
#define TMR2_SCTRL1 (IMXRT_TMR2.CH[1].SCTRL)
#define TMR2_CMPLD11 (IMXRT_TMR2.CH[1].CMPLD1)
#define TMR2_CMPLD21 (IMXRT_TMR2.CH[1].CMPLD2)
#define TMR2_CSCTRL1 (IMXRT_TMR2.CH[1].CSCTRL)
#define TMR2_FILT1 (IMXRT_TMR2.CH[1].FILT)
#define TMR2_DMA1 (IMXRT_TMR2.CH[1].DMA)
#define TMR2_COMP12 (IMXRT_TMR2.CH[2].COMP1)
#define TMR2_COMP22 (IMXRT_TMR2.CH[2].COMP2)
#define TMR2_CAPT2 (IMXRT_TMR2.CH[2].CAPT)
#define TMR2_LOAD2 (IMXRT_TMR2.CH[2].LOAD)
#define TMR2_HOLD2 (IMXRT_TMR2.CH[2].HOLD)
#define TMR2_CNTR2 (IMXRT_TMR2.CH[2].CNTR)
#define TMR2_CTRL2 (IMXRT_TMR2.CH[2].CTRL)
#define TMR2_SCTRL2 (IMXRT_TMR2.CH[2].SCTRL)
#define TMR2_CMPLD12 (IMXRT_TMR2.CH[2].CMPLD1)
#define TMR2_CMPLD22 (IMXRT_TMR2.CH[2].CMPLD2)
#define TMR2_CSCTRL2 (IMXRT_TMR2.CH[2].CSCTRL)
#define TMR2_FILT2 (IMXRT_TMR2.CH[2].FILT)
#define TMR2_DMA2 (IMXRT_TMR2.CH[2].DMA)
#define TMR2_COMP13 (IMXRT_TMR2.CH[3].COMP1)
#define TMR2_COMP23 (IMXRT_TMR2.CH[3].COMP2)
#define TMR2_CAPT3 (IMXRT_TMR2.CH[3].CAPT)
#define TMR2_LOAD3 (IMXRT_TMR2.CH[3].LOAD)
#define TMR2_HOLD3 (IMXRT_TMR2.CH[3].HOLD)
#define TMR2_CNTR3 (IMXRT_TMR2.CH[3].CNTR)
#define TMR2_CTRL3 (IMXRT_TMR2.CH[3].CTRL)
#define TMR2_SCTRL3 (IMXRT_TMR2.CH[3].SCTRL)
#define TMR2_CMPLD13 (IMXRT_TMR2.CH[3].CMPLD1)
#define TMR2_CMPLD23 (IMXRT_TMR2.CH[3].CMPLD2)
#define TMR2_CSCTRL3 (IMXRT_TMR2.CH[3].CSCTRL)
#define TMR2_FILT3 (IMXRT_TMR2.CH[3].FILT)
#define TMR2_DMA3 (IMXRT_TMR2.CH[3].DMA)
#define IMXRT_TMR3 (*(IMXRT_TMR_t *)0x401E4000)
#define TMR3_COMP10 (IMXRT_TMR3.CH[0].COMP1)
#define TMR3_COMP20 (IMXRT_TMR3.CH[0].COMP2)
#define TMR3_CAPT0 (IMXRT_TMR3.CH[0].CAPT)
#define TMR3_LOAD0 (IMXRT_TMR3.CH[0].LOAD)
#define TMR3_HOLD0 (IMXRT_TMR3.CH[0].HOLD)
#define TMR3_CNTR0 (IMXRT_TMR3.CH[0].CNTR)
#define TMR3_CTRL0 (IMXRT_TMR3.CH[0].CTRL)
#define TMR3_SCTRL0 (IMXRT_TMR3.CH[0].SCTRL)
#define TMR3_CMPLD10 (IMXRT_TMR3.CH[0].CMPLD1)
#define TMR3_CMPLD20 (IMXRT_TMR3.CH[0].CMPLD2)
#define TMR3_CSCTRL0 (IMXRT_TMR3.CH[0].CSCTRL)
#define TMR3_FILT0 (IMXRT_TMR3.CH[0].FILT)
#define TMR3_DMA0 (IMXRT_TMR3.CH[0].DMA)
#define TMR3_ENBL (IMXRT_TMR3.ENBL)
#define TMR3_COMP11 (IMXRT_TMR3.CH[1].COMP1)
#define TMR3_COMP21 (IMXRT_TMR3.CH[1].COMP2)
#define TMR3_CAPT1 (IMXRT_TMR3.CH[1].CAPT)
#define TMR3_LOAD1 (IMXRT_TMR3.CH[1].LOAD)
#define TMR3_HOLD1 (IMXRT_TMR3.CH[1].HOLD)
#define TMR3_CNTR1 (IMXRT_TMR3.CH[1].CNTR)
#define TMR3_CTRL1 (IMXRT_TMR3.CH[1].CTRL)
#define TMR3_SCTRL1 (IMXRT_TMR3.CH[1].SCTRL)
#define TMR3_CMPLD11 (IMXRT_TMR3.CH[1].CMPLD1)
#define TMR3_CMPLD21 (IMXRT_TMR3.CH[1].CMPLD2)
#define TMR3_CSCTRL1 (IMXRT_TMR3.CH[1].CSCTRL)
#define TMR3_FILT1 (IMXRT_TMR3.CH[1].FILT)
#define TMR3_DMA1 (IMXRT_TMR3.CH[1].DMA)
#define TMR3_COMP12 (IMXRT_TMR3.CH[2].COMP1)
#define TMR3_COMP22 (IMXRT_TMR3.CH[2].COMP2)
#define TMR3_CAPT2 (IMXRT_TMR3.CH[2].CAPT)
#define TMR3_LOAD2 (IMXRT_TMR3.CH[2].LOAD)
#define TMR3_HOLD2 (IMXRT_TMR3.CH[2].HOLD)
#define TMR3_CNTR2 (IMXRT_TMR3.CH[2].CNTR)
#define TMR3_CTRL2 (IMXRT_TMR3.CH[2].CTRL)
#define TMR3_SCTRL2 (IMXRT_TMR3.CH[2].SCTRL)
#define TMR3_CMPLD12 (IMXRT_TMR3.CH[2].CMPLD1)
#define TMR3_CMPLD22 (IMXRT_TMR3.CH[2].CMPLD2)
#define TMR3_CSCTRL2 (IMXRT_TMR3.CH[2].CSCTRL)
#define TMR3_FILT2 (IMXRT_TMR3.CH[2].FILT)
#define TMR3_DMA2 (IMXRT_TMR3.CH[2].DMA)
#define TMR3_COMP13 (IMXRT_TMR3.CH[3].COMP1)
#define TMR3_COMP23 (IMXRT_TMR3.CH[3].COMP2)
#define TMR3_CAPT3 (IMXRT_TMR3.CH[3].CAPT)
#define TMR3_LOAD3 (IMXRT_TMR3.CH[3].LOAD)
#define TMR3_HOLD3 (IMXRT_TMR3.CH[3].HOLD)
#define TMR3_CNTR3 (IMXRT_TMR3.CH[3].CNTR)
#define TMR3_CTRL3 (IMXRT_TMR3.CH[3].CTRL)
#define TMR3_SCTRL3 (IMXRT_TMR3.CH[3].SCTRL)
#define TMR3_CMPLD13 (IMXRT_TMR3.CH[3].CMPLD1)
#define TMR3_CMPLD23 (IMXRT_TMR3.CH[3].CMPLD2)
#define TMR3_CSCTRL3 (IMXRT_TMR3.CH[3].CSCTRL)
#define TMR3_FILT3 (IMXRT_TMR3.CH[3].FILT)
#define TMR3_DMA3 (IMXRT_TMR3.CH[3].DMA)
#define IMXRT_TMR4 (*(IMXRT_TMR_t *)0x401E8000)
#define TMR4_COMP10 (IMXRT_TMR4.CH[0].COMP1)
#define TMR4_COMP20 (IMXRT_TMR4.CH[0].COMP2)
#define TMR4_CAPT0 (IMXRT_TMR4.CH[0].CAPT)
#define TMR4_LOAD0 (IMXRT_TMR4.CH[0].LOAD)
#define TMR4_HOLD0 (IMXRT_TMR4.CH[0].HOLD)
#define TMR4_CNTR0 (IMXRT_TMR4.CH[0].CNTR)
#define TMR4_CTRL0 (IMXRT_TMR4.CH[0].CTRL)
#define TMR4_SCTRL0 (IMXRT_TMR4.CH[0].SCTRL)
#define TMR4_CMPLD10 (IMXRT_TMR4.CH[0].CMPLD1)
#define TMR4_CMPLD20 (IMXRT_TMR4.CH[0].CMPLD2)
#define TMR4_CSCTRL0 (IMXRT_TMR4.CH[0].CSCTRL)
#define TMR4_FILT0 (IMXRT_TMR4.CH[0].FILT)
#define TMR4_DMA0 (IMXRT_TMR4.CH[0].DMA)
#define TMR4_ENBL (IMXRT_TMR4.ENBL)
#define TMR4_COMP11 (IMXRT_TMR4.CH[1].COMP1)
#define TMR4_COMP21 (IMXRT_TMR4.CH[1].COMP2)
#define TMR4_CAPT1 (IMXRT_TMR4.CH[1].CAPT)
#define TMR4_LOAD1 (IMXRT_TMR4.CH[1].LOAD)
#define TMR4_HOLD1 (IMXRT_TMR4.CH[1].HOLD)
#define TMR4_CNTR1 (IMXRT_TMR4.CH[1].CNTR)
#define TMR4_CTRL1 (IMXRT_TMR4.CH[1].CTRL)
#define TMR4_SCTRL1 (IMXRT_TMR4.CH[1].SCTRL)
#define TMR4_CMPLD11 (IMXRT_TMR4.CH[1].CMPLD1)
#define TMR4_CMPLD21 (IMXRT_TMR4.CH[1].CMPLD2)
#define TMR4_CSCTRL1 (IMXRT_TMR4.CH[1].CSCTRL)
#define TMR4_FILT1 (IMXRT_TMR4.CH[1].FILT)
#define TMR4_DMA1 (IMXRT_TMR4.CH[1].DMA)
#define TMR4_COMP12 (IMXRT_TMR4.CH[2].COMP1)
#define TMR4_COMP22 (IMXRT_TMR4.CH[2].COMP2)
#define TMR4_CAPT2 (IMXRT_TMR4.CH[2].CAPT)
#define TMR4_LOAD2 (IMXRT_TMR4.CH[2].LOAD)
#define TMR4_HOLD2 (IMXRT_TMR4.CH[2].HOLD)
#define TMR4_CNTR2 (IMXRT_TMR4.CH[2].CNTR)
#define TMR4_CTRL2 (IMXRT_TMR4.CH[2].CTRL)
#define TMR4_SCTRL2 (IMXRT_TMR4.CH[2].SCTRL)
#define TMR4_CMPLD12 (IMXRT_TMR4.CH[2].CMPLD1)
#define TMR4_CMPLD22 (IMXRT_TMR4.CH[2].CMPLD2)
#define TMR4_CSCTRL2 (IMXRT_TMR4.CH[2].CSCTRL)
#define TMR4_FILT2 (IMXRT_TMR4.CH[2].FILT)
#define TMR4_DMA2 (IMXRT_TMR4.CH[2].DMA)
#define TMR4_COMP13 (IMXRT_TMR4.CH[3].COMP1)
#define TMR4_COMP23 (IMXRT_TMR4.CH[3].COMP2)
#define TMR4_CAPT3 (IMXRT_TMR4.CH[3].CAPT)
#define TMR4_LOAD3 (IMXRT_TMR4.CH[3].LOAD)
#define TMR4_HOLD3 (IMXRT_TMR4.CH[3].HOLD)
#define TMR4_CNTR3 (IMXRT_TMR4.CH[3].CNTR)
#define TMR4_CTRL3 (IMXRT_TMR4.CH[3].CTRL)
#define TMR4_SCTRL3 (IMXRT_TMR4.CH[3].SCTRL)
#define TMR4_CMPLD13 (IMXRT_TMR4.CH[3].CMPLD1)
#define TMR4_CMPLD23 (IMXRT_TMR4.CH[3].CMPLD2)
#define TMR4_CSCTRL3 (IMXRT_TMR4.CH[3].CSCTRL)
#define TMR4_FILT3 (IMXRT_TMR4.CH[3].FILT)
#define TMR4_DMA3 (IMXRT_TMR4.CH[3].DMA)
#define TMR_CTRL_CM(n) ((uint16_t)(((n)&0x07) << 13))
#define TMR_CTRL_PCS(n) ((uint16_t)(((n)&0x0F) << 9))
#define TMR_CTRL_SCS(n) ((uint16_t)(((n)&0x03) << 7))
#define TMR_CTRL_ONCE ((uint16_t)(1 << 6))
#define TMR_CTRL_LENGTH ((uint16_t)(1 << 5))
#define TMR_CTRL_DIR ((uint16_t)(1 << 4))
#define TMR_CTRL_COINIT ((uint16_t)(1 << 3))
#define TMR_CTRL_OUTMODE(n) ((uint16_t)(((n)&0x07) << 0))
#define TMR_SCTRL_TCF ((uint16_t)(1 << 15))
#define TMR_SCTRL_TCFIE ((uint16_t)(1 << 14))
#define TMR_SCTRL_TOF ((uint16_t)(1 << 13))
#define TMR_SCTRL_TOFIE ((uint16_t)(1 << 12))
#define TMR_SCTRL_IEF ((uint16_t)(1 << 11))
#define TMR_SCTRL_IEFIE ((uint16_t)(1 << 10))
#define TMR_SCTRL_IPS ((uint16_t)(1 << 9))
#define TMR_SCTRL_INPUT ((uint16_t)(1 << 8))
#define TMR_SCTRL_CAPTURE_MODE(n) ((uint16_t)(((n)&0x03) << 6))
#define TMR_SCTRL_MSTR ((uint16_t)(1 << 5))
#define TMR_SCTRL_EEOF ((uint16_t)(1 << 4))
#define TMR_SCTRL_VAL ((uint16_t)(1 << 3))
#define TMR_SCTRL_FORCE ((uint16_t)(1 << 2))
#define TMR_SCTRL_OPS ((uint16_t)(1 << 1))
#define TMR_SCTRL_OEN ((uint16_t)(1 << 0))
#define TMR_CSCTRL_DBG_EN(n) ((uint16_t)(((n)&0x03) << 14))
#define TMR_CSCTRL_FAULT ((uint16_t)(1 << 13))
#define TMR_CSCTRL_ALT_LOAD ((uint16_t)(1 << 12))
#define TMR_CSCTRL_ROC ((uint16_t)(1 << 11))
#define TMR_CSCTRL_TCI ((uint16_t)(1 << 10))
#define TMR_CSCTRL_UP ((uint16_t)(1 << 9))
#define TMR_CSCTRL_TCF2EN ((uint16_t)(1 << 7))
#define TMR_CSCTRL_TCF1EN ((uint16_t)(1 << 6))
#define TMR_CSCTRL_TCF2 ((uint16_t)(1 << 5))
#define TMR_CSCTRL_TCF1 ((uint16_t)(1 << 4))
#define TMR_CSCTRL_CL2(n) ((uint16_t)(((n)&0x03) << 2))
#define TMR_CSCTRL_CL1(n) ((uint16_t)(((n)&0x03) << 0))
#define TMR_FILT_FILT_CNT(n) ((uint16_t)(((n)&0x07) << 8))
#define TMR_FILT_FILT_PER(n) ((uint16_t)(((n)&0xFF) << 0))
#define TMR_DMA_CMPLD2DE ((uint16_t)(1 << 2))
#define TMR_DMA_CMPLD1DE ((uint16_t)(1 << 1))
#define TMR_DMA_IEFDE ((uint16_t)(1 << 0))

// 48.4.1.1: page 2748
#define IMXRT_I2S1 (*(IMXRT_REGISTER32_t *)0x40384000)
#define I2S1_VERID (IMXRT_I2S1.offset000)
#define I2S1_PARAM (IMXRT_I2S1.offset004)
#define I2S1_TCSR (IMXRT_I2S1.offset008)
#define I2S1_TCR1 (IMXRT_I2S1.offset00C)
#define I2S1_TCR2 (IMXRT_I2S1.offset010)
#define I2S1_TCR3 (IMXRT_I2S1.offset014)
#define I2S1_TCR4 (IMXRT_I2S1.offset018)
#define I2S1_TCR5 (IMXRT_I2S1.offset01C)
#define I2S1_TDR0 (IMXRT_I2S1.offset020)
#define I2S1_TDR1 (IMXRT_I2S1.offset024)
#define I2S1_TDR2 (IMXRT_I2S1.offset028)
#define I2S1_TDR3 (IMXRT_I2S1.offset02C)
#define I2S1_TFR0 (IMXRT_I2S1.offset040)
#define I2S1_TFR1 (IMXRT_I2S1.offset044)
#define I2S1_TFR2 (IMXRT_I2S1.offset048)
#define I2S1_TFR3 (IMXRT_I2S1.offset04C)
#define I2S1_TMR (IMXRT_I2S1.offset060)
#define I2S1_RCSR (IMXRT_I2S1.offset088)
#define I2S1_RCR1 (IMXRT_I2S1.offset08C)
#define I2S1_RCR2 (IMXRT_I2S1.offset090)
#define I2S1_RCR3 (IMXRT_I2S1.offset094)
#define I2S1_RCR4 (IMXRT_I2S1.offset098)
#define I2S1_RCR5 (IMXRT_I2S1.offset09C)
#define I2S1_RDR0 (IMXRT_I2S1.offset0A0)
#define I2S1_RDR1 (IMXRT_I2S1.offset0A4)
#define I2S1_RDR2 (IMXRT_I2S1.offset0A8)
#define I2S1_RDR3 (IMXRT_I2S1.offset0AC)
#define I2S1_RFR0 (IMXRT_I2S1.offset0C0)
#define I2S1_RFR1 (IMXRT_I2S1.offset0C4)
#define I2S1_RFR2 (IMXRT_I2S1.offset0C8)
#define I2S1_RFR3 (IMXRT_I2S1.offset0CC)
#define I2S1_RMR (IMXRT_I2S1.offset0E0)
#define IMXRT_I2S2 (*(IMXRT_REGISTER32_t *)0x40388000)
#define I2S2_VERID (IMXRT_I2S2.offset000)
#define I2S2_PARAM (IMXRT_I2S2.offset004)
#define I2S2_TCSR (IMXRT_I2S2.offset008)
#define I2S2_TCR1 (IMXRT_I2S2.offset00C)
#define I2S2_TCR2 (IMXRT_I2S2.offset010)
#define I2S2_TCR3 (IMXRT_I2S2.offset014)
#define I2S2_TCR4 (IMXRT_I2S2.offset018)
#define I2S2_TCR5 (IMXRT_I2S2.offset01C)
#define I2S2_TDR0 (IMXRT_I2S2.offset020)
#define I2S2_TDR1 (IMXRT_I2S2.offset024)
#define I2S2_TDR2 (IMXRT_I2S2.offset028)
#define I2S2_TDR3 (IMXRT_I2S2.offset02C)
#define I2S2_TFR0 (IMXRT_I2S2.offset040)
#define I2S2_TFR1 (IMXRT_I2S2.offset044)
#define I2S2_TFR2 (IMXRT_I2S2.offset048)
#define I2S2_TFR3 (IMXRT_I2S2.offset04C)
#define I2S2_TMR (IMXRT_I2S2.offset060)
#define I2S2_RCSR (IMXRT_I2S2.offset088)
#define I2S2_RCR1 (IMXRT_I2S2.offset08C)
#define I2S2_RCR2 (IMXRT_I2S2.offset090)
#define I2S2_RCR3 (IMXRT_I2S2.offset094)
#define I2S2_RCR4 (IMXRT_I2S2.offset098)
#define I2S2_RCR5 (IMXRT_I2S2.offset09C)
#define I2S2_RDR0 (IMXRT_I2S2.offset0A0)
#define I2S2_RDR1 (IMXRT_I2S2.offset0A4)
#define I2S2_RDR2 (IMXRT_I2S2.offset0A8)
#define I2S2_RDR3 (IMXRT_I2S2.offset0AC)
#define I2S2_RFR0 (IMXRT_I2S2.offset0C0)
#define I2S2_RFR1 (IMXRT_I2S2.offset0C4)
#define I2S2_RFR2 (IMXRT_I2S2.offset0C8)
#define I2S2_RFR3 (IMXRT_I2S2.offset0CC)
#define I2S2_RMR (IMXRT_I2S2.offset0E0)
#define IMXRT_I2S3 (*(IMXRT_REGISTER32_t *)0x4038C000)
#define I2S3_VERID (IMXRT_I2S3.offset000)
#define I2S3_PARAM (IMXRT_I2S3.offset004)
#define I2S3_TCSR (IMXRT_I2S3.offset008)
#define I2S3_TCR1 (IMXRT_I2S3.offset00C)
#define I2S3_TCR2 (IMXRT_I2S3.offset010)
#define I2S3_TCR3 (IMXRT_I2S3.offset014)
#define I2S3_TCR4 (IMXRT_I2S3.offset018)
#define I2S3_TCR5 (IMXRT_I2S3.offset01C)
#define I2S3_TDR0 (IMXRT_I2S3.offset020)
#define I2S3_TDR1 (IMXRT_I2S3.offset024)
#define I2S3_TDR2 (IMXRT_I2S3.offset028)
#define I2S3_TDR3 (IMXRT_I2S3.offset02C)
#define I2S3_TFR0 (IMXRT_I2S3.offset040)
#define I2S3_TFR1 (IMXRT_I2S3.offset044)
#define I2S3_TFR2 (IMXRT_I2S3.offset048)
#define I2S3_TFR3 (IMXRT_I2S3.offset04C)
#define I2S3_TMR (IMXRT_I2S3.offset060)
#define I2S3_RCSR (IMXRT_I2S3.offset088)
#define I2S3_RCR1 (IMXRT_I2S3.offset08C)
#define I2S3_RCR2 (IMXRT_I2S3.offset090)
#define I2S3_RCR3 (IMXRT_I2S3.offset094)
#define I2S3_RCR4 (IMXRT_I2S3.offset098)
#define I2S3_RCR5 (IMXRT_I2S3.offset09C)
#define I2S3_RDR0 (IMXRT_I2S3.offset0A0)
#define I2S3_RDR1 (IMXRT_I2S3.offset0A4)
#define I2S3_RDR2 (IMXRT_I2S3.offset0A8)
#define I2S3_RDR3 (IMXRT_I2S3.offset0AC)
#define I2S3_RFR0 (IMXRT_I2S3.offset0C0)
#define I2S3_RFR1 (IMXRT_I2S3.offset0C4)
#define I2S3_RFR2 (IMXRT_I2S3.offset0C8)
#define I2S3_RFR3 (IMXRT_I2S3.offset0CC)
#define I2S3_RMR (IMXRT_I2S3.offset0E0)

#define I2S_RCR1_RFW(n) ((uint32_t)n & 0x1f)       // Receive FIFO watermark
#define I2S_RCR2_DIV(n) ((uint32_t)n & 0xff)       // Bit clock divide by (DIV+1)*2
#define I2S_RCR2_BCD ((uint32_t)1 << 24)           // Bit clock direction
#define I2S_RCR2_MSEL(n) ((uint32_t)(n & 3) << 26) // MCLK select, 0=bus clock, 1=I2S0_MCLK
#define I2S_RCR2_SYNC(n) ((uint32_t)(n & 3) << 30) // 0=async 1=sync with trasmitter
#define I2S_RCR3_RCE ((uint32_t)0x10000)           // receive channel enable
#define I2S_RCR4_FSD ((uint32_t)1)                 // Frame Sync Direction
#define I2S_RCR4_FSP ((uint32_t)1 << 1)
#define I2S_RCR4_FSE ((uint32_t)8)                    // Frame Sync Early
#define I2S_RCR4_MF ((uint32_t)0x10)                  // MSB First
#define I2S_RCR4_SYWD(n) ((uint32_t)(n & 0x1f) << 8)  // Sync Width
#define I2S_RCR4_FRSZ(n) ((uint32_t)(n & 0x0f) << 16) // Frame Size
#define I2S_RCR4_FCONT ((uint32_t)1 << 28)            // FIFO Continue on Error
#define I2S_RCR5_FBT(n) ((uint32_t)(n & 0x1f) << 8)   // First Bit Shifted
#define I2S_RCR5_W0W(n) ((uint32_t)(n & 0x1f) << 16)  // Word 0 Width
#define I2S_RCR5_WNW(n) ((uint32_t)(n & 0x1f) << 24)  // Word N Width
#define I2S_RCR2_BCP ((uint32_t)1 << 25)
#define I2S_RCSR_RE ((uint32_t)0x80000000)         // Receiver Enable
#define I2S_RCSR_FR ((uint32_t)0x02000000)         // FIFO Reset
#define I2S_RCSR_FRDE ((uint32_t)0x00000001)       // FIFO Request DMA Enable
#define I2S_RCSR_BCE ((uint32_t)0x10000000)        // Bit Clock Enable
#define I2S_TCR1_RFW(n) ((uint32_t)n & 0x1f)       // Receive FIFO watermark
#define I2S_TCR2_DIV(n) ((uint32_t)n & 0xff)       // Bit clock divide by (DIV+1)*2
#define I2S_TCR2_BCD ((uint32_t)1 << 24)           // Bit clock direction
#define I2S_TCR2_MSEL(n) ((uint32_t)(n & 3) << 26) // MCLK select, 0=bus clock, 1=I2S0_MCLK
#define I2S_TCR2_SYNC(n) ((uint32_t)(n & 3) << 30) // 0=async 1=sync with receiver
#define I2S_TCR3_TCE ((uint32_t)0x10000)           // receive channel enable
#define I2S_TCR4_FSD ((uint32_t)1)                 // Frame Sync Direction
#define I2S_TCR4_FSP ((uint32_t)1 << 1)
#define I2S_TCR4_FSE ((uint32_t)8)                    // Frame Sync Early
#define I2S_TCR4_MF ((uint32_t)0x10)                  // MSB First
#define I2S_TCR4_SYWD(n) ((uint32_t)(n & 0x1f) << 8)  // Sync Width
#define I2S_TCR4_FRSZ(n) ((uint32_t)(n & 0x0f) << 16) // Frame Size
#define I2S_TCR4_FCONT ((uint32_t)1 << 28)            // FIFO Continue on Error
#define I2S_TCR5_FBT(n) ((uint32_t)(n & 0x1f) << 8)   // First Bit Shifted
#define I2S_TCR5_W0W(n) ((uint32_t)(n & 0x1f) << 16)  // Word 0 Width
#define I2S_TCR5_WNW(n) ((uint32_t)(n & 0x1f) << 24)  // Word N Width
#define I2S_TCR2_BCP ((uint32_t)1 << 25)
#define I2S_TCSR_TE ((uint32_t)0x80000000)   // Receiver Enable
#define I2S_TCSR_BCE ((uint32_t)0x10000000)  // Bit Clock Enable
#define I2S_TCSR_FR ((uint32_t)0x02000000)   // FIFO Reset
#define I2S_TCSR_FRDE ((uint32_t)0x00000001) // FIFO Request DMA Enable

// 49.3.1.1: page 2784
#define IMXRT_SEMC (*(IMXRT_REGISTER32_t *)0x402F0000)
#define SEMC_MCR (IMXRT_SEMC.offset000)
#define SEMC_IOCR (IMXRT_SEMC.offset004)
#define SEMC_BMCR0 (IMXRT_SEMC.offset008)
#define SEMC_BMCR1 (IMXRT_SEMC.offset00C)
#define SEMC_BR0 (IMXRT_SEMC.offset010)
#define SEMC_BR1 (IMXRT_SEMC.offset014)
#define SEMC_BR2 (IMXRT_SEMC.offset018)
#define SEMC_BR3 (IMXRT_SEMC.offset01C)
#define SEMC_BR4 (IMXRT_SEMC.offset020)
#define SEMC_BR5 (IMXRT_SEMC.offset024)
#define SEMC_BR6 (IMXRT_SEMC.offset028)
#define SEMC_BR7 (IMXRT_SEMC.offset02C)
#define SEMC_BR8 (IMXRT_SEMC.offset030)
#define SEMC_INTEN (IMXRT_SEMC.offset038)
#define SEMC_INTR (IMXRT_SEMC.offset03C)
#define SEMC_SDRAMCR0 (IMXRT_SEMC.offset040)
#define SEMC_SDRAMCR1 (IMXRT_SEMC.offset044)
#define SEMC_SDRAMCR2 (IMXRT_SEMC.offset048)
#define SEMC_SDRAMCR3 (IMXRT_SEMC.offset04C)
#define SEMC_NANDCR0 (IMXRT_SEMC.offset050)
#define SEMC_NANDCR1 (IMXRT_SEMC.offset054)
#define SEMC_NANDCR2 (IMXRT_SEMC.offset058)
#define SEMC_NANDCR3 (IMXRT_SEMC.offset05C)
#define SEMC_ORCR0 (IMXRT_SEMC.offset060)
#define SEMC_ORCR1 (IMXRT_SEMC.offset064)
#define SEMC_ORCR2 (IMXRT_SEMC.offset068)
#define SEMC_ORCR3 (IMXRT_SEMC.offset06C)
#define SEMC_SRAMCR0 (IMXRT_SEMC.offset070)
#define SEMC_SRAMCR1 (IMXRT_SEMC.offset074)
#define SEMC_SRAMCR2 (IMXRT_SEMC.offset078)
#define SEMC_SRAMCR3 (IMXRT_SEMC.offset07C)
#define SEMC_DBICR0 (IMXRT_SEMC.offset080)
#define SEMC_DBICR1 (IMXRT_SEMC.offset084)
#define SEMC_IPCR0 (IMXRT_SEMC.offset090)
#define SEMC_IPCR1 (IMXRT_SEMC.offset094)
#define SEMC_IPCR2 (IMXRT_SEMC.offset098)
#define SEMC_IPCMD (IMXRT_SEMC.offset09C)
#define SEMC_IPTXDAT (IMXRT_SEMC.offset0A0)
#define SEMC_IPRXDAT (IMXRT_SEMC.offset0B0)
#define SEMC_STS0 (IMXRT_SEMC.offset0C0)
#define SEMC_STS1 (IMXRT_SEMC.offset0C4)
#define SEMC_STS2 (IMXRT_SEMC.offset0C8)
#define SEMC_STS3 (IMXRT_SEMC.offset0CC)
#define SEMC_STS4 (IMXRT_SEMC.offset0D0)
#define SEMC_STS5 (IMXRT_SEMC.offset0D4)
#define SEMC_STS6 (IMXRT_SEMC.offset0D8)
#define SEMC_STS7 (IMXRT_SEMC.offset0DC)
#define SEMC_STS8 (IMXRT_SEMC.offset0E0)
#define SEMC_STS9 (IMXRT_SEMC.offset0E4)
#define SEMC_STS10 (IMXRT_SEMC.offset0E8)
#define SEMC_STS11 (IMXRT_SEMC.offset0EC)
#define SEMC_STS12 (IMXRT_SEMC.offset0F0)
#define SEMC_STS13 (IMXRT_SEMC.offset0F4)
#define SEMC_STS14 (IMXRT_SEMC.offset0F8)
#define SEMC_STS15 (IMXRT_SEMC.offset0FC)

