gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
// 50.6.1: page 2895
#define IMXRT_SNVS (*(IMXRT_REGISTER32_t *)0x400D4000)
#define SNVS_HPLR (IMXRT_SNVS.offset000)
#define SNVS_HPCOMR (IMXRT_SNVS.offset004)
#define SNVS_HPCR (IMXRT_SNVS.offset008)
#define SNVS_HPSICR (IMXRT_SNVS.offset00C)
#define SNVS_HPSVCR (IMXRT_SNVS.offset010)
#define SNVS_HPSR (IMXRT_SNVS.offset014)
#define SNVS_HPSVSR (IMXRT_SNVS.offset018)
#define SNVS_HPHACIVR (IMXRT_SNVS.offset01C)
#define SNVS_HPHACR (IMXRT_SNVS.offset020)
#define SNVS_HPRTCMR (IMXRT_SNVS.offset024)
#define SNVS_HPRTCLR (IMXRT_SNVS.offset028)
#define SNVS_HPTAMR (IMXRT_SNVS.offset02C)
#define SNVS_HPTALR (IMXRT_SNVS.offset030)
#define SNVS_LPLR (IMXRT_SNVS.offset034)
#define SNVS_LPCR (IMXRT_SNVS.offset038)
#define SNVS_LPMKCR (IMXRT_SNVS.offset03C)
#define SNVS_LPSVCR (IMXRT_SNVS.offset040)
#define SNVS_LPTDCR (IMXRT_SNVS.offset048)
#define SNVS_LPSR (IMXRT_SNVS.offset04C)
#define SNVS_LPSRTCMR (IMXRT_SNVS.offset050)
#define SNVS_LPSRTCLR (IMXRT_SNVS.offset054)
#define SNVS_LPTAR (IMXRT_SNVS.offset058)
#define SNVS_LPSMCMR (IMXRT_SNVS.offset05C)
#define SNVS_LPSMCLR (IMXRT_SNVS.offset060)
#define SNVS_LPPGDR (IMXRT_SNVS.offset064)
#define SNVS_LPGPR (IMXRT_SNVS.offset068)
#define IMXRT_SNVS_b (*(IMXRT_REGISTER32_t *)0x400D4800)
#define SNVS_HPVIDR1 (IMXRT_SNVS_b.offset3F8)
#define SNVS_HPVIDR2 (IMXRT_SNVS_b.offset3FC)
#define SNVS_HPCR_BTN_MASK ((uint32_t)(1 << 27))
#define SNVS_HPCR_BTN_CONFIG(n) ((uint32_t)(((n)&0x07) << 24))
#define SNVS_HPCR_HP_TS ((uint32_t)(1 << 16))
#define SNVS_HPCR_HPCALB_VAL(n) ((uint32_t)(((n)&0x1F) << 10))
#define SNVS_HPCR_HPCALB_EN ((uint32_t)(1 << 8))
#define SNVS_HPCR_PI_FREQ(n) ((uint32_t)(((n)&0x0F) << 4))
#define SNVS_HPCR_PI_EN ((uint32_t)(1 << 3))
#define SNVS_HPCR_DIS_PI ((uint32_t)(1 << 2))
#define SNVS_HPCR_HPTA_EN ((uint32_t)(1 << 1))
#define SNVS_HPCR_RTC_EN ((uint32_t)(1 << 0))
#define SNVS_DEFAULT_PGD_VALUE (0x41736166U)
#define SNVS_LPCR_SRTC_ENV ((uint32_t)(1 << 0))
#define SNVS_LPCR_MC_ENV ((uint32_t)(1 << 2))
#define SNVS_LPCR_LPWUI_EN ((uint32_t)(1 << 3))
#define SNVS_LPCR_DP_EN ((uint32_t)(1 << 5))
#define SNVS_LPCR_TOP ((uint32_t)(1 << 6))
#define SNVS_LPCR_PWR_GLITCH_EN ((uint32_t)(1 << 7))
#define SNVS_LPCR_BTN_PRESS_TIME(n) ((uint32_t)(((n)&0x03) << 16))
#define SNVS_LPCR_DEBOUNCE(n) ((uint32_t)(((n)&0x03) << 18))
#define SNVS_LPCR_ON_TIME(n) ((uint32_t)(((n)&0x03) << 20))
#define SNVS_LPCR_PK_EN ((uint32_t)(1 << 22))
#define SNVS_LPCR_PK_OVERRIDE ((uint32_t)(1 << 23))

// 51.5: page 2938
#define IMXRT_SPDIF (*(IMXRT_REGISTER32_t *)0x40380000)
#define SPDIF_SCR (IMXRT_SPDIF.offset000)
#define SPDIF_SRCD (IMXRT_SPDIF.offset004)
#define SPDIF_SRPC (IMXRT_SPDIF.offset008)
#define SPDIF_SIE (IMXRT_SPDIF.offset00C)
#define SPDIF_SIS (IMXRT_SPDIF.offset010)
#define SPDIF_SIC (IMXRT_SPDIF.offset010)
#define SPDIF_SRL (IMXRT_SPDIF.offset014)
#define SPDIF_SRR (IMXRT_SPDIF.offset018)
#define SPDIF_SRCSH (IMXRT_SPDIF.offset01C)
#define SPDIF_SRCSL (IMXRT_SPDIF.offset020)
#define SPDIF_SRU (IMXRT_SPDIF.offset024)
#define SPDIF_SRQ (IMXRT_SPDIF.offset028)
#define SPDIF_STL (IMXRT_SPDIF.offset02C)
#define SPDIF_STR (IMXRT_SPDIF.offset030)
#define SPDIF_STCSCH (IMXRT_SPDIF.offset034)
#define SPDIF_STCSCL (IMXRT_SPDIF.offset038)
#define SPDIF_SRFM (IMXRT_SPDIF.offset044)
#define SPDIF_STC (IMXRT_SPDIF.offset050)
#define SPDIF_SCR_RXFIFO_CTR ((uint32_t)(1 << 23))
#define SPDIF_SCR_RXFIFO_OFF_ON ((uint32_t)(1 << 22))
#define SPDIF_SCR_RXFIFO_RST ((uint32_t)(1 << 21))
#define SPDIF_SCR_RXFIFOFULL_SEL(n) ((uint32_t)(((n)&0x03) << 19))
#define SPDIF_SCR_RXAUTOSYNC ((uint32_t)(1 << 18))
#define SPDIF_SCR_TXAUTOSYNC ((uint32_t)(1 << 17))
#define SPDIF_SCR_TXFIFOEMPTY_SEL(n) ((uint32_t)(((n)&0x03) << 15))
#define SPDIF_SCR_LOW_POWER ((uint32_t)(1 << 13))
#define SPDIF_SCR_SOFT_RESET ((uint32_t)(1 << 12))
#define SPDIF_SCR_TXFIFO_CTRL(n) ((uint32_t)(((n)&0x03) << 10))
#define SPDIF_SCR_DMA_RX_EN ((uint32_t)(1 << 9))
#define SPDIF_SCR_DMA_TX_EN ((uint32_t)(1 << 8))
#define SPDIF_SCR_VALCTRL ((uint32_t)(1 << 5))
#define SPDIF_SCR_TXSEL(n) ((uint32_t)(((n)&0x07) << 2))
#define SPDIF_SCR_USRC_SEL(n) ((uint32_t)(((n)&0x03) << 0))
#define SPDIF_SRCD_USYNCMODE ((uint32_t)(1 << 1))
#define SPDIF_SRPC_CLKSRC_SEL(n) ((uint32_t)(((n)&0x0f) << 7))
#define SPDIF_SRPC_LOCK ((uint32_t)(1 << 6))
#define SPDIF_SRPC_GAINSEL(n) ((uint32_t)(((n)&0x07) << 3))
#define SPDIF_SIE_LOCK ((uint32_t)(1 << 20))
#define SPDIF_SIE_TXUNOV ((uint32_t)(1 << 19))
#define SPDIF_SIE_TXRESYN ((uint32_t)(1 << 18))
#define SPDIF_SIE_CNEW ((uint32_t)(1 << 17))
#define SPDIF_SIE_VALNOGOOD ((uint32_t)(1 << 16))
#define SPDIF_SIE_SYMERR ((uint32_t)(1 << 15))
#define SPDIF_SIE_BITERR ((uint32_t)(1 << 14))
#define SPDIF_SIE_URXFUL ((uint32_t)(1 << 10))
#define SPDIF_SIE_URXOV ((uint32_t)(1 << 9))
#define SPDIF_SIE_QRXFUL ((uint32_t)(1 << 8))
#define SPDIF_SIE_QRXOV ((uint32_t)(1 << 7))
#define SPDIF_SIE_UQSYNC ((uint32_t)(1 << 6))
#define SPDIF_SIE_UQERR ((uint32_t)(1 << 5))
#define SPDIF_SIE_RXFIFOUNOV ((uint32_t)(1 << 4))
#define SPDIF_SIE_RXFIFORESYN ((uint32_t)(1 << 3))
#define SPDIF_SIE_LOCKLOSS ((uint32_t)(1 << 2))
#define SPDIF_SIE_TXEM ((uint32_t)(1 << 1))
#define SPDIF_SIE_RXFIFOFUL ((uint32_t)(1 << 0))
#define SPDIF_SIS_LOCK ((uint32_t)(1 << 20))
#define SPDIF_SIS_TXUNOV ((uint32_t)(1 << 19))
#define SPDIF_SIS_TXRESYN ((uint32_t)(1 << 18))
#define SPDIF_SIS_CNEW ((uint32_t)(1 << 17))
#define SPDIF_SIS_VALNOGOOD ((uint32_t)(1 << 16))
#define SPDIF_SIS_SYMERR ((uint32_t)(1 << 15))
#define SPDIF_SIS_BITERR ((uint32_t)(1 << 14))
#define SPDIF_SIS_URXFUL ((uint32_t)(1 << 10))
#define SPDIF_SIS_URXOV ((uint32_t)(1 << 9))
#define SPDIF_SIS_QRXFUL ((uint32_t)(1 << 8))
#define SPDIF_SIS_QRXOV ((uint32_t)(1 << 7))
#define SPDIF_SIS_UQSYNC ((uint32_t)(1 << 6))
#define SPDIF_SIS_UQERR ((uint32_t)(1 << 5))
#define SPDIF_SIS_RXFIFOUNOV ((uint32_t)(1 << 4))
#define SPDIF_SIS_RXFIFORESYN ((uint32_t)(1 << 3))
#define SPDIF_SIS_LOCKLOSS ((uint32_t)(1 << 2))
#define SPDIF_SIS_TXEM ((uint32_t)(1 << 1))
#define SPDIF_SIS_RXFIFOFUL ((uint32_t)(1 << 0))
#define SPDIF_SIC_LOCK ((uint32_t)(1 << 20))
#define SPDIF_SIC_TXUNOV ((uint32_t)(1 << 19))
#define SPDIF_SIC_TXRESYN ((uint32_t)(1 << 18))
#define SPDIF_SIC_CNEW ((uint32_t)(1 << 17))
#define SPDIF_SIC_VALNOGOOD ((uint32_t)(1 << 16))
#define SPDIF_SIC_SYMERR ((uint32_t)(1 << 15))
#define SPDIF_SIC_BITERR ((uint32_t)(1 << 14))
#define SPDIF_SIC_URXFUL ((uint32_t)(1 << 10))
#define SPDIF_SIC_URXOV ((uint32_t)(1 << 9))
#define SPDIF_SIC_QRXOV ((uint32_t)(1 << 7))
#define SPDIF_SIC_UQSYNC ((uint32_t)(1 << 6))
#define SPDIF_SIC_UQERR ((uint32_t)(1 << 5))
#define SPDIF_SIC_RXFIFOUNOV ((uint32_t)(1 << 4))
#define SPDIF_SIC_RXFIFORESYN ((uint32_t)(1 << 3))
#define SPDIF_SIC_LOCKLOSS ((uint32_t)(1 << 2))
#define SPDIF_STC_SYSCLK_DF(n) ((uint32_t)(((n)&0x1ff) << 11))
#define SPDIF_STC_TXCLK_SOURCE(n) ((uint32_t)(((n)&0x07) << 8))
#define SPDIF_STC_TX_ALL_CLK_EN ((uint32_t)(1 << 7))
#define SPDIF_STC_TXCLK_DF(n) ((uint32_t)(((n)&0x7f) << 0))

