gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
// 52.7: page 2969
#define IMXRT_SRC (*(IMXRT_REGISTER32_t *)0x400F8000)
#define SRC_SCR (IMXRT_SRC.offset000)
#define SRC_SBMR1 (IMXRT_SRC.offset004)
#define SRC_SRSR (IMXRT_SRC.offset008)
#define SRC_SBMR2 (IMXRT_SRC.offset01C)
/* 
These register are used by the ROM code and should not be used by application software 
#define SRC_GPR1			(IMXRT_SRC.offset020) 
#define SRC_GPR2			(IMXRT_SRC.offset024)
#define SRC_GPR3			(IMXRT_SRC.offset028)
#define SRC_GPR4			(IMXRT_SRC.offset02C)
#define SRC_GPR5			(IMXRT_SRC.offset030)
#define SRC_GPR6			(IMXRT_SRC.offset034)
#define SRC_GPR7			(IMXRT_SRC.offset038)
#define SRC_GPR8			(IMXRT_SRC.offset03C)
#define SRC_GPR9			(IMXRT_SRC.offset040)
#define SRC_GPR10			(IMXRT_SRC.offset044)
*/
#define SRC_SCR_MASK_WDOG3_RST(n) ((uint32_t)(((n)&0x0f) << 28))
#define SRC_SCR_DBG_RST_MSK_PG ((uint32_t)(1 << 25))
#define SRC_SCR_CORE0_DBG_RST ((uint32_t)(1 << 17))
#define SRC_SCR_CORE0_RST ((uint32_t)(1 << 13))
#define SRC_SCR_MASK_WDOG_RST(n) ((uint32_t)(((n)&0x0f) << 7))
#define SRC_SBMR1_BOOT_CFG4(n) ((uint32_t)(((n)&0xff) << 24))
#define SRC_SBMR1_BOOT_CFG3(n) ((uint32_t)(((n)&0xff) << 16))
#define SRC_SBMR1_BOOT_CFG2(n) ((uint32_t)(((n)&0xff) << 8))
#define SRC_SBMR1_BOOT_CFG1(n) ((uint32_t)(((n)&0xff) << 0))
#define SRC_SRSR_TEMPSENSE_RST_B ((uint32_t)(1 << 8))
#define SRC_SRSR_WDOG3_RST_B ((uint32_t)(1 << 7))
#define SRC_SRSR_JTAG_SW_RST ((uint32_t)(1 << 6))
#define SRC_SRSR_JTAG_RST_B ((uint32_t)(1 << 5))
#define SRC_SRSR_WDOG_RST_B ((uint32_t)(1 << 4))
#define SRC_SRSR_IPP_USER_RESET_B ((uint32_t)(1 << 3))
#define SRC_SRSR_CSU_RESET_B ((uint32_t)(1 << 2))
#define SRC_SRSR_LOCKUP_SYSRESETREQ ((uint32_t)(1 << 1))
#define SRC_SRSR_IPP_RESET_B ((uint32_t)(1 << 0))
#define SRC_SBMR2_BMOD(n) ((uint32_t)(((n)&0x03) << 24))
#define SRC_SBMR2_BT_FUSE_SEL ((uint32_t)(1 << 4))
#define SRC_SBMR2_DIR_BT_DIS ((uint32_t)(1 << 3))
#define SRC_SBMR2_SEC_CONFIG(n) ((uint32_t)(((n)&0x03) << 0))

// 53.3: page 2986
#define IMXRT_TEMPMON (*(IMXRT_REGISTER32_t *)0x400D8180)
#define TEMPMON_TEMPSENSE0 (IMXRT_TEMPMON.offset000)
#define TEMPMON_TEMPSENSE0_SET (IMXRT_TEMPMON.offset004)
#define TEMPMON_TEMPSENSE0_CLR (IMXRT_TEMPMON.offset008)
#define TEMPMON_TEMPSENSE0_TOG (IMXRT_TEMPMON.offset08c)
#define TEMPMON_TEMPSENSE1 (IMXRT_TEMPMON.offset090)
#define TEMPMON_TEMPSENSE1_SET (IMXRT_TEMPMON.offset094)
#define TEMPMON_TEMPSENSE1_CLR (IMXRT_TEMPMON.offset098)
#define TEMPMON_TEMPSENSE1_TOG (IMXRT_TEMPMON.offset09C)
#define TEMPMON_TEMPSENSE2 (IMXRT_TEMPMON.offset110)
#define TEMPMON_TEMPSENSE2_SET (IMXRT_TEMPMON.offset114)
#define TEMPMON_TEMPSENSE2_CLR (IMXRT_TEMPMON.offset118)
#define TEMPMON_TEMPSENSE2_TOG (IMXRT_TEMPMON.offset11C)
#define TEMPMON_CTRL0_ALARM_VALUE(n) ((uint32_t)(((n)&0x0fff) << 20))
#define TEMPMON_CTRL0_TEMP_CNT(n) ((uint32_t)(((n)&0x0fff) << 8))
#define TEMPMON_CTRL0_FINISHED ((uint32_t)(1 << 2))
#define TEMPMON_CTRL0_MEASURE_TEMP ((uint32_t)(1 << 1))
#define TEMPMON_CTRL0_POWER_DOWN ((uint32_t)(1 << 0))
#define TEMPMON_CTRL1_MEASURE_FREQ(n) ((uint32_t)(((n)&0xffff) << 0))
#define TEMPMON_CTRL2_PANIC_ALARM_VALUE(n) ((uint32_t)(((n)&0x0fff) << 16))
#define TEMPMON_CTRL2_LOW_ALARM_VALUE(n) ((uint32_t)(((n)&0x0fff) << 0))

// 54.3: page 2998
#define IMXRT_TSC (*(IMXRT_REGISTER32_t *)0x400E0000)
#define TSC_BASIC_SETTING (IMXRT_TSC.offset000)
#define TSC_PS_INPUT_BUFFER_ADDR (IMXRT_TSC.offset010)
#define TSC_FLOW_CONTROL (IMXRT_TSC.offset020)
#define TSC_MEASEURE_VALUE (IMXRT_TSC.offset030)
#define TSC_INT_EN (IMXRT_TSC.offset040)
#define TSC_INT_SIG_EN (IMXRT_TSC.offset050)
#define TSC_INT_STATUS (IMXRT_TSC.offset060)
#define TSC_DEBUG_MODE (IMXRT_TSC.offset070)
#define TSC_DEBUG_MODE2 (IMXRT_TSC.offset080)

// 55.4.1.1: page 3022
#define IMXRT_USB1 (*(IMXRT_REGISTER32_t *)0x402E0000)
#define USB1_ID (IMXRT_USB1.offset000)
#define USB1_HWGENERAL (IMXRT_USB1.offset004)
#define USB1_HWHOST (IMXRT_USB1.offset008)
#define USB1_HWDEVICE (IMXRT_USB1.offset00C)
#define USB1_HWTXBUF (IMXRT_USB1.offset010)
#define USB1_HWRXBUF (IMXRT_USB1.offset014)
#define USB1_GPTIMER0LD (IMXRT_USB1.offset080)
#define USB1_GPTIMER0CTRL (IMXRT_USB1.offset084)
#define USB1_GPTIMER1LD (IMXRT_USB1.offset088)
#define USB1_GPTIMER1CTRL (IMXRT_USB1.offset08C)
#define USB1_SBUSCFG (IMXRT_USB1.offset090)
#define USB1_HCIVERSION (IMXRT_USB1.offset100)
#define USB1_HCSPARAMS (IMXRT_USB1.offset104)
#define USB1_HCCPARAMS (IMXRT_USB1.offset108)
#define USB1_DCIVERSION (IMXRT_USB1.offset120)
#define USB1_DCCPARAMS (IMXRT_USB1.offset124)
#define USB1_USBCMD (IMXRT_USB1.offset140)
#define USB1_USBSTS (IMXRT_USB1.offset144)
#define USB1_USBINTR (IMXRT_USB1.offset148)
#define USB1_FRINDEX (IMXRT_USB1.offset14C)
#define USB1_PERIODICLISTBASE (IMXRT_USB1.offset154)
#define USB1_DEVICEADDR (IMXRT_USB1.offset154)
#define USB1_ASYNCLISTADDR (IMXRT_USB1.offset158)
#define USB1_ENDPOINTLISTADDR (IMXRT_USB1.offset158)
#define USB1_BURSTSIZE (IMXRT_USB1.offset160)
#define USB1_TXFILLTUNING (IMXRT_USB1.offset164)
#define USB1_ENDPTNAK (IMXRT_USB1.offset178)
#define USB1_ENDPTNAKEN (IMXRT_USB1.offset17C)
#define USB1_CONFIGFLAG (IMXRT_USB1.offset180)
#define USB1_PORTSC1 (IMXRT_USB1.offset184)
#define USB1_OTGSC (IMXRT_USB1.offset1A4)
#define USB1_USBMODE (IMXRT_USB1.offset1A8)
#define USB1_ENDPTSETUPSTAT (IMXRT_USB1.offset1AC)
#define USB1_ENDPTPRIME (IMXRT_USB1.offset1B0)
#define USB1_ENDPTFLUSH (IMXRT_USB1.offset1B4)
#define USB1_ENDPTSTATUS (IMXRT_USB1.offset1B8)
#define USB1_ENDPTCOMPLETE (IMXRT_USB1.offset1BC)
#define USB1_ENDPTCTRL0 (IMXRT_USB1.offset1C0)
#define USB1_ENDPTCTRL1 (IMXRT_USB1.offset1C4)
#define USB1_ENDPTCTRL2 (IMXRT_USB1.offset1C8)
#define USB1_ENDPTCTRL3 (IMXRT_USB1.offset1CC)
#define USB1_ENDPTCTRL4 (IMXRT_USB1.offset1D0)
#define USB1_ENDPTCTRL5 (IMXRT_USB1.offset1D4)
#define USB1_ENDPTCTRL6 (IMXRT_USB1.offset1D8)
#define USB1_ENDPTCTRL7 (IMXRT_USB1.offset1DC)
#define IMXRT_USB2 (*(IMXRT_REGISTER32_t *)0x402E0200)
#define USB2_ID (IMXRT_USB2.offset000)
#define USB2_HWGENERAL (IMXRT_USB2.offset004)
#define USB2_HWHOST (IMXRT_USB2.offset008)
#define USB2_HWDEVICE (IMXRT_USB2.offset00C)
#define USB2_HWTXBUF (IMXRT_USB2.offset010)
#define USB2_HWRXBUF (IMXRT_USB2.offset014)
#define USB2_GPTIMER0LD (IMXRT_USB2.offset080)
#define USB2_GPTIMER0CTRL (IMXRT_USB2.offset084)
#define USB2_GPTIMER1LD (IMXRT_USB2.offset088)
#define USB2_GPTIMER1CTRL (IMXRT_USB2.offset08C)
#define USB2_SBUSCFG (IMXRT_USB2.offset090)
#define USB2_HCIVERSION (IMXRT_USB2.offset100)
#define USB2_HCSPARAMS (IMXRT_USB2.offset104)
#define USB2_HCCPARAMS (IMXRT_USB2.offset108)
#define USB2_DCIVERSION (IMXRT_USB2.offset120)
#define USB2_DCCPARAMS (IMXRT_USB2.offset124)
#define USB2_USBCMD (IMXRT_USB2.offset140)
#define USB2_USBSTS (IMXRT_USB2.offset144)
#define USB2_USBINTR (IMXRT_USB2.offset148)
#define USB2_FRINDEX (IMXRT_USB2.offset14C)
#define USB2_PERIODICLISTBASE (IMXRT_USB2.offset154)
#define USB2_DEVICEADDR (IMXRT_USB2.offset154)
#define USB2_ASYNCLISTADDR (IMXRT_USB2.offset158)
#define USB2_ENDPOINTLISTADDR (IMXRT_USB2.offset158)
#define USB2_BURSTSIZE (IMXRT_USB2.offset160)
#define USB2_TXFILLTUNING (IMXRT_USB2.offset164)
#define USB2_ENDPTNAK (IMXRT_USB2.offset178)
#define USB2_ENDPTNAKEN (IMXRT_USB2.offset17C)
#define USB2_CONFIGFLAG (IMXRT_USB2.offset180)
#define USB2_PORTSC1 (IMXRT_USB2.offset184)
#define USB2_OTGSC (IMXRT_USB2.offset1A4)
#define USB2_USBMODE (IMXRT_USB2.offset1A8)
#define USB2_ENDPTSETUPSTAT (IMXRT_USB2.offset1AC)
#define USB2_ENDPTPRIME (IMXRT_USB2.offset1B0)
#define USB2_ENDPTFLUSH (IMXRT_USB2.offset1B4)
#define USB2_ENDPTSTATUS (IMXRT_USB2.offset1B8)
#define USB2_ENDPTCOMPLETE (IMXRT_USB2.offset1BC)
#define USB2_ENDPTCTRL0 (IMXRT_USB2.offset1C0)
#define USB2_ENDPTCTRL1 (IMXRT_USB2.offset1C4)
#define USB2_ENDPTCTRL2 (IMXRT_USB2.offset1C8)
#define USB2_ENDPTCTRL3 (IMXRT_USB2.offset1CC)
#define USB2_ENDPTCTRL4 (IMXRT_USB2.offset1D0)
#define USB2_ENDPTCTRL5 (IMXRT_USB2.offset1D4)
#define USB2_ENDPTCTRL6 (IMXRT_USB2.offset1D8)
#define USB2_ENDPTCTRL7 (IMXRT_USB2.offset1DC)
#define USB_USBCMD_ITC(n) ((uint32_t)(((n)&0xFF) << 16))
#define USB_USBCMD_FS_2 ((uint32_t)(1 << 15))
#define USB_USBCMD_ATDTW ((uint32_t)(1 << 14))
#define USB_USBCMD_SUTW ((uint32_t)(1 << 13))
#define USB_USBCMD_ASPE ((uint32_t)(1 << 11))
#define USB_USBCMD_ASP(n) ((uint32_t)(((n)&0x03) << 8))
#define USB_USBCMD_IAA ((uint32_t)(1 << 6))
#define USB_USBCMD_ASE ((uint32_t)(1 << 5))
#define USB_USBCMD_PSE ((uint32_t)(1 << 4))
#define USB_USBCMD_FS_1(n) ((uint32_t)(((n)&0x03) << 2))
#define USB_USBCMD_RST ((uint32_t)(1 << 1))
#define USB_USBCMD_RS ((uint32_t)(1 << 0))
#define USB_USBSTS_TI1 ((uint32_t)(1 << 25))
#define USB_USBSTS_TI0 ((uint32_t)(1 << 24))
#define USB_USBSTS_NAKI ((uint32_t)(1 << 16))
#define USB_USBSTS_AS ((uint32_t)(1 << 15))
#define USB_USBSTS_PS ((uint32_t)(1 << 14))
#define USB_USBSTS_RCL ((uint32_t)(1 << 13))
#define USB_USBSTS_HCH ((uint32_t)(1 << 12))
#define USB_USBSTS_ULPII ((uint32_t)(1 << 10))
#define USB_USBSTS_SLI ((uint32_t)(1 << 8))
#define USB_USBSTS_SRI ((uint32_t)(1 << 7))
#define USB_USBSTS_URI ((uint32_t)(1 << 6))
#define USB_USBSTS_AAI ((uint32_t)(1 << 5))
#define USB_USBSTS_SEI ((uint32_t)(1 << 4))
#define USB_USBSTS_FRI ((uint32_t)(1 << 3))
#define USB_USBSTS_PCI ((uint32_t)(1 << 2))
#define USB_USBSTS_UEI ((uint32_t)(1 << 1))
#define USB_USBSTS_UI ((uint32_t)(1 << 0))
#define USB_USBINTR_TIE1 ((uint32_t)(1 << 25))
#define USB_USBINTR_TIE0 ((uint32_t)(1 << 24))
#define USB_USBINTR_UPIE ((uint32_t)(1 << 19))
#define USB_USBINTR_UAIE ((uint32_t)(1 << 18))
#define USB_USBINTR_NAKE ((uint32_t)(1 << 16))
#define USB_USBINTR_ULPIE ((uint32_t)(1 << 10))
#define USB_USBINTR_SLE ((uint32_t)(1 << 8))
#define USB_USBINTR_SRE ((uint32_t)(1 << 7))
#define USB_USBINTR_URE ((uint32_t)(1 << 6))
#define USB_USBINTR_AAE ((uint32_t)(1 << 5))
#define USB_USBINTR_SEE ((uint32_t)(1 << 4))
#define USB_USBINTR_FRE ((uint32_t)(1 << 3))
#define USB_USBINTR_PCE ((uint32_t)(1 << 2))
#define USB_USBINTR_UEE ((uint32_t)(1 << 1))
#define USB_USBINTR_UE ((uint32_t)(1 << 0))
#define USB_DEVICEADDR_USBADR(n) ((uint32_t)(((n)&0x7F) << 25))
#define USB_DEVICEADDR_USBADRA ((uint32_t)(1 << 24))
#define USB_PORTSC1_PTS_1(n) ((uint32_t)(((n)&0x03) << 30))
#define USB_PORTSC1_STS ((uint32_t)(1 << 29))
#define USB_PORTSC1_PTW ((uint32_t)(1 << 28))
#define USB_PORTSC1_PSPD(n) ((uint32_t)(((n)&0x03) << 26))
#define USB_PORTSC1_PTS_2 ((uint32_t)(1 << 25))
#define USB_PORTSC1_PFSC ((uint32_t)(1 << 24))
#define USB_PORTSC1_PHCD ((uint32_t)(1 << 23))
#define USB_PORTSC1_WKOC ((uint32_t)(1 << 22))
#define USB_PORTSC1_WKDC ((uint32_t)(1 << 21))
#define USB_PORTSC1_WKCN ((uint32_t)(1 << 20))
#define USB_PORTSC1_PTC(n) ((uint32_t)(((n)&0x0F) << 16))
#define USB_PORTSC1_PIC(n) ((uint32_t)(((n)&0x03) << 14))
#define USB_PORTSC1_PO ((uint32_t)(1 << 13))
#define USB_PORTSC1_PP ((uint32_t)(1 << 12))
#define USB_PORTSC1_LS(n) ((uint32_t)(((n)&0x03) << 10))
#define USB_PORTSC1_HSP ((uint32_t)(1 << 9))
#define USB_PORTSC1_PR ((uint32_t)(1 << 8))
#define USB_PORTSC1_SUSP ((uint32_t)(1 << 7))
#define USB_PORTSC1_FPR ((uint32_t)(1 << 6))
#define USB_PORTSC1_OCC ((uint32_t)(1 << 5))
#define USB_PORTSC1_OCA ((uint32_t)(1 << 4))
#define USB_PORTSC1_PEC ((uint32_t)(1 << 3))
#define USB_PORTSC1_PE ((uint32_t)(1 << 2))
#define USB_PORTSC1_CSC ((uint32_t)(1 << 1))
#define USB_PORTSC1_CCS ((uint32_t)(1 << 0))
#define USB_USBMODE_SDIS ((uint32_t)(1 << 4))
#define USB_USBMODE_SLOM ((uint32_t)(1 << 3))
#define USB_USBMODE_ES ((uint32_t)(1 << 2))
#define USB_USBMODE_CM(n) ((uint32_t)(((n)&0x03) << 0))
#define USB_USBMODE_CM_MASK USB_USBMODE_CM(3)
#define USB_ENDPTCTRL_TXE ((uint32_t)(1 << 23))
#define USB_ENDPTCTRL_TXR ((uint32_t)(1 << 22))
#define USB_ENDPTCTRL_TXI ((uint32_t)(1 << 21))
#define USB_ENDPTCTRL_TXT(n) ((uint32_t)(((n)&0x03) << 18))
#define USB_ENDPTCTRL_TXD ((uint32_t)(1 << 17))
#define USB_ENDPTCTRL_TXS ((uint32_t)(1 << 16))
#define USB_ENDPTCTRL_RXE ((uint32_t)(1 << 7))
#define USB_ENDPTCTRL_RXR ((uint32_t)(1 << 6))
#define USB_ENDPTCTRL_RXI ((uint32_t)(1 << 5))
#define USB_ENDPTCTRL_RXT(n) ((uint32_t)(((n)&0x03) << 2))
#define USB_ENDPTCTRL_RXD ((uint32_t)(1 << 1))
#define USB_ENDPTCTRL_RXS ((uint32_t)(1 << 0))
#define USB_GPTIMERCTRL_GPTRUN ((uint32_t)(1 << 31))
#define USB_GPTIMERCTRL_GPTRST ((uint32_t)(1 << 30))
#define USB_GPTIMERCTRL_GPTMODE ((uint32_t)(1 << 24))
#define USB_GPTIMERCTRL_GPTCNT(n) ((uint32_t)(((n)&0xFFFFFF) << 0))

