gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
// 56.3: page 3283
#define IMXRT_USBPHY1 (*(IMXRT_REGISTER32_t *)0x400D9000)
#define USBPHY1_PWD (IMXRT_USBPHY1.offset000)
#define USBPHY1_PWD_SET (IMXRT_USBPHY1.offset004)
#define USBPHY1_PWD_CLR (IMXRT_USBPHY1.offset008)
#define USBPHY1_PWD_TOG (IMXRT_USBPHY1.offset00C)
#define USBPHY1_TX (IMXRT_USBPHY1.offset010)
#define USBPHY1_TX_SET (IMXRT_USBPHY1.offset014)
#define USBPHY1_TX_CLR (IMXRT_USBPHY1.offset018)
#define USBPHY1_TX_TOG (IMXRT_USBPHY1.offset01C)
#define USBPHY1_RX (IMXRT_USBPHY1.offset020)
#define USBPHY1_RX_SET (IMXRT_USBPHY1.offset024)
#define USBPHY1_RX_CLR (IMXRT_USBPHY1.offset028)
#define USBPHY1_RX_TOG (IMXRT_USBPHY1.offset02C)
#define USBPHY1_CTRL (IMXRT_USBPHY1.offset030)
#define USBPHY1_CTRL_SET (IMXRT_USBPHY1.offset034)
#define USBPHY1_CTRL_CLR (IMXRT_USBPHY1.offset038)
#define USBPHY1_CTRL_TOG (IMXRT_USBPHY1.offset03C)
#define USBPHY1_STATUS (IMXRT_USBPHY1.offset040)
#define USBPHY1_DEBUG (IMXRT_USBPHY1.offset050)
#define USBPHY1_DEBUG_SET (IMXRT_USBPHY1.offset054)
#define USBPHY1_DEBUG_CLR (IMXRT_USBPHY1.offset058)
#define USBPHY1_DEBUG_TOG (IMXRT_USBPHY1.offset05C)
#define USBPHY1_DEBUG0_STATUS (IMXRT_USBPHY1.offset060)
#define USBPHY1_DEBUG1 (IMXRT_USBPHY1.offset070)
#define USBPHY1_DEBUG1_SET (IMXRT_USBPHY1.offset074)
#define USBPHY1_DEBUG1_CLR (IMXRT_USBPHY1.offset078)
#define USBPHY1_DEBUG1_TOG (IMXRT_USBPHY1.offset07C)
#define USBPHY1_VERSION (IMXRT_USBPHY1.offset080)
#define IMXRT_USBPHY2 (*(IMXRT_REGISTER32_t *)0x400DA000)
#define USBPHY2_PWD (IMXRT_USBPHY2.offset000)
#define USBPHY2_PWD_SET (IMXRT_USBPHY2.offset004)
#define USBPHY2_PWD_CLR (IMXRT_USBPHY2.offset008)
#define USBPHY2_PWD_TOG (IMXRT_USBPHY2.offset00C)
#define USBPHY2_TX (IMXRT_USBPHY2.offset010)
#define USBPHY2_TX_SET (IMXRT_USBPHY2.offset014)
#define USBPHY2_TX_CLR (IMXRT_USBPHY2.offset018)
#define USBPHY2_TX_TOG (IMXRT_USBPHY2.offset01C)
#define USBPHY2_RX (IMXRT_USBPHY2.offset020)
#define USBPHY2_RX_SET (IMXRT_USBPHY2.offset024)
#define USBPHY2_RX_CLR (IMXRT_USBPHY2.offset028)
#define USBPHY2_RX_TOG (IMXRT_USBPHY2.offset02C)
#define USBPHY2_CTRL (IMXRT_USBPHY2.offset030)
#define USBPHY2_CTRL_SET (IMXRT_USBPHY2.offset034)
#define USBPHY2_CTRL_CLR (IMXRT_USBPHY2.offset038)
#define USBPHY2_CTRL_TOG (IMXRT_USBPHY2.offset03C)
#define USBPHY2_STATUS (IMXRT_USBPHY2.offset040)
#define USBPHY2_DEBUG (IMXRT_USBPHY2.offset050)
#define USBPHY2_DEBUG_SET (IMXRT_USBPHY2.offset054)
#define USBPHY2_DEBUG_CLR (IMXRT_USBPHY2.offset058)
#define USBPHY2_DEBUG_TOG (IMXRT_USBPHY2.offset05C)
#define USBPHY2_DEBUG0_STATUS (IMXRT_USBPHY2.offset060)
#define USBPHY2_DEBUG1 (IMXRT_USBPHY2.offset070)
#define USBPHY2_DEBUG1_SET (IMXRT_USBPHY2.offset074)
#define USBPHY2_DEBUG1_CLR (IMXRT_USBPHY2.offset078)
#define USBPHY2_DEBUG1_TOG (IMXRT_USBPHY2.offset07C)
#define USBPHY2_VERSION (IMXRT_USBPHY2.offset080)
#define USBPHY_PWD_RXPWDRX ((uint32_t)(1 << 20))
#define USBPHY_PWD_RXPWDDIFF ((uint32_t)(1 << 19))
#define USBPHY_PWD_RXPWD1PT1 ((uint32_t)(1 << 18))
#define USBPHY_PWD_RXPWDENV ((uint32_t)(1 << 17))
#define USBPHY_PWD_TXPWDV2I ((uint32_t)(1 << 12))
#define USBPHY_PWD_TXPWDIBIAS ((uint32_t)(1 << 11))
#define USBPHY_PWD_TXPWDFS ((uint32_t)(1 << 10))
#define USBPHY_TX_USBPHY_TX_EDGECTRL(n) ((uint32_t)(((n)&0x07) << 26))
#define USBPHY_TX_TXCAL45DP(n) ((uint32_t)(((n)&0x0F) << 16))
#define USBPHY_TX_TXCAL45DN(n) ((uint32_t)(((n)&0x0F) << 8))
#define USBPHY_TX_D_CAL(n) ((uint32_t)(((n)&0x0F) << 0))
#define USBPHY_RX_RXDBYPASS ((uint32_t)(1 << 22))
#define USBPHY_RX_DISCONADJ(n) ((uint32_t)(((n)&0x07) << 4))
#define USBPHY_RX_ENVADJ(n) ((uint32_t)(((n)&0x07) << 0))
#define USBPHY_CTRL_SFTRST ((uint32_t)(1 << 31))
#define USBPHY_CTRL_CLKGATE ((uint32_t)(1 << 30))
#define USBPHY_CTRL_UTMI_SUSPENDM ((uint32_t)(1 << 29))
#define USBPHY_CTRL_HOST_FORCE_LS_SE0 ((uint32_t)(1 << 28))
#define USBPHY_CTRL_OTG_ID_VALUE ((uint32_t)(1 << 27))
#define USBPHY_CTRL_FSDLL_RST_EN ((uint32_t)(1 << 24))
#define USBPHY_CTRL_ENVBUSCHG_WKUP ((uint32_t)(1 << 23))
#define USBPHY_CTRL_ENIDCHG_WKUP ((uint32_t)(1 << 22))
#define USBPHY_CTRL_ENDPDMCHG_WKUP ((uint32_t)(1 << 21))
#define USBPHY_CTRL_ENAUTOCLR_PHY_PWD ((uint32_t)(1 << 20))
#define USBPHY_CTRL_ENAUTOCLR_CLKGATE ((uint32_t)(1 << 19))
#define USBPHY_CTRL_ENAUTO_PWRON_PLL ((uint32_t)(1 << 18))
#define USBPHY_CTRL_WAKEUP_IRQ ((uint32_t)(1 << 17))
#define USBPHY_CTRL_ENIRQWAKEUP ((uint32_t)(1 << 16))
#define USBPHY_CTRL_ENUTMILEVEL3 ((uint32_t)(1 << 15))
#define USBPHY_CTRL_ENUTMILEVEL2 ((uint32_t)(1 << 14))
#define USBPHY_CTRL_DATA_ON_LRADC ((uint32_t)(1 << 13))
#define USBPHY_CTRL_DEVPLUGIN_IRQ ((uint32_t)(1 << 12))
#define USBPHY_CTRL_ENIRQDEVPLUGIN ((uint32_t)(1 << 11))
#define USBPHY_CTRL_RESUME_IRQ ((uint32_t)(1 << 10))
#define USBPHY_CTRL_ENIRQRESUMEDETECT ((uint32_t)(1 << 9))
#define USBPHY_CTRL_RESUMEIRQSTICKY ((uint32_t)(1 << 8))
#define USBPHY_CTRL_ENOTGIDDETECT ((uint32_t)(1 << 7))
#define USBPHY_CTRL_OTG_ID_CHG_IRQ ((uint32_t)(1 << 6))
#define USBPHY_CTRL_DEVPLUGIN_POLARITY ((uint32_t)(1 << 5))
#define USBPHY_CTRL_ENDEVPLUGINDETECT ((uint32_t)(1 << 4))
#define USBPHY_CTRL_HOSTDISCONDETECT_IRQ ((uint32_t)(1 << 3))
#define USBPHY_CTRL_ENIRQHOSTDISCON ((uint32_t)(1 << 2))
#define USBPHY_CTRL_ENHOSTDISCONDETECT ((uint32_t)(1 << 1))
#define USBPHY_CTRL_ENOTG_ID_CHG_IRQ ((uint32_t)(1 << 0))

// 57.9.1.1: page 3381
#define IMXRT_USDHC1 (*(IMXRT_REGISTER32_t *)0x402C0000)
#define USDHC1_DS_ADDR (IMXRT_USDHC1.offset000)
#define USDHC1_BLK_ATT (IMXRT_USDHC1.offset004)
#define USDHC1_CMD_ARG (IMXRT_USDHC1.offset008)
#define USDHC1_CMD_XFR_TYP (IMXRT_USDHC1.offset00C)
#define USDHC1_CMD_RSP0 (IMXRT_USDHC1.offset010)
#define USDHC1_CMD_RSP1 (IMXRT_USDHC1.offset014)
#define USDHC1_CMD_RSP2 (IMXRT_USDHC1.offset018)
#define USDHC1_CMD_RSP3 (IMXRT_USDHC1.offset01C)
#define USDHC1_DATA_BUFF_ACC_PORT (IMXRT_USDHC1.offset020)
#define USDHC1_PRES_STATE (IMXRT_USDHC1.offset024)
#define USDHC1_PROT_CTRL (IMXRT_USDHC1.offset028)
#define USDHC1_SYS_CTRL (IMXRT_USDHC1.offset02C)
#define USDHC1_INT_STATUS (IMXRT_USDHC1.offset030)
#define USDHC1_INT_STATUS_EN (IMXRT_USDHC1.offset034)
#define USDHC1_INT_SIGNAL_EN (IMXRT_USDHC1.offset038)
#define USDHC1_AUTOCMD12_ERR_STATUS (IMXRT_USDHC1.offset03C)
#define USDHC1_HOST_CTRL_CAP (IMXRT_USDHC1.offset040)
#define USDHC1_WTMK_LVL (IMXRT_USDHC1.offset044)
#define USDHC1_MIX_CTRL (IMXRT_USDHC1.offset048)
#define USDHC1_FORCE_EVENT (IMXRT_USDHC1.offset050)
#define USDHC1_ADMA_ERR_STATUS (IMXRT_USDHC1.offset054)
#define USDHC1_ADMA_SYS_ADDR (IMXRT_USDHC1.offset058)
#define USDHC1_DLL_CTRL (IMXRT_USDHC1.offset060)
#define USDHC1_DLL_STATUS (IMXRT_USDHC1.offset064)
#define USDHC1_CLK_TUNE_CTRL_STATUS (IMXRT_USDHC1.offset068)
#define USDHC1_VEND_SPEC (IMXRT_USDHC1.offset0C0)
#define USDHC1_MMC_BOOT (IMXRT_USDHC1.offset0C4)
#define USDHC1_VEND_SPEC2 (IMXRT_USDHC1.offset0C8)
#define USDHC1_TUNING_CTRL (IMXRT_USDHC1.offset0CC)
#define IMXRT_USDHC2 (*(IMXRT_REGISTER32_t *)0x402C4000)
#define USDHC2_DS_ADDR (IMXRT_USDHC2.offset000)
#define USDHC2_BLK_ATT (IMXRT_USDHC2.offset004)
#define USDHC2_CMD_ARG (IMXRT_USDHC2.offset008)
#define USDHC2_CMD_XFR_TYP (IMXRT_USDHC2.offset00C)
#define USDHC2_CMD_RSP0 (IMXRT_USDHC2.offset010)
#define USDHC2_CMD_RSP1 (IMXRT_USDHC2.offset014)
#define USDHC2_CMD_RSP2 (IMXRT_USDHC2.offset018)
#define USDHC2_CMD_RSP3 (IMXRT_USDHC2.offset01C)
#define USDHC2_DATA_BUFF_ACC_PORT (IMXRT_USDHC2.offset020)
#define USDHC2_PRES_STATE (IMXRT_USDHC2.offset024)
#define USDHC2_PROT_CTRL (IMXRT_USDHC2.offset028)
#define USDHC2_SYS_CTRL (IMXRT_USDHC2.offset02C)
#define USDHC2_INT_STATUS (IMXRT_USDHC2.offset030)
#define USDHC2_INT_STATUS_EN (IMXRT_USDHC2.offset034)
#define USDHC2_INT_SIGNAL_EN (IMXRT_USDHC2.offset038)
#define USDHC2_AUTOCMD12_ERR_STATUS (IMXRT_USDHC2.offset03C)
#define USDHC2_HOST_CTRL_CAP (IMXRT_USDHC2.offset040)
#define USDHC2_WTMK_LVL (IMXRT_USDHC2.offset044)
#define USDHC2_MIX_CTRL (IMXRT_USDHC2.offset048)
#define USDHC2_FORCE_EVENT (IMXRT_USDHC2.offset050)
#define USDHC2_ADMA_ERR_STATUS (IMXRT_USDHC2.offset054)
#define USDHC2_ADMA_SYS_ADDR (IMXRT_USDHC2.offset058)
#define USDHC2_DLL_CTRL (IMXRT_USDHC2.offset060)
#define USDHC2_DLL_STATUS (IMXRT_USDHC2.offset064)
#define USDHC2_CLK_TUNE_CTRL_STATUS (IMXRT_USDHC2.offset068)
#define USDHC2_VEND_SPEC (IMXRT_USDHC2.offset0C0)
#define USDHC2_MMC_BOOT (IMXRT_USDHC2.offset0C4)
#define USDHC2_VEND_SPEC2 (IMXRT_USDHC2.offset0C8)
#define USDHC2_TUNING_CTRL (IMXRT_USDHC2.offset0CC)

// 58.7.1.1: page 3461
#define IMXRT_WDOG1 (*(IMXRT_REGISTER16_t *)0x400B8000)
#define WDOG1_WCR (IMXRT_WDOG1.offset000)
#define WDOG1_WSR (IMXRT_WDOG1.offset002)
#define WDOG1_WRSR (IMXRT_WDOG1.offset004)
#define WDOG1_WICR (IMXRT_WDOG1.offset006)
#define WDOG1_WMCR (IMXRT_WDOG1.offset008)
#define IMXRT_WDOG2 (*(IMXRT_REGISTER16_t *)0x400D0000)
#define WDOG2_WCR (IMXRT_WDOG2.offset000)
#define WDOG2_WSR (IMXRT_WDOG2.offset002)
#define WDOG2_WRSR (IMXRT_WDOG2.offset004)
#define WDOG2_WICR (IMXRT_WDOG2.offset006)
#define WDOG2_WMCR (IMXRT_WDOG2.offset008)
#define WDOG_WCR_WDZST ((uint16_t)(1 << 0))
#define WDOG_WCR_WDBG ((uint16_t)(1 << 1))
#define WDOG_WCR_WDE ((uint16_t)(1 << 2))
#define WDOG_WCR_WDT ((uint16_t)(1 << 3))
#define WDOG_WCR_SRS ((uint16_t)(1 << 4))
#define WDOG_WCR_WDA ((uint16_t)(1 << 5))
#define WDOG_WCR_SRE ((uint16_t)(1 << 6))
#define WDOG_WCR_WDW ((uint16_t)(1 << 7))
#define WDOG_WCR_WT(n) ((uint16_t)(((n)&0xFF) << 8))
#define WDOG_WRSR_SFTW ((uint16_t)(1 << 0))
#define WDOG_WRSR_TOUT ((uint16_t)(1 << 1))
#define WDOG_WRSR_POR ((uint16_t)(1 << 4))

// 59.3.1.1: page 3471
#define IMXRT_WDOG3 (*(IMXRT_REGISTER32_t *)0x400BC000)
#define WDOG3_CS (IMXRT_WDOG3.offset000)
#define WDOG3_CNT (IMXRT_WDOG3.offset004)
#define WDOG3_TOVAL (IMXRT_WDOG3.offset008)
#define WDOG3_WIN (IMXRT_WDOG3.offset00C)
#define WDOG_CS_STOP ((uint16_t)(1 << 0))
#define WDOG_CS_WAIT ((uint16_t)(1 << 1))
#define WDOG_CS_DBG ((uint16_t)(1 << 2))
#define WDOG_CS_TST(n) ((uint16_t)(((n)&0x03) << 3))
#define WDOG_CS_UPDATE ((uint16_t)(1 << 5))
#define WDOG_CS_INT ((uint16_t)(1 << 6))
#define WDOG_CS_EN ((uint16_t)(1 << 7))
#define WDOG_CS_CLK(n) ((uint16_t)(((n)&0x03) << 8))
#define WDOG_CS_RCS ((uint16_t)(1 << 10))
#define WDOG_CS_ULK ((uint16_t)(1 << 11))
#define WDOG_CS_PRES ((uint16_t)(1 << 12))
#define WDOG_CS_CMD32EN ((uint16_t)(1 << 13))
#define WDOG_CS_FLG ((uint16_t)(1 << 14))
#define WDOG_CS_WIN ((uint16_t)(1 << 15))

// 60.4: page 3491
#define IMXRT_XBARA1 (*(IMXRT_REGISTER16_t *)0x403BC000)
#define XBARA1_SEL0 (IMXRT_XBARA1.offset000)
#define XBARA1_SEL1 (IMXRT_XBARA1.offset002)
#define XBARA1_SEL2 (IMXRT_XBARA1.offset004)
#define XBARA1_SEL3 (IMXRT_XBARA1.offset006)
#define XBARA1_SEL4 (IMXRT_XBARA1.offset008)
#define XBARA1_SEL5 (IMXRT_XBARA1.offset00A)
#define XBARA1_SEL6 (IMXRT_XBARA1.offset00C)
#define XBARA1_SEL7 (IMXRT_XBARA1.offset00E)
#define XBARA1_SEL8 (IMXRT_XBARA1.offset010)
#define XBARA1_SEL9 (IMXRT_XBARA1.offset012)
#define XBARA1_SEL10 (IMXRT_XBARA1.offset014)
#define XBARA1_SEL11 (IMXRT_XBARA1.offset016)
#define XBARA1_SEL12 (IMXRT_XBARA1.offset018)
#define XBARA1_SEL13 (IMXRT_XBARA1.offset01A)
#define XBARA1_SEL14 (IMXRT_XBARA1.offset01C)
#define XBARA1_SEL15 (IMXRT_XBARA1.offset01E)
#define XBARA1_SEL16 (IMXRT_XBARA1.offset020)
#define XBARA1_SEL17 (IMXRT_XBARA1.offset022)
#define XBARA1_SEL18 (IMXRT_XBARA1.offset024)
#define XBARA1_SEL19 (IMXRT_XBARA1.offset026)
#define XBARA1_SEL20 (IMXRT_XBARA1.offset028)
#define XBARA1_SEL21 (IMXRT_XBARA1.offset02A)
#define XBARA1_SEL22 (IMXRT_XBARA1.offset02C)
#define XBARA1_SEL23 (IMXRT_XBARA1.offset02E)
#define XBARA1_SEL24 (IMXRT_XBARA1.offset030)
#define XBARA1_SEL25 (IMXRT_XBARA1.offset032)
#define XBARA1_SEL26 (IMXRT_XBARA1.offset034)
#define XBARA1_SEL27 (IMXRT_XBARA1.offset036)
#define XBARA1_SEL28 (IMXRT_XBARA1.offset038)
#define XBARA1_SEL29 (IMXRT_XBARA1.offset03A)
#define XBARA1_CTRL0 (IMXRT_XBARA1.offset03C)
#define XBARA1_CTRL1 (IMXRT_XBARA1.offset03E)

// 61.3: page 3537
#define IMXRT_XBARB2 (*(IMXRT_REGISTER16_t *)0x403C0000)
#define XBARB2_SEL0 (IMXRT_XBARB2.offset000)
#define XBARB2_SEL1 (IMXRT_XBARB2.offset002)
#define XBARB2_SEL2 (IMXRT_XBARB2.offset004)
#define XBARB2_SEL3 (IMXRT_XBARB2.offset006)
#define XBARB2_SEL4 (IMXRT_XBARB2.offset008)
#define XBARB2_SEL5 (IMXRT_XBARB2.offset00A)
#define XBARB2_SEL6 (IMXRT_XBARB2.offset00C)
#define XBARB2_SEL7 (IMXRT_XBARB2.offset00E)
#define IMXRT_XBARB3 (*(IMXRT_REGISTER16_t *)0x403C4000)
#define XBARB3_SEL0 (IMXRT_XBARB3.offset000)
#define XBARB3_SEL1 (IMXRT_XBARB3.offset002)
#define XBARB3_SEL2 (IMXRT_XBARB3.offset004)
#define XBARB3_SEL3 (IMXRT_XBARB3.offset006)
#define XBARB3_SEL4 (IMXRT_XBARB3.offset008)
#define XBARB3_SEL5 (IMXRT_XBARB3.offset00A)
#define XBARB3_SEL6 (IMXRT_XBARB3.offset00C)
#define XBARB3_SEL7 (IMXRT_XBARB3.offset00E)

// 62.5: page 3548
#define IMXRT_XTALOSC24M (*(IMXRT_REGISTER32_t *)0x400D8000)
#define XTALOSC24M_MISC0 (IMXRT_XTALOSC24M.offset150)
#define XTALOSC24M_LOWPWR_CTRL (IMXRT_XTALOSC24M.offset270)
#define XTALOSC24M_LOWPWR_CTRL_SET (IMXRT_XTALOSC24M.offset274)
#define XTALOSC24M_LOWPWR_CTRL_CLR (IMXRT_XTALOSC24M.offset278)
#define XTALOSC24M_LOWPWR_CTRL_TOG (IMXRT_XTALOSC24M.offset27C)
#define XTALOSC24M_OSC_CONFIG0 (IMXRT_XTALOSC24M.offset2A0)
#define XTALOSC24M_OSC_CONFIG0_SET (IMXRT_XTALOSC24M.offset2A4)
#define XTALOSC24M_OSC_CONFIG0_CLR (IMXRT_XTALOSC24M.offset2A8)
#define XTALOSC24M_OSC_CONFIG0_TOG (IMXRT_XTALOSC24M.offset2AC)
#define XTALOSC24M_OSC_CONFIG1 (IMXRT_XTALOSC24M.offset2B0)
#define XTALOSC24M_OSC_CONFIG1_SET (IMXRT_XTALOSC24M.offset2B4)
#define XTALOSC24M_OSC_CONFIG1_CLR (IMXRT_XTALOSC24M.offset2B8)
#define XTALOSC24M_OSC_CONFIG1_TOG (IMXRT_XTALOSC24M.offset2BC)
#define XTALOSC24M_OSC_CONFIG2 (IMXRT_XTALOSC24M.offset2C0)
#define XTALOSC24M_OSC_CONFIG2_SET (IMXRT_XTALOSC24M.offset2C4)
#define XTALOSC24M_OSC_CONFIG2_CLR (IMXRT_XTALOSC24M.offset2C8)
#define XTALOSC24M_OSC_CONFIG2_TOG (IMXRT_XTALOSC24M.offset2CC)

// 0 = highest priority
// Cortex-M7: 0,16,32,48,64,80,96,112,128,144,160,176,192,208,224,240
#define NVIC_SET_PRIORITY(irqnum, priority) (*((volatile uint8_t *)0xE000E400 + (irqnum)) = (uint8_t)(priority))
#define NVIC_GET_PRIORITY(irqnum) (*((uint8_t *)0xE000E400 + (irqnum)))

#define __disable_irq() __asm__ volatile("CPSID i" :: \
                                             : "memory");
#define __enable_irq() __asm__ volatile("CPSIE i" :: \
                                            : "memory");

// System Control Space (SCS), ARMv7 ref manual, B3.2, page 708
#define SCB_CPUID (*(const uint32_t *)0xE000ED00)   // CPUID Base Register
#define SCB_ICSR (*(volatile uint32_t *)0xE000ED04) // Interrupt Control and State
#define SCB_ICSR_NMIPENDSET ((uint32_t)(1 << 31))
#define SCB_ICSR_PENDSVSET ((uint32_t)(1 << 28))
#define SCB_ICSR_PENDSVCLR ((uint32_t)(1 << 27))
#define SCB_ICSR_PENDSTSET ((uint32_t)(1 << 26))
#define SCB_ICSR_PENDSTCLR ((uint32_t)(1 << 25))
#define SCB_ICSR_ISRPREEMPT ((uint32_t)(1 << 23))
#define SCB_ICSR_ISRPENDING ((uint32_t)(1 << 22))
#define SCB_ICSR_RETTOBASE ((uint32_t)(1 << 11))
#define SCB_VTOR (*(volatile uint32_t *)0xE000ED08)  // Vector Table Offset
#define SCB_AIRCR (*(volatile uint32_t *)0xE000ED0C) // Application Interrupt & Reset
#define SCB_SCR (*(volatile uint32_t *)0xE000ED10)   // System Control Register
#define SCB_SCR_SEVONPEND ((uint8_t)0x10)            // Send Event on Pending bit
#define SCB_SCR_SLEEPDEEP ((uint8_t)0x04)            // Sleep or Deep Sleep
#define SCB_SCR_SLEEPONEXIT ((uint8_t)0x02)          // Sleep-on-exit
#define SCB_CCR (*(volatile uint32_t *)0xE000ED14)   // Configuration and Control
#define SCB_CCR_BP ((uint32_t)(1 << 18))             // Branch prediction enable
#define SCB_CCR_IC ((uint32_t)(1 << 17))             // Instruction caches enable
#define SCB_CCR_DC ((uint32_t)(1 << 16))
#define SCB_CCR_STKALIGN ((uint32_t)(1 << 9))
#define SCB_CCR_BFHFNMIGN ((uint32_t)(1 << 8))
#define SCB_CCR_DIV_0_TRP ((uint32_t)(1 << 4))
#define SCB_CCR_UNALIGN_TRP ((uint32_t)(1 << 3))
#define SCB_CCR_USERSETMPEND ((uint32_t)(1 << 1))
#define SCB_CCR_NONBASETHRDENA ((uint32_t)(1 << 0))
#define SCB_SHPR1 (*(volatile uint32_t *)0xE000ED18)  // System Handler Priority 1
#define SCB_SHPR2 (*(volatile uint32_t *)0xE000ED1C)  // System Handler Priority 2
#define SCB_SHPR3 (*(volatile uint32_t *)0xE000ED20)  // System Handler Priority 3
#define SCB_SHCSR (*(volatile uint32_t *)0xE000ED24)  // System Handler Control & State
#define SCB_CFSR (*(volatile uint32_t *)0xE000ED28)   // Configurable Fault Status
#define SCB_HFSR (*(volatile uint32_t *)0xE000ED2C)   // HardFault Status
#define SCB_DFSR (*(volatile uint32_t *)0xE000ED30)   // Debug Fault Status
#define SCB_MMFAR (*(volatile uint32_t *)0xE000ED34)  // MemManage Fault Address
#define SCB_BFAR (*(volatile uint32_t *)0xE000ED38)   // Bus Fault Address
#define SCB_AFAR (*(volatile uint32_t *)0xE000ED3C)   // Aux Fault Address
#define SCB_ID_PFR0 (*(const uint32_t *)0xE000ED40)   // Processor Feature 0
#define SCB_ID_PFR1 (*(const uint32_t *)0xE000ED44)   // Processor Feature 1
#define SCB_ID_DFR0 (*(const uint32_t *)0xE000ED48)   // Debug Feature 0
#define SCB_ID_AFR0 (*(const uint32_t *)0xE000ED4C)   // Auxiliary Feature 0
#define SCB_ID_MMFR0 (*(const uint32_t *)0xE000ED50)  // Memory Model Feature 0
#define SCB_ID_MMFR1 (*(const uint32_t *)0xE000ED54)  // Memory Model Feature 1
#define SCB_ID_MMFR2 (*(const uint32_t *)0xE000ED58)  // Memory Model Feature 2
#define SCB_ID_MMFR3 (*(const uint32_t *)0xE000ED5C)  // Memory Model Feature 3
#define SCB_ID_ISAR0 (*(const uint32_t *)0xE000ED60)  // Instruction Set Attribute 0
#define SCB_ID_ISAR1 (*(const uint32_t *)0xE000ED64)  // Instruction Set Attribute 1
#define SCB_ID_ISAR2 (*(const uint32_t *)0xE000ED68)  // Instruction Set Attribute 2
#define SCB_ID_ISAR3 (*(const uint32_t *)0xE000ED6C)  // Instruction Set Attribute 3
#define SCB_ID_ISAR4 (*(const uint32_t *)0xE000ED70)  // Instruction Set Attribute 4
#define SCB_ID_CLIDR (*(const uint32_t *)0xE000ED78)  // Cache Level ID
#define SCB_ID_CTR (*(const uint32_t *)0xE000ED7C)    // Cache Type
#define SCB_ID_CCSIDR (*(const uint32_t *)0xE000ED80) // Cache Size ID
#define SCB_ID_CSSELR (*(const uint32_t *)0xE000ED84) // Cache Size Selection
#define SCB_CPACR (*(volatile uint32_t *)0xE000ED88)  // Coprocessor Access Control
#define SCB_FPCCR (*(volatile uint32_t *)0xE000EF34)  // FP Context Control
#define SCB_FPCAR (*(volatile uint32_t *)0xE000EF38)  // FP Context Address
#define SCB_FPDSCR (*(volatile uint32_t *)0xE000EF3C) // FP Default Status Control
#define SCB_MVFR0 (*(volatile uint32_t *)0xE000EF40)  // Media & FP Feature 0
#define SCB_MVFR1 (*(volatile uint32_t *)0xE000EF44)  // Media & FP Feature 1
#define SCB_MVFR2 (*(volatile uint32_t *)0xE000EF48)  // Media & FP Feature 2

#define SYST_CSR (*(volatile uint32_t *)0xE000E010) // SysTick Control and Status
#define SYST_CSR_COUNTFLAG ((uint32_t)(1 << 16))
#define SYST_CSR_CLKSOURCE ((uint32_t)(1 << 2))
#define SYST_CSR_TICKINT ((uint32_t)(1 << 1))
#define SYST_CSR_ENABLE ((uint32_t)(1 << 0))
#define SYST_RVR (*(volatile uint32_t *)0xE000E014) // SysTick Reload Value Register
#define SYST_CVR (*(volatile uint32_t *)0xE000E018) // SysTick Current Value Register
#define SYST_CALIB (*(const uint32_t *)0xE000E01C)  // SysTick Calibration Value

// Nested Vectored Interrupt Controller, Table 3-4 & ARMv7 ref, appendix B3.4 (page 750)
#define NVIC_ISER0 (*(volatile uint32_t *)0xE000E100)
#define NVIC_ISER1 (*(volatile uint32_t *)0xE000E104)
#define NVIC_ISER2 (*(volatile uint32_t *)0xE000E108)
#define NVIC_ISER3 (*(volatile uint32_t *)0xE000E10C)
#define NVIC_ISER4 (*(volatile uint32_t *)0xE000E110)
#define NVIC_ICER0 (*(volatile uint32_t *)0xE000E180)
#define NVIC_ICER1 (*(volatile uint32_t *)0xE000E184)
#define NVIC_ICER2 (*(volatile uint32_t *)0xE000E188)
#define NVIC_ICER3 (*(volatile uint32_t *)0xE000E18C)
#define NVIC_ICER4 (*(volatile uint32_t *)0xE000E190)
#define NVIC_STIR (*(volatile uint32_t *)0xE000EF00)
#define NVIC_ENABLE_IRQ(n) (*(&NVIC_ISER0 + ((n) >> 5)) = (1 << ((n)&31)))
#define NVIC_DISABLE_IRQ(n) (*(&NVIC_ICER0 + ((n) >> 5)) = (1 << ((n)&31)))
#define NVIC_SET_PENDING(n) (*((volatile uint32_t *)0xE000E200 + ((n) >> 5)) = (1 << ((n)&31)))
#define NVIC_CLEAR_PENDING(n) (*((volatile uint32_t *)0xE000E280 + ((n) >> 5)) = (1 << ((n)&31)))
#define NVIC_IS_ENABLED(n) (*(&NVIC_ISER0 + ((n) >> 5)) & (1 << ((n)&31)))
#define NVIC_IS_PENDING(n) (*((volatile uint32_t *)0xE000E200 + ((n) >> 5)) & (1 << ((n)&31)))
#define NVIC_IS_ACTIVE(n) (*((volatile uint32_t *)0xE000E300 + ((n) >> 5)) & (1 << ((n)&31)))
#define NVIC_TRIGGER_IRQ(n) NVIC_STIR = (n)

#define ARM_DEMCR (*(volatile uint32_t *)0xE000EDFC)      // Debug Exception and Monitor Control
#define ARM_DEMCR_TRCENA (1 << 24)                        // Enable debugging & monitoring blocks
#define ARM_DWT_CTRL (*(volatile uint32_t *)0xE0001000)   // DWT control register
#define ARM_DWT_CTRL_CYCCNTENA (1 << 0)                   // Enable cycle count
#define ARM_DWT_CYCCNT (*(volatile uint32_t *)0xE0001004) // Cycle count register

