gridbugs/teensy-minimal-bare-metal/src/imxrt1062.h
#define SCB_MPU_TYPE (*(volatile uint32_t *)0xE000ED90) //
#define SCB_MPU_CTRL (*(volatile uint32_t *)0xE000ED94) //
#define SCB_MPU_CTRL_PRIVDEFENA ((uint32_t)(1 << 2))    // Enables default memory map
#define SCB_MPU_CTRL_HFNMIENA ((uint32_t)(1 << 1))      // Use MPU for HardFault & NMI
#define SCB_MPU_CTRL_ENABLE ((uint32_t)(1 << 0))        // Enables MPU
#define SCB_MPU_RNR (*(volatile uint32_t *)0xE000ED98)  //
#define SCB_MPU_RBAR (*(volatile uint32_t *)0xE000ED9C) //
#define SCB_MPU_RBAR_ADDR_MASK ((uint32_t)(0xFFFFFFE0))
#define SCB_MPU_RBAR_VALID ((uint32_t)(1 << 4))
#define SCB_MPU_RBAR_REGION(n) ((uint32_t)((n)&15))
#define SCB_MPU_RASR (*(volatile uint32_t *)0xE000EDA0) // ARM DDI0403E, pg 696
#define SCB_MPU_RASR_XN ((uint32_t)(1 << 28))
#define SCB_MPU_RASR_AP(n) ((uint32_t)(((n)&7) << 24))
#define SCB_MPU_RASR_TEX(n) ((uint32_t)(((n)&7) << 19))
#define SCB_MPU_RASR_S ((uint32_t)(1 << 18))
#define SCB_MPU_RASR_C ((uint32_t)(1 << 17))
#define SCB_MPU_RASR_B ((uint32_t)(1 << 16))
#define SCB_MPU_RASR_SRD(n) ((uint32_t)(((n)&255) << 8))
#define SCB_MPU_RASR_SIZE(n) ((uint32_t)(((n)&31) << 1))
#define SCB_MPU_RASR_ENABLE ((uint32_t)(1 << 0))
#define SCB_MPU_RBAR_A1 (*(volatile uint32_t *)0xE000EDA4) //
#define SCB_MPU_RASR_A1 (*(volatile uint32_t *)0xE000EDA8) //
#define SCB_MPU_RBAR_A2 (*(volatile uint32_t *)0xE000EDAC) //
#define SCB_MPU_RASR_A2 (*(volatile uint32_t *)0xE000EDB0) //
#define SCB_MPU_RBAR_A3 (*(volatile uint32_t *)0xE000EDB4) //
#define SCB_MPU_RASR_A3 (*(volatile uint32_t *)0xE000EDB8) //

#define SCB_CACHE_ICIALLU (*(volatile uint32_t *)0xE000EF50)
#define SCB_CACHE_ICIMVAU (*(volatile uint32_t *)0xE000EF58)
#define SCB_CACHE_DCIMVAC (*(volatile uint32_t *)0xE000EF5C)
#define SCB_CACHE_DCISW (*(volatile uint32_t *)0xE000EF60)
#define SCB_CACHE_DCCMVAU (*(volatile uint32_t *)0xE000EF64)
#define SCB_CACHE_DCCMVAC (*(volatile uint32_t *)0xE000EF68)
#define SCB_CACHE_DCCSW (*(volatile uint32_t *)0xE000EF6C)
#define SCB_CACHE_DCCIMVAC (*(volatile uint32_t *)0xE000EF70)
#define SCB_CACHE_DCCISW (*(volatile uint32_t *)0xE000EF74)
#define SCB_CACHE_BPIALL (*(volatile uint32_t *)0xE000EF78)

// Flush data from cache to memory
//
// Normally arm_dcache_flush() is used when metadata written to memory
// will be used by a DMA or a bus-master peripheral.  Any data in the
// cache is written to memory.  A copy remains in the cache, so this is
// typically used with special fields you will want to quickly access
// in the future.  For data transmission, use arm_dcache_flush_delete().
__attribute__((always_inline, unused))
static inline void arm_dcache_flush(void *addr, uint32_t size)
{
    uint32_t location = (uint32_t)addr & 0xFFFFFFE0;
    uint32_t end_addr = (uint32_t)addr + size;
    asm("dsb");
    do
    {
        SCB_CACHE_DCCMVAC = location;
        location += 32;
    } while (location < end_addr);
    asm("dsb");
    asm("isb");
}

// Delete data from the cache, without touching memory
//
// Normally arm_dcache_delete() is used before receiving data via
// DMA or from bus-master peripherals which write to memory.  You
// want to delete anything the cache may have stored, so your next
// read is certain to access the physical memory.
__attribute__((always_inline, unused))
static inline void arm_dcache_delete(void *addr, uint32_t size)
{
    uint32_t location = (uint32_t)addr & 0xFFFFFFE0;
    uint32_t end_addr = (uint32_t)addr + size;
    asm("dsb");
    do
    {
        SCB_CACHE_DCIMVAC = location;
        location += 32;
    } while (location < end_addr);
    asm("dsb");
    asm("isb");
}

// Flush data from cache to memory, and delete it from the cache
//
// Normally arm_dcache_flush_delete() is used when transmitting data
// via DMA or bus-master peripherals which read from memory.  You want
// any cached data written to memory, and then removed from the cache,
// because you no longer need to access the data after transmission.
__attribute__((always_inline, unused))
static inline void arm_dcache_flush_delete(void *addr, uint32_t size)
{
    uint32_t location = (uint32_t)addr & 0xFFFFFFE0;
    uint32_t end_addr = (uint32_t)addr + size;
    asm("dsb");
    do
    {
        SCB_CACHE_DCCIMVAC = location;
        location += 32;
    } while (location < end_addr);
    asm("dsb");
    asm("isb");
}
